[{"post":{"author":"monotreme","post_time":"3 days ago","post_title":"SARS-Cov-2 Virus and Sunshine","post_content":"Is there any evidence on how long the virus survives in sunshine?","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/113849/sars-cov-2-virus-and-sunshine"},{"post":{"author":"Anonymous","post_time":"19 days ago","post_title":"COVID-19","post_content":"Is there someone here who has or has had covid-19 that can shed light on the symptoms? I am really curious about the symptoms.\n\nTIA for your replies.","like_count":"1","tags":["Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"18 days ago","resp_title":"RE: COVID-19","resp_content":"You can check it online...\n"},{"author":"Anonymous","resp_time":"18 days ago","resp_title":"RE: COVID-19","resp_content":"Thank you\n"},{"author":"WebMD Chris","resp_time":"18 days ago","resp_title":"RE: COVID-19","resp_content":"Here's some information for you.\nhttps://www.webmd.com/lung/what-is-covid-19\n"},{"author":"abordage","resp_time":"6 days ago","resp_title":"RE: COVID-19","resp_content":"If you have asthma, you're a lot more vulnerable to corona then other people. Try to stay home as much as you can. Corona can give complications from your sickness and make it deadly. I have this problem too, BTW. Take care of yourself, wash your hands and don't leave the house without a serious reason. At the moment it's very dangerous for people like you and me.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/113129/covid-19"},{"post":{"author":"brockb86","post_time":"over 3 years ago","post_title":"Vaping","post_content":"I switched over to vaping about 6 months ago and ever since then when I use the vaporizor for about the past 3 months I have chills the next day, inability to get warm and problems breathing. I do think vaping is better for you than smoking but I was wondering if anyone had any idea what would be causing so many issues. I dont know if its the brand I am using or if I have a bigger issue. I go from very hot to very cold and seem to have no control over it, plus I have been having increasing issues breathing. Can anyone help?","like_count":"1","tags":["Diagnosis"]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Vaping","resp_content":"Hi there. Thanks for posting.\n\nI would speak with your doctor about the pros and cons of vaping before continuing to use e-cigarettes. It says here (http://wb.md/2edJoDF) that in addition to containing nicotine, some brands contain chemicals including formaldehyde -- often used in building materials -- and another ingredient used in antifreeze that can cause cancer.\n\nHere is information that I found on WebMD about e-cigs.\n\n1) Health Risks of E-Cigarettes: http://wb.md/2edJwD9\n\n2) E-Cigs May Contain Chemicals Tied to Lung Disease: http://wb.md/2dGqJjr\n\nIf you are having trouble breathing after vaping then I highly suggest seeing your doctor. I hope that you'll come back and let us know how you're feeling soon.\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Vaping","resp_content":"A lot of people have trouble breathing after vaping. I think that shoul be your first clue. If something makes it difficult to breathe then you should probably stop....\n"},{"author":"abordage","resp_time":"11 days ago","resp_title":"RE: Vaping","resp_content":"Well, if you have such issues, maybe you really should see a doctor. And try to use other vape liquid. It may sound like nonsense, but sometimes it really helps. I had a similar issue and after switching to other brand this problem was solved. I started to smoke e-cig liquid Aquavape from https://aquavape.co.uk site. Nice and smooth flavor, no problems with lungs, good price. Not a single disadvantage. Maybe it will help you. But first, visit a doctor. Maybe you have more serious issues than you think.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/954/vaping"},{"post":{"author":"friti32","post_time":"12 days ago","post_title":"https://www.completefoods.co/diy/recipes/ultra-x-prime-male-enhancement-1-testosterone-booster","post_content":"effects. On the other hand chemical product have their own side effects such as increase in blood pressure, skin irritations and can even cause insomnia in certain cases. Natural male enhancers are made completely of natural and herbal materials, thus they are 100% free from any type of side effects.\nhttps://www.completefoods.co/diy/recipes/ultra-x-prime-male-enhancement-1-testosterone-booster","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/113483/https-www-completefoods-co-diy-recipes-ultra-x-prime-male-enhancement-1-testosterone-booster"},{"post":{"author":"Anonymous","post_time":"14 days ago","post_title":"Covid 19","post_content":"Just curious if my symptoms could have been covid 19 since our area was virtually non existant for testing, and I am fully recovered from whatever it had, as this was from Feb 17 to March 3 before I felt 100 percent better. but curious if in fact what i had was the flu or something else. I am a 48 year old non smoker\n\nIt started with a sore throat, then the next day a cough came on. Followed by a slight fever. Worsen productive cough, yellow stuff. Followed by a headache that was so bad at times I would have to hold my head with both hands to cough. Fatigue and my voice was lost for about 6 days. I lost my sense of smell and taste about 4 days in. Then about 5 days after the sore throat the cough went dry and non stop for about a week. Never had shortness of breath, but was always tired and didnt want to do anything. Was this just the flu??","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/113412/covid-19"},{"post":{"author":"scooter77","post_time":"14 days ago","post_title":"History of Asthma and worried","post_content":"I am a 60 year old female with a history of adult onset asthma, I have been hospitalized several times for asthma attacks. My normal SaO2 is usually only around 93%. One hospitalization my SaO2 was 87% when I got to the ER. I have not had to go to the ER for a breathing TX in over a year. My question is--My youngest daughter and her family live with me. My daughter and 4 of her kids had positive throat cultures for strep. I think I may have it ive not been feeling well the last few days. Ive had a continuous headache no fever that I know of. Im afraid to go to the clinic or ER afraid of getting exposed to corona virus there","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/113371/history-of-asthma-and-worried"},{"post":{"author":"Anonymous","post_time":"27 days ago","post_title":"I'm concerned about my pulmonary function test results","post_content":"I recently had a pulmonary function test due to having had a cough for 6 months, shortness of breath quite easily and fatigue. During the test, I had a couple of cough attacks when I was having to breath into the tube. I was given an Albuterol inhaler and my breathing improved. I didn't have any more bad cough attacks. I thought this meant that I might have asthma. My results came back and the impression by the doctor who interpreted the results was that there was an airflow obstruction in the small airways which reverses with the inhaler, and residual volume is elevated consistent with air trapping, and flow volume loop shape is suggestive of an airflow obstruction, and FEF 25-75% is 1.56 L/sec which is only 59% of predicted which indicates small airways dysfunction. To me, upon reading these results, it looked like I had asthma. However, my actual doctor sent me an email that simply said my pulmonary function test results was normal. I don't understand how these results can be normal? Can anybody shed some light on this for me please as I'm very confused.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/112551/i-m-concerned-about-my-pulmonary-function-test-results"},{"post":{"author":"Anonymous","post_time":"4 months ago","post_title":"Alcohol and Asthma","post_content":"I found out that red wine is a trigger for my e-asthma. I seem to be ok with beer but I also some times enjoy rum and coke. Am I tempting fate?","like_count":"0","tags":[]},"responses":[{"author":"brownie252","resp_time":"2 months ago","resp_title":"RE: Alcohol and Asthma","resp_content":"I'm not sure you can drink alcohol with this diagnosis. It's better to save your health, of course. Sometimes, alcohol is allowed in small doses, for treatment. But it's not about a cocktail or 2 glasses of wine. It's about one shot. For my part, my doctor forbade me to drink, because I have very poor health and stomach problems. A little while ago, I used to drink whiskey and my friends knew about my hobby and brought me whiskey and whiskey glasses from different countries. So I have a similar collection of glasses ( like here https://www.bourbonandboots.com/whiskey-glasses/ ) that reminds me of the old days. And I understand that I must follow the doctor's advice if I want to be healthy and live long.\n"},{"author":"jan4air","resp_time":"1 month ago","resp_title":"RE: Alcohol and Asthma","resp_content":"I stopped drinking all alcohol altogether and have noticeably better controlled asthma and inflammation (in general). Not to say I don't still have other allergies and triggers for asthmatic coughs but nixing the alcohol (beer, wine, liquor) has made a difference enough that I have decided it isn't worth it to 'tempt fate' as you say.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/103799/alcohol-and-asthma"},{"post":{"author":"markmooserock","post_time":"1 month ago","post_title":"Details about Disseminated Histoplasmosis","post_content":"I’m writing a book about a character who possibly contracts Disseminated Histoplasmosis, and I have a few questions. If an adult in their late twenties has severe asthma, as I understand it, they are at an increased risk of contracting this disease. Is it possible for this person to assume the Disseminated Histoplasmosis symptoms they begin to experience are due to their asthma, and the disease goes untreated long enough to reach the “untreatable” stage? Assuming the disease is fatal in their case, what should they expect from the last few months of their life, both physically and mentally? Also, what is the likelihood that a medical doctor could overlook DH, assuming the patient’s symptoms are related to their asthma? And lastly, it’s clear that the disease can be transmitted through bird feces. Just for the sake of fact-checking, does this include seagulls as well? Thank you so much in advance.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/111251/details-about-disseminated-histoplasmosis"},{"post":{"author":"Anonymous","post_time":"1 month ago","post_title":"Taking Singulair","post_content":"Just prescribed Singulair and don't like the list of side effects. Please share your experience with this drug. Thank you","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/109991/taking-singulair"},{"post":{"author":"hopfroglane","post_time":"2 months ago","post_title":"Asthma or something else?","post_content":"My 10 year old son gets an extremely blotchy face with exercise (basketball for now). He gets a white circular around his mouth and spots by his eyes on his cheeks. The rest of his face gets bright red. He complains of his throat feeling tight and he has trouble getting his breath. I’m a nurse and have older children, I’ve never seen this blotchy pattern before so I’m perplexed. He is happy and healthy otherwise. I spoke to his doctor about this and he ordered blood work {CBC and thyroid function} which was normal. I’m wondering if he could be developing exercise induced asthma?","like_count":"0","tags":["Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/109066/asthma-or-something-else"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"multiple asthma attacks a day","post_content":"so ive had excercise induced asthma for as long as i can remember. i have an inhaler and usually it works great. but the last couple weeks ive been having asthma attacks without moving at all, and i have them multiple times a day. i noticed i have one as soon as i wake up in the morning, as well as when im sleeping. i thought it was because i had a cold but i dont have a cold anymore and its getting really bad. at one point i had an attack that lasted 3 hours. my inhaler no longer works.","like_count":"0","tags":["Triggers"]},"responses":[{"author":"cannabeme","resp_time":"2 months ago","resp_title":"RE: multiple asthma attacks a day","resp_content":"https://homegrowncannabisco.com/cbd-white-widow-feminized can help asthma, but the problem is that the dose has to be very mild and slow, like not some concentrate. However, people, though they start this way, soon move on to dabbing lots of grams of marijuana. So if you can control your will, and stick to a minimal dose just once a week or a fortnight, it can definitely help you with your asthma problem.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/59160/multiple-asthma-attacks-a-day"},{"post":{"author":"Anonymous","post_time":"2 months ago","post_title":"Cant afford your medications?","post_content":"ScriptCo Pharmacy is Americas first and only membership-based wholesale pharmacy, based out of Texas. After becoming a member (membership is $120 per year) you can purchase your generic medications for the exact same cost ScriptCo Pharmacy buys them for. They even have a quote tool on their website so you can see what to expect to pay for your medications before becoming a member. They are mailed right to your door. Some meds are less than a penny. Go to www.scriptco.com to see how much you can save. They currently ship meds to patients in: Texas, Idaho, Massachusetts, Nebraska, but more states will follow in the future.\nHere is a local news story on the pharmacy: https://www.kwtx.com/content/news/New-locally-based-online-pharmacy-aims-to-save-consumers-money-564008831.html","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/107578/cant-afford-your-medications"},{"post":{"author":"Anonymous","post_time":"4 months ago","post_title":"Nebulizers","post_content":"I have e-asthma. My body creates too many eosinophils which loads my lungs with mucus. I average one five to six day hospitalization per year. I highly recommend Nebulizers. They get the meds deeper in the lungs which can increase their effectiveness.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/103855/nebulizers"},{"post":{"author":"mommy2four2019","post_time":"4 months ago","post_title":"Asthma?","post_content":"So i have been having some symptoms for the past 3 months and I am going to the doctor, but i wanted to see what others think. Here are my symptoms. I have loud cough mostly at night time but in the day too. Wheezing especially at night. I get super tired after cleaning my house or something where i Have to exert myself. I have chest tightness and its just not going away and over the counter cough medicines do not work at all. Also i had blood done thru my psychiatrist and my Absolute Eosinophils are super high and i read that can be a sign of asthma. Thanks for any and all responses. Also what be the treatment with these symptoms. Thanks!!!","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/103109/asthma"},{"post":{"author":"benyhalf","post_time":"5 months ago","post_title":"Asthma, Exercise and Streroids","post_content":"My asthma comes and goes , recently when i started water aerobics I began to have problems and the inhaler is a steriod/albuterol...so feel uncertain continuing to exercise and feel that the asthma meds/steriods is affecting my weight loss?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/100865/asthma-exercise-and-streroids"},{"post":{"author":"thequietone2","post_time":"over 1 year ago","post_title":"Recently Diagnosed","post_content":"I've recently been diagnosed with asthma. I noticed last year that after I had bronchitis, it became harder and harder to get air in and I had this persistent cough that wouldn't go away. I initially just thought I had bad allergies but once I took a PFT last week, I was told that I had the lungs of a 47 year old. I was shocked! I am now on an inhaler that I have to use everyday as well as nebulizer. I have my rescue inhaler just in case I need it as well. I'm trying my best to wrap my head around all of this, but it's hard. It sucks when you can't breathe.","like_count":"1","tags":["Diagnosis"]},"responses":[{"author":"jeffbo","resp_time":"over 1 year ago","resp_title":"RE: Recently Diagnosed","resp_content":"You might want to check out these two articles full of case studies>>\n\nhttps://jefftbowles.com/longer-term-high-dose-vitamin-d3-therapy-cures-asthma/\n\nhttps://jefftbowles.com/copd-is-incurable-dont-tell-that-to-high-dose-vitamin-d3/\n"},{"author":"thequietone2","resp_time":"over 1 year ago","resp_title":"jeffbo: Thank you for this response. I currently do take vitamin D2 because I am vitamin D deficient and I have fibromyalgia, but maybe at my next appt with my Rheumatologist I will mention to increase my dosage to vitamin D3 going forward. Thank you again for the response.","resp_content":"Reply\njeffbo\nover 1 year ago\nHI there..yes if a dr is prfescribing you Vitamin D2 they are WAY behind the times..that is the plant derived fgorm of vitamin d you can get it from shining sunlamps on mushrooms . It is 1/4th as strong as vitamin d3 and may have odd side effects....Id say look for anothjer doctor or do some research on your own..D2 will be off the market in a few years I predict.\n"},{"author":"habitcough","resp_time":"5 months ago","resp_title":"RE: Recently Diagnosed","resp_content":"I made this website for chronic cough www.HabitCough.com and this video after my daughter was cured https://youtu.be/31gUKy9UKNo by Dr. Miles Weingerger, MD Good luck. Dennis\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/54452/recently-diagnosed"},{"post":{"author":"balancing123","post_time":"over 2 years ago","post_title":"Cough that does not go away - could it be candida????","post_content":"I have an issue with a cough and runny sinus drainage all day ... on and off. It started in 1994. I was on this board starting around 2000 for many years. I was really bad with severe coughing .. non stop for 24-36 hours at a time.\nAnd I was told I was a medical challenge. I went to National Jewish Hospital in Denver in 2003 and they did not really have any answers. I was and have been recently tested for asthma, but I do not have asthma. And I found doctors who would work with me and we would bounce things off of each other till we found some answers. So here I am today with a left over cough .. occasionally through the day. No attacks, etc. I am trying to figure things out again to get this last bit of cough gone. My question is this ... has any one dealt with candida???? At one point years ago, I was severely allergic to candida (in fact all molds). But recent testing shows no allergy. If you have dealt with an issue of candida, please let me know your story. Thanks","like_count":"0","tags":[]},"responses":[{"author":"felinefrenz","resp_time":"over 2 years ago","resp_title":"RE: Cough that does not go away - could it be candida????","resp_content":"I have had coughing spasms with phlegm for eight months following bronchitis. Nothing seems to help.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Cough that does not go away - could it be candida????","resp_content":"I had a cough for months. I went through all kinds of tests only to find out that it was gastric reflux! Best of luck to you\n"},{"author":"habitcough","resp_time":"5 months ago","resp_title":"RE: Cough that does not go away - could it be candida????","resp_content":"Check out www.HabitCough.com/stories and this video of my daughter who had chronic cough and was cured. https://youtu.be/31gUKy9UKNo\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/38546/cough-that-does-not-go-away---could-it-be-candida"},{"post":{"author":"fbemployee","post_time":"over 2 years ago","post_title":"19 year old-chronic cough","post_content":"My 19 year old daughter has been experiencing a chronic cough since August. She coughs so hard she throws up. She also has shortness of breath and has gained weight.\nOf course we have been to the doctor but her condition is not improving.\nAny suggestions would be appreciated.","like_count":"1","tags":[]},"responses":[{"author":"miladazodi64","resp_time":"over 2 years ago","resp_title":"RE: 19 year old-chronic cough","resp_content":"Maybe that is TB.\n"},{"author":"Danni22283","resp_time":"over 2 years ago","resp_title":"RE: 19 year old-chronic cough","resp_content":"Maybe asthma?\n"},{"author":"mariajasminefreeman","resp_time":"over 2 years ago","resp_title":"RE: 19 year old-chronic cough","resp_content":"First off a CXR( chest X-ray) is indicated to rule out an infection, or other lesions, though weight gain does not suggest that. What was her doctor’s diagnosis, does he believe there is asthma, or sinus infection( any radiologic study done)? If not so, presence of vomiting after cough may occur in pertussis which could present mildly after many years of initial vaccination without a booster dose, but it should have abated markedly after 3 months already.\nOn the other hand, if her cough occurs mostly while lying down, reflux is possible which could have been promoted by an acute weight gain.\nDr Hana Fayyad\nMaria Jasmine Freeman\n"},{"author":"habitcough","resp_time":"5 months ago","resp_title":"RE: 19 year old-chronic cough","resp_content":"I made www.HabitCough.com for chronic cough and this video https://youtu.be/31gUKy9UKNo The website is for Dr. Miles Weinberger, MD Pediatric Pulmonologist's peer reviewed papers.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/33327/19-year-old-chronic-cough"},{"post":{"author":"careers4u100","post_time":"over 1 year ago","post_title":"Chronic Day Time Cough ONLY","post_content":"My son is 11 years old .Since three months he is coughing persistently ONLY in day time and during night while sleeping he doesnot cough . I took him to the regular doctor ( Pulmonologist) who treated my son for allergy and childhood asthma since 2009.The doctor took an X Ray of Chest PA view .He said the X Ray was clear .As usual prescribed Methyl Prednisolone for 5 days , Budecort and Levolin Rotocaps and Montekulast .The cough didnt go and after a week ,revisited the doctor . He gave a dose of Azithromycin for 5 days . Even later to it it didnot go . .Currently my son is consuming Budecort , Levolin and Montekulast and the cough doesnot go .OTC medicines diphenhydramine,Codeine (10 mg) + Chlorpheniramine (4 mg) didnot work either . There is no cough while he sleeps . Any advise please ?","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Chronic Day Time Cough ONLY","resp_content":"It's been six months. I just came here today. How is he doing now?\n"},{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Chronic Day Time Cough ONLY","resp_content":"What bout Contacting someone who will prepare you HERBS that will make all the pains go away?. Cos I have that for over 3year till I contacted dr.shebijr@gmail.com and I am totally free...\nPromise your son will be fine...\n"},{"author":"rosiecont","resp_time":"5 months ago","resp_title":"RE: Chronic Day Time Cough ONLY","resp_content":"If it is a chronic cough, usually pay attention to drink plenty of water. Because cough consumes a lot of body fluids, it is necessary to replenish water in time. Do not drink cold water. Hot water can relax your throat and relieve the symptoms of coughing.\n"},{"author":"habitcough","resp_time":"5 months ago","resp_title":"RE: Chronic Day Time Cough ONLY","resp_content":"I made this video for my daughter's chronic cough. https://youtu.be/31gUKy9UKNo She did not cough in her sleep and that was an important part for the diagnosis.\n"},{"author":"habitcough","resp_time":"5 months ago","resp_title":"RE: Chronic Day Time Cough ONLY","resp_content":"I made www.HabitCough.com for children and adults with chronic cough for info from Dr. Miles Weinberger, MD, Pediatric Pulmonologist.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/85719/chronic-day-time-cough-only"},{"post":{"author":"ZDubs","post_time":"over 2 years ago","post_title":"Nebulizer","post_content":"Hi.\n\n\n\nI had a sever asthma attack the other night after smudging my apartment. But I've never had this happen before. So i only got the prednisone and inhaler.\n\nI'm curious how important a nebulizer is to have?","like_count":"0","tags":[]},"responses":[{"author":"kobemamba24","resp_time":"over 1 year ago","resp_title":"RE: Nebulizer","resp_content":"If you ever had the same the problem before you better have one with you!\n"},{"author":"francband","resp_time":"6 months ago","resp_title":"RE: Nebulizer","resp_content":"I think it's important to have one nebulizer\n"},{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Nebulizer","resp_content":"What bout Contacting someone who will prepare you HERBS that will make all that go away?. Cos I have that for over 3year till I contacted dr.shebijr@gmail.com and I am totally free...\n"},{"author":"francband","resp_time":"5 months ago","resp_title":"RE: Nebulizer","resp_content":"In order to make sure that, for example, the particular nebulizer is the best, considering if you buy for children, I think it's worth reading a useful article from pickadvisor, the best nebulizer for kids https://pickadvisor.org/best-nebulizer-for-kids/ . My wife and I found this site when choosing this device. I see that the authors of this article learned a lot about this therapeutic device to help you choose the most suitable one. Here you can find out what to look for when buying a nebulizer. In my opinion, the information is also aimed at ensuring that you do not overpay, the writer understands that medicine should be affordable.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/45605/nebulizer"},{"post":{"author":"prasad49","post_time":"8 months ago","post_title":"Pain","post_content":"I am a cardiac patient for the last several years. I have undergone PTCA CABG Pace maker renal denervation etc. Recently I fell unconscious and broken shoulder bone.\nOrthopaedic opinion is surgery. Cardiologists are not permitting. I am having severe pain.\nAny suggestion","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Pain","resp_content":"Wrong message board. Sorry.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/95514/pain"},{"post":{"author":"missclouseau","post_time":"over 1 year ago","post_title":"Another 'do I have asthma?' - spirometry result is bad, have allergies, but no wheezing or coughing","post_content":"33 y/o female ex smoker. I took the spirometry test for four times and all showed I have breathing issues. I also have dust mite allergy and get nasal congestion/stuffy nose pretty frequently. I took a blood test too, I'm not anemic. My chest x-ray and heart test were fine. I never cough, have no wheezing. But I do have shortness of breath though that gets worse sometimes. Chest tightness as well. It doesn't get worse because I move around.\n\nMy doctor is confused too. She says her 'guess' is I don't have (allergic) asthma but that she can't be sure with my allergy and spirometry result. I don't know what to do at this point. I don't want to use an inhaler if I don't need to and without the right diagnosis, I won't get the right treatment. I will go back there a month later. Do you think I have asthma? Should I ask for another test I didn't take yet? See a ENT?","like_count":"0","tags":["Diagnosis","Tests"]},"responses":[{"author":"krkoontz","resp_time":"over 1 year ago","resp_title":"RE: Another 'do I have asthma?' - spirometry result is bad, have allergies, but no wheezing or coughing","resp_content":"I think you should definitely go to either a pulmonologist, ENT, or allergist. I had a bad cough for sometime and nothing seemed to help. I finally went to an allergist, did a spirometry test, and it was discovered that I wasn’t getting enough air through my small airway. My asthma was brought on by GERD. My only allergy is to maple trees Good luck! Let us know how you make out.\n1\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Another 'do I have asthma?' - spirometry result is bad, have allergies, but no wheezing or coughing","resp_content":"Do you cough at night or are you awakened by your child’s wheezing and coughing during night time? If the answer to all these questions is yes to any of those above, you have come to the right place. Uncontrolled asthma makes it quite difficult for a child and family members to have a sound sleep. There are many causes of asthma cough at night that are discussed below:\n\nSinuses draining\nHormonal changes\nAllergies\nBronchitis\nIncreased airway resistance due to airways narrowing during your sleep\n\nWhat to do when asthma stops you from sleeping?\n\nFirstly, sit up straight and take your inhaler, as prescribed. It’s always best to keep your inhaler next to your bed so that you don’t have to search it in the middle of the night when you have a problem.\nSome people find propping themselves up with extra pillows helps as it allows your lungs to open up more fully when you breathe.\nTry to adjust the temperature of the room as per your comfort if in any case your asthma is made worse when the air in a room is too hot or too cold.\nA glass of water or a cup of herbal tea, such as peppermint or chamomile, can help ease a dry throat.\n"},{"author":"wellnessgma","resp_time":"over 1 year ago","resp_title":"RE: Another 'do I have asthma?' - spirometry result is bad, have allergies, but no wheezing or coughing","resp_content":"Have you ever tried any supplements? My daughter and granddaughter are getting relief and healing with a natural herbal supplement that purifies your blood and increases your oxygen levels.\n"},{"author":"Jodybear1115","resp_time":"7 months ago","resp_title":"which supplement is that","resp_content":""},{"author":"rosiecont","resp_time":"6 months ago","resp_title":"RE: Another 'do I have asthma?' - spirometry result is bad, have allergies, but no wheezing or coughing","resp_content":"Yes, you may not have asthma. However, shortness of breath may be related to a serious illness, which is a result of poor physical condition. I suggest that you change your lifestyle to treat shortness of breath.\n"},{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Another 'do I have asthma?' - spirometry result is bad, have allergies, but no wheezing or coughing","resp_content":"I can give you a second opinion regarding your spirometry results if you post the key numbers: FEV1 / FVC and FEV1 percent predicted (both pre and post BD if available).\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/70814/another-do-i-have-asthma---spirometry-result-is-bad-have-allergies-but-no-wheezing-or-coughing"},{"post":{"author":"richardmorgan","post_time":"over 1 year ago","post_title":"Does cold air help someone with asthma?","post_content":"Knew a girl that would put her head in the freezer if she didn't have her inhaler. Does this really help?","like_count":"1","tags":["Diagnosis"]},"responses":[{"author":"melbrandle","resp_time":"10 months ago","resp_title":"RE: Does cold air help someone with asthma?","resp_content":"I personally have heard that humidity is better rather than the cold. I reckon that if you've lived up in the mountains it expands your lungs because the air is thinner up there, but not when you're trying to shock your body out of a sickness!\n"},{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Does cold air help someone with asthma?","resp_content":"Inhaling cold air, which is dry air, temporarily causes bronchospasm. That is the mechanism for exercise induced asthma.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/88181/does-cold-air-help-someone-with-asthma"},{"post":{"author":"carmeloj","post_time":"7 months ago","post_title":"Seeking a Generic","post_content":"Is there a generic medication approved by the FDA which is equivalent to Anoro Ellipta?","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Seeking a Generic","resp_content":"Yes. The FDA approved a generic combination ICS + LABA inhaler in February this year.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/96505/seeking-a-generic"},{"post":{"author":"dustbuny","post_time":"6 months ago","post_title":"Will my emphysema progress faster if I stop my BREO Elliptica?","post_content":"I have emphysema, stage 2. At this point my disease is not much of an inconvenience, even without my BREO Elliptica. Admittedly, I do breathe somewhat better taking the BREO. However, I am concerned about its negative effect on my immunity to diseases. Also, I have a chronically stuffy nose. I want to stop using the BREO Elliptica UNLESS NOT USING IT will cause my condition to progress more quickly. What should I do?","like_count":"0","tags":[]},"responses":[{"author":"rosiecont","resp_time":"6 months ago","resp_title":"RE: Will my emphysema progress faster if I stop my BREO Elliptica?","resp_content":"If you have emphysema, stage 2, you can also try bronchodilator drugs, which are effective in relieving the symptoms of emphysema, bronchodilator drugs can usually be taken orally or Inhaled as aerosol sprays.\n"},{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Will my emphysema progress faster if I stop my BREO Elliptica?","resp_content":"If you have COPD, the only treatment which will slow it's progression is smoking cessation. No medications will do so. Did you have a pre and post Albuterol spirometry test? If so, and you showed improvement after the Albuterol, perhaps asthma is more likely than COPD. The symptoms of asthma usually improve within a few weeks of using one of the combination inhalers once or twice per day.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/98384/will-my-emphysema-progress-faster-if-i-stop-my-breo-elliptica"},{"post":{"author":"ncpf13","post_time":"11 months ago","post_title":"Restrictive Airway or prelude to Asthma?","post_content":"About two years ago I had a severe chest cold, complete with chills and fever, that lasted about 2 weeks. Ever since then my throat feels as though there is something pressing against the front of it. It often causes me to cough and makes it difficult to catch my breath. I'm usually okay, but taking a deep breath sometimes will trigger the pressure sensation and then the coughing begins. Does anyone else have these symptoms? Have you received a valid diagnosis? What are your treatments?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/89099/restrictive-airway-or-prelude-to-asthma"},{"post":{"author":"shawncallaway","post_time":"over 1 year ago","post_title":"What Should I do","post_content":"Hi All,\n\nRecently I called residential pest control to my house while I was on vacation with my family. We came two days after the pest control left. After reaching home I started to have suffocation while breathing. I don't know why its the first time I am having the problem. Is it the symptoms of Asthma?","like_count":"0","tags":["Triggers","Treatment"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: What Should I do","resp_content":"Consult a doctor\n"},{"author":"anthonycaesar","resp_time":"over 1 year ago","resp_title":"RE: What Should I do","resp_content":"You should definitely try to consult the doctor. In my opinion, the pest control service you hired might have used the chemicals in their spray rather than going with the organic products. This can be the reason for the suffocation you are facing. Moreover, it is always recommended that whenever you do a pest control spraying, make sure that you are hiring a licensed team like http://www.yalepest.com/monroe-pest-exterminators/ who offers organic pest spraying which is actually beneficial for both human and environment too.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/68794/what-should-i-do"},{"post":{"author":"hirschs","post_time":"over 1 year ago","post_title":"Shingles Vacine after Prednisone","post_content":"Hello: My pulmonologist has put me on a small treatment of Prednisone (3-10mg tablets, per day for 4-days). How long after this treatment do I need to wait before I have my second Shingles vaccine? It has now been 2 and 1 half months since my first Shingles vaccine.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/87442/shingles-vacine-after-prednisone"},{"post":{"author":"tealee54","post_time":"over 1 year ago","post_title":"Grand daughter woke up in the night.having problems breathing!","post_content":"My 11 year old grand daughter woke up with heavy chest.strugling to breath.she didn't have a fever wasn't coughing.but was crying saying she couldn't breath.could she have astma.it runs in our family?","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Grand daughter woke up in the night.having problems breathing!","resp_content":"Eosinophilic asthma is a rare type of asthma. It’s often severe and usually comes on in adults. The main treatment for asthma -- drugs called inhaled corticosteroids -- don’t have much of an effect on it, even in high doses. That means it's harder to manage and you’re more likely to have asthma attacks.\n\nWhen you have eosinophilic asthma, you have a larger than the normal number of eosinophils -- or white blood cells that fight diseases -- in your blood, lung tissue, and the mucus you cough up from your respiratory tract. The goal of treatment is to improve and control your asthma symptoms.\n\nThere are three main tests used to measure your level of eosinophils. Here’s what you need to know about each.\n\nBlood eosinophil count\n\nA blood test is commonly used to measure levels of eosinophils in your blood. It’s a simple blood draw, similar to a cholesterol or blood sugar screening. Though, you don’t need to fast before this blood test.\n\nSputum Eosinophil Count Test: This test is to measure eosinophils in your sputum, a mixture of coughed mucus and saliva. The practicality of the test is bit deniable as few people have trouble generating a sample however the accuracy of this test is unquestionable.\n\nBronchial biopsy\n\nThis test is more invasive than the others and less likely to be used for your initial diagnosis.\n\nHow it works: While you are mildly sedated, a scope is inserted through your nose or mouth to collect tissue from your airways, which is then tested for eosinophils. If eosinophils are detected even though you've been treating your asthma with steroids, you may be diagnosed with eosinophilic asthma.\n\nHow you can treat Eosinophilic Asthma?\n\nDepending on the condition your doctor may recommend certain type of drugs to manage the condition and help you breathe easily. The most common Eosinophilic Asthma treatment includes:\n\nCorticosteroids\nThese are maintenance drugs, which means they help you maintain normal breathing and prevent asthma symptoms from taking control. Their job is to keep certain cells in the lungs and airways from releasing chemicals that cause asthma attacks to act up.\n\nLeukotriene modifiers\nSome of the chemicals in your immune system that cause asthma symptoms are called leukotrienes. Eosinophils love to team up with leukotrienes and cause inflammation in your upper and lower airways.\n\nMedicines called leukotriene modifiers -- such as montelukast (Singulair), zafirlukast (Accolate), and zileuton (Zyflo) -- relieve the effects of leukotrienes and ease asthma symptoms. It’s rare, but some people get agitated and anxious when taking these meds. If this happens to you, tell your doctor.\nBiologic therapies\nThese therapies are provided to the patient to block the chemicals in the body that is responsible for the inflammation and swelling. These are provided by intravenous drip or injection.\n\n\nThanks,\nNav\n"},{"author":"eczemaliving","resp_time":"over 1 year ago","resp_title":"RE: Grand daughter woke up in the night.having problems breathing!","resp_content":"Do you cough at night or are you awakened by your child’s wheezing and coughing during night time? If the answer to all these questions is yes to any of those above, you have come to the right place. Uncontrolled asthma makes it quite difficult for a child and family members to have a sound sleep. There are many causes of asthma cough at night that are discussed below:\n\nSinuses draining\nHormonal changes\nAllergies\nBronchitis\nIncreased airway resistance due to airways narrowing during your sleep\n\nWhat to do when asthma stops you from sleeping?\n\nFirstly, sit up straight and take your inhaler, as prescribed. It’s always best to keep your inhaler next to your bed so that you don’t have to search it in the middle of the night when you have a problem.\nSome people find propping themselves up with extra pillows helps as it allows your lungs to open up more fully when you breathe.\nTry to adjust the temperature of the room as per your comfort if in any case your asthma is made worse when the air in a room is too hot or too cold.\nA glass of water or a cup of herbal tea, such as peppermint or chamomile, can help ease a dry throat.\n\n\nhttp://eczemaliving.com/asthma-cough-at-night/\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/78296/grand-daughter-woke-up-in-the-night-having-problems-breathing"},{"post":{"author":"dogandcatlover1912","post_time":"over 1 year ago","post_title":"Do I have asthma?","post_content":"I am a 13 yr old female who has trouble breathing in or anywhere around smoke, humid air, dust, and pollen. My allergist (I have severe allergies to dust and pollen) says it's just allergies. I went to a sweat lodge (basically a tent filled with humid air) and I couldn't breathe. It felt like someone as closing my throat and sitting on my chest. My friend had to help me out because I felt like passing out. Is this asthma? Also I have had bronchitis before and took ProAir and it felt much better. Thanks for any help.","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis"]},"responses":[{"author":"dogandcatlover1912","resp_time":"over 1 year ago","resp_title":"RE: Do I have asthma?","resp_content":"I had the same thing happen to me sweat lodge and everything. I'm a 12 yr old girl and my allergist says it's just allergies too. My advice is to ask your pediatrician about having a bronchitis inhaler(pro air) which is also used for asthma. That really helped me. Also try getting a new allergist. New people often have different opinions on asthma. Ask to get your skin and blood allergy tests retaken along with breathing strength tests.\n"},{"author":"Itisfinished","resp_time":"over 1 year ago","resp_title":"RE: Do I have asthma?","resp_content":"Hi, I have asthma and copd. I can't be around smoke or anything that triggers my condition. I am not sure about allergies because I don't know of any I may have. With asthma your literally cannot breath and need a rescue inhaler to use under those conditions. If you don't have an inhaler you more than likely do not have asthma. I am not a doctor. Be sure to let you doctor know of your attacks and have your doctor take test to determine what you may be suffering with. Feel better.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/59707/do-i-have-asthma"},{"post":{"author":"smh2019","post_time":"over 1 year ago","post_title":"Why Now?","post_content":"I'm 57 years old. I had asthmas issues as a small child but most of my adult life I was not bothered unless I was sick. I smoked for 40 years. I quit May of 2017 and my asthma has done nothing but get worse. I was aware thing would get worse before they got better but it is almost 2 years now. I work in an environment that has latex\nballoons regularly inflated. Could my lungs recovering from smoking now be sensitive to the latex in the air? Is there any way for me to figure this out? I've had the same job 18 years and it was a within the first years after I started working that my asthma started becoming more active. I never thought there could be a connection. I just figured it was my age. Any ideas. I don't want to give up my job but I may need to see if I have options.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/84128/why-now"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Problems breathing","post_content":"i've never been diagnosed with asthma or breathing issues. but i do have difficulties breathing and catching my breath sometimes and some coughing. sometimes i can't catch my breath because the stairs feel like i was climbing a mountain. sometimes it feels like someone is sitting on my chest and that i can't fully breathe. i was an cigarette smoker for years but i quit over a year ago. asthma and COPD also runs in my family. i have a doctors appointment in a few weeks. i've had breathing issues for awhile been never had it checked. i don't want my doctor to tell me there's nothing wrong and do nothing for me, when i am having issues. i would like to know what questions i should ask them and what they could possibly do for me to ensure that i get proper help with this. thank you.","like_count":"0","tags":["Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/83570/problems-breathing"},{"post":{"author":"kjkam1946","post_time":"over 1 year ago","post_title":"Trouble with breathing while running in cold temperatures","post_content":"A few years ago without warning I started having issues with breathing while running outside in cold weather (usually 40 degrees f. or colder). I had been running 2 -3 times a week, 2 - 5 miles each time for about 4 years when this started. I used to get all the normal symptoms when running in cold weather but now, in addition, it's much more difficult to breathe and I get a pain on both sides of my neck starting near my collar running up to my ears. Once I notice the pain, no matter how soon I stop running I will also get a headache that will last up to 20 or 30 minutes after I've stopped running. Has anyone else experienced this or know what it is? I've explained this to past medical personnel, had cardio tests done but all I'm told is that it might be environmentally induced asthma. I'm wondering if there's anything I can do so that I can get back to running when it's cold outside.","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[{"author":"elc33","resp_time":"over 1 year ago","resp_title":"RE: Trouble with breathing while running in cold temperatures","resp_content":"This happens to me too. I have asthma and it always gets worse during the cold weather. I just use my inhaler before I run every time and it helps some. But I don't know how to fully avoid it yet either.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/81181/trouble-with-breathing-while-running-in-cold-temperatures"},{"post":{"author":"ajbj03","post_time":"over 1 year ago","post_title":"Asthma","post_content":"My name is eve , I have severe eosinophilic asthma and had my first shot of fasenra 1/16/2019 . I then went home and on Thursday was diagnosed with the flu a . Is the shot effective or did it not work because of the flu .","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/82031/asthma"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"grateful","post_content":"i was diagnosed with HIV/AIDS for over 6 years which made loose my job and my relationship with my fiance after he discovered that i was having HIV, he departed from me i tried all my best to make him stays with me, but neglected me until a friend of mine on Facebook from spain told me Great healer, who will restore my life back with his powerful healing spell, he sent me the email address to contact and i quickly contacted him, and he said my condition can be solved, that he will treat the disease immediately only if i can accept trust him and accept his terms and condition, i Agreed because i was so much in need of help by all means, so i did all he want from me and surprisingly on Sunday last week He sent me a text, that i should hurry up to the hospital for a checkup, which i truly did, i confirm from my doctor that i am now ( HIV NEGATIVE) my eyes filled with tears and joy, crying heavily because truly the disease deprived me of many things from my life, This is a Miracle, Please do not en-devour to email dr.usmanspellcaster@gmail.com or whatsapp Dr usman on +2348064080208 for healings Thanks","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/79056/grateful"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"I don't know what to say","post_content":"Not ready","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/77929/i-don-t-know-what-to-say"},{"post":{"author":"kevinjohnson","post_time":"over 1 year ago","post_title":"How long to restore normal breathing after prolonged CPAP machine","post_content":"My husband snores every night but I got used to it. It started before he became obese and had asthma. But now he finds it difficult to breathe at night. The snores stop all of a sudden and he will be gasping for breath. This happened for some time. We visited the doctor and he recommended to reduce the weight and obesity. Till then doctor suggested a CPAP machine to use for the while. Now its almost one year and he has reduced his weight significantly. He has been using the CPAP machine for almost a year for every day. https://www.cpapoutlet.ca/Home He never felt any problem in breathing since he started using the machine. Now is it time to stop using the machine? The doctor suggested to take time and resolve it slowly. I think its time he should start breathing without CPAP. Another thing to notice was since the usage of a machine he hasn't snored or had asthma at night. Will he start snoring again?","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/70550/how-long-to-restore-normal-breathing-after-prolonged-cpap-machine"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Trouble with Breathing","post_content":"i'm a 20 year old female who was a smoker for 5+ years, but now i am almost 1 year cigarette free. i've noticed that i've always had a shortness of breath and hard time breathing. it also sometimes feels like someone is sitting on my chest not allowing me to breathe. i figured because i quit smoking this stuff would improve over the course of a year but it hasn't. my grandmother (ex-smoker) and mother (never a smoker) both have been diagnosed with COPD and asthma. i plan on making a doctor's appointment to get myself checked out. what are your opinions? what questions should i ask my doctor? please and thank you.","like_count":"0","tags":["Treatment","Diagnosis","Tests"]},"responses":[{"author":"jjbunk76","resp_time":"over 1 year ago","resp_title":"RE: Trouble with Breathing","resp_content":"I would see a doctor and see what he or she says.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/62226/trouble-with-breathing"},{"post":{"author":"zerocokegirl","post_time":"over 1 year ago","post_title":"Do I have Asthma","post_content":"For the last year I have been really struggling. I’m a 50 year old woman going through the menopause and having weird symptoms such as having feelings of something crawling underneath my skin as well as the usual flushes. I’m taking an antihistamine which helps with the itching and Maca capsules which are a godsend for the sweats.\nAnyway I have noticed when I exercise and exert myself just slightly I become short of breath, coughing and wheezing... I mentioned it to my doctor who prescribed me an inhaler. I tried to shrug it off and convince myself this is all to do with my reflux as yes i have that too so never used the inhaler. Today after my bicycle ride I had all the symptoms so i decided to give the inhaler a go.. took two puffs and have to be honest did instantly feel a bit better. I also noticed after eating too I get short of breath and cough a bit so I’m really confused\nDoes this mean I have asthma or is this reflux and after any exercise I’m struggling so should I continue with the inhaler?\nAny advice would be so gratefully appreciated.\nThank You","like_count":"0","tags":[]},"responses":[{"author":"mustafanabil","resp_time":"over 1 year ago","resp_title":"RE: Do I have Asthma","resp_content":"Usually Asthma is a chronic situation develops in early years of life .\nWhat is the inhaler active substance ( steroid or beta agonist ) ?\nThe Sx you have, did you feel it before taking the antihistamine drug ?\nHow much time do you exercise ? and are you an active person from time age or just started to exercise?\n"},{"author":"zerocokegirl","resp_time":"over 1 year ago","resp_title":"Hi","resp_content":"Thank You for your reply.\nI am currently taking Fexofenadine 180mg for the itching. I tend to find I am short of breath after eating and then start to cough. I’m not sure if food can trigger asthma?but i also have read that going through the menopause can affect you and bring on asthma?\nI am taking a Preventor twice daily Clenil Modulite and a Reliever Salbutamol 100mcg when required.\nAs for exercise I’m active all day and do cycling a few times a week but as soon as I’m slightly out of breath i start to cough and wheeze.\nSo basically after eating I’m coughing and short of breath and after any exercise I’m coughing and short of breath!\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Do I have Asthma","resp_content":"I don't think about any asthma\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/68472/do-i-have-asthma"},{"post":{"author":"shawncallaway","post_time":"over 1 year ago","post_title":"Does poor air quality can be a problem ?","post_content":"Hi All,\n\nMy mom was diagnosed with cataract last week. As Doctor suggested me to go ahead with operation at the earliest, so I told mom to go and get yourself admitted to the hospital. The doctor quickly completed the operation and told her to stay at the hospital for a couple of days so he can examine the progress and her health. At that time, I visited her a couple of times, all the time she uses to complain me about an odour with she is irritated. in the first case didn't mind it but she again complains about it. I asked the nurse about so she said there is some smell but we have informed it. The later nurse let me know that it was because of an HVAC repair-\nhttps://sierraair.ca/commercial/service/ . in the building cause the smell. It was due to happen a week earlier which delayed due to some technical issue. She said its all fixed and they won't be any problem from now. I was wondering in hospitals where a patient with various problems are admitted they should be some concern about the air quality and standard that have to be maintained? How can we assure it? Will poor air quality effect asthma patient and other patients with respiratory problems?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/68824/does-poor-air-quality-can-be-a-problem"},{"post":{"author":"belly22","post_time":"over 1 year ago","post_title":"asthma and panic attack triggers","post_content":"do nhs really know what causes asthma to flare up in public because I don't think they day for example if people had a stroke or eppilpsy and seen something not nice like a police chase in public it could flare up a panic attack and spark a brian chain reaction setting off asthma and epplipsy at the same time\n\niam a social worker at level three and going to university at a older age next year to do my health and social carem ba honure degree at derby university mr martyn bell heanor Derbyshire also doing head practioners course","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/68110/asthma-and-panic-attack-triggers"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Could it be lung or heart problem?","post_content":"It was started three years ago, i think it will be fine but two years ago i feel something strange in my lungs. The syntoms of shortness of breathing is just mild i experienced it twice a month. Also in my heart it hurts sometimes, but lately it's hard for me to breath and also my heart sometimes squezing and also my chest. I have agoraphobia,cherophobia,pistanthrophobia,thallasophobia,heliophobia,traumatophobia,and i dont what is the reason maybe my phobia sometimes triggered also but this month i have a problem of breathing and maybe my heart also, can someone tells me what it is so i can go directly to a doctor bec. If i dont what it is then i cant go to a specialist...","like_count":"0","tags":["Living & Managing"]},"responses":[{"author":"nobleness","resp_time":"over 1 year ago","resp_title":"RE: Could it be lung or heart problem?","resp_content":"Could be bronkitis or a heart problem, however visit a doctor\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/62712/could-it-be-lung-or-heart-problem"},{"post":{"author":"mpsmom96","post_time":"over 1 year ago","post_title":"it's hard to take a deep breath","post_content":"Is it possible to have lung issues without having a low pulse ox? I have a hard time taking a real deep breath and can't hold my breath now for more than about 30-45 seconds. My pulse ox was normal at my last dr visit. 53 yo female. Thanks.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/67159/it-s-hard-to-take-a-deep-breath"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Oh asthma...","post_content":"I am 21 years old and asthma is controlling my everyday life. It’s a constant struggle. I go through TWO ventolin inhalers in about 3 weeks or less. 200 PUMPS EACH. I’m allergic to so much outside and inside it’s just killing me.","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Oh asthma...","resp_content":"I feel you on this one! I have a constant struggle everyday\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/63985/oh-asthma"},{"post":{"author":"nieceyrene","post_time":"over 1 year ago","post_title":"Can a chronic cough when I laugh be Asthma?","post_content":"I get on a deep coughing cycle for a few minutes whenever I’ve laughed. Sometimes I cough periodically, but this is when it’s the worse! I have an inhaler. It helps.\nI also think it’s seasonal allergies making me cough? Anyone have this before?","like_count":"0","tags":["Living & Managing","Triggers","Diagnosis"]},"responses":[{"author":"mariajasminefreeman","resp_time":"over 1 year ago","resp_title":"RE: Can a chronic cough when I laugh be Asthma?","resp_content":"The act of laughing may result in acute bronchoconstriction, causing cough. This is what is known as hyper reactive airways. Often repetitive deep breathing triggers it as well. The fact that it responds to an inhaler makes this possibility highly likely. On the other hand, menopausal women can have this phenomenon due to loss of estrogen regulatory effect on breathing, and so do also other endocrine disorders.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/60201/can-a-chronic-cough-when-i-laugh-be-asthma"},{"post":{"author":"marcodelgallego","post_time":"over 2 years ago","post_title":"Abdominal pain running with asthma","post_content":"Current asthma meds:\n*twice every 12 hours:\nsalmeterol 25 mcg + fluticasonoa propionato 250 mcg\n*before exercise:\nsalbutamol 200 mcg\n\nBipolar meds:\n*before bed:\nQuetiapine 200 mg\n*every 12 hours:\nLamotrigine 150 mg\n\nBio:\nI've had asthma since age 12. I'm 26 now. It's been a huge pain in many ways. I've been jogging and running for a long time, I even do 10k and 15k races. I've been doing treatment for years. I don't think it has ever helped my performance, it just makes the whistling go away. The pain in my trachea when I run fast (not necessarily sprinting) is very intense, I can't breathe, my brain gets dizzy, my muscles get numb. Maybe I can outperform most people at running because I've done it for so long, but when I do literally any other sport I'll be the only person laying on the floor trying to breath for my life after the first couple of sprints or whatever, while everyone else can go for hours. Most of those people play sports or do exercise once a month at most. My doctors never care, they always just tell me to keep taking the meds.\n\nSudden change:\nAbout 4 months ago I was training for a race. Everything was fine, the usual sh1t in my cornflakes with the asthma. But my performance was improving little by little (was doing 5k @ 15 k/h). Then one day during training I had a very intense abdominal pain. Unbearable, I had to stop almost immediately. This had never happened before, ever. After that I was never the same, and now it happens every time I train. My performance dropped drastically (now doing 3k @ 14 k/h). This is a huge drop. When I'm done I have the usual painful asthma symptoms plus the intense abdominal pain. I'm so tired of this sh1t. The doctors still don't give a f@ck. I've gone to different pulmonologists and it's all the same. Someone please help.","like_count":"0","tags":[]},"responses":[{"author":"armartin7381","resp_time":"over 2 years ago","resp_title":"RE: Abdominal pain running with asthma","resp_content":"I have had issues with asthma for years. We have tried many meds and i have been on prednisone steady with tapers often for 30 years, same meds as you, and breath treatments every few hours. Then my doctor tried BREO. HUGE DIFFERENCE! Not sure why it helped so much better than Advair since they are so similar, but it did help.\nMy doctor is an Asthma, Allergy, and Immunologist, not pulumologist. (I have seen a few pulumologist also.) But the main thing is I found a doctor who listens! That should be your main goal.\n"},{"author":"anita532","resp_time":"over 2 years ago","resp_title":"RE: Abdominal pain running with asthma","resp_content":"It sounds like you have developed a hernia. They can take years to heal. If so, stay off your feet as much as possible for next 2 years. You are young enough that you should be able to heal it yourself.\n"},{"author":"mariajasminefreeman","resp_time":"over 2 years ago","resp_title":"RE: Abdominal pain running with asthma","resp_content":"Hello\nAbdominal pain can happen during an acute asthma attack-characterized usually by wheezing, due to excessive use of abdominal muscles. Mind you though, in severe serious asthma attacks- amounting to suffocation, wheezing may be absent altogether. If your abdominal pain is diffuse, and your symptoms fit into such a great severity of symptoms in your chest, then your abdominal pain could be due to your asthma attacks.\nHowever if your pain is localized, it is prudent to think of other causes. First off your medications may compundingly cause stomach pain and significant fatigue-separate from your asthma. More, it might be advisable to do a CTscan of the abdomen to rule out any structural pathology, vascular or visceral( body organ).\nDr Hana Fayyad\nMaria Jasmine Freeman\n"},{"author":"ahnesd","resp_time":"over 1 year ago","resp_title":"RE: Abdominal pain running with asthma","resp_content":"I wish you well\n\n<a href=\" https://khohealth.com/why-are-you-running/ Are You Running</a>\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/39479/abdominal-pain-running-with-asthma"},{"post":{"author":"bactreat","post_time":"over 1 year ago","post_title":"Why should I take singular at night for asthma?","post_content":"On the insert it said if taking singular for allergies then take in the morning. However, if taking the medicine for asthma then take it at night. What's the difference? If it's in my body then it's in my body, right?","like_count":"0","tags":["Living & Managing","Treatment"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Why should I take singular at night for asthma?","resp_content":"Asthma sufferers have worsened symptoms at night. So it helps.\n"},{"author":"richardmorgan","resp_time":"over 1 year ago","resp_title":"RE: Why should I take singular at night for asthma?","resp_content":"The different dosing times have to do with the effects of the medication such as onset, peak, and duration. For most asthmatics their symptoms can be worse at night, or when first waking up. Therefore you want to take the medication when you go to bed so that the medication is at it's optimum level in your body when your symptoms are peaking. For allergies the symptoms are usually worse in the morning when you are out and about, encountering potential allergens. This is why you would take singular in the morning, to help prevent the allergy symptoms throughout the day when you need the help most.\nSource: https://www.wdrugs.com\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/60727/why-should-i-take-singular-at-night-for-asthma"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Humidity an asthma","post_content":"I need help. I'm having trouble breathing tonight cause of the humidity, I have asthma an also no AC in my house. I have two small fans going in my house. An I'm still having trouble breathing. I've taken my emergency inhaler an taken a duo neb treatment an I'm still struggling to breathe. Can anyone plz help me. I dnt wanna have to go to the ER for this but I'm getting to the point were I might have to. So I need help can anyone help me quickly plz an ty.","like_count":"0","tags":["Triggers"]},"responses":[{"author":"nieceyrene","resp_time":"over 1 year ago","resp_title":"RE: Humidity an asthma","resp_content":"I would say def you need air conditioning. Or maybe you can go somewhere that has it? But I do believe heat makes it harder for me. Maybe try cold showers and lay in front of the fan. Or Coker bath. Hope you feel better!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/56131/humidity-an-asthma"},{"post":{"author":"mjrbig","post_time":"over 1 year ago","post_title":"coughing","post_content":"over 2 years I've been coughing sometimes severe. My asthma medication wasn't working,cough pills, cough drops but still coughing. Went to the doctor again still coughing. He changed my asthma medication and gave me for reflux to prevent ulcers. Now I'm not coughing or wheezing like I was.","like_count":"0","tags":["Living & Managing","Triggers","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/58021/coughing"},{"post":{"author":"jessaslonaker_","post_time":"over 1 year ago","post_title":"Chronic cough/breathing problems 2+ years!!! What to tell doctors to get them to run further tests? PLEASE ADVISE!!!!","post_content":"Over two years ago I started having a bad cough and breathing difficulties. I was diagnosed with bronchitis. It has NEVER gone away. I am constantly coughing. I have times worse than others. Sometimes dry/hacking, sometimes wet/productive. When I start I cannot stop. I have coughed hard enough on several occasions that my vision has become covered in white spots and then gone black, it I cannot tell if I passed out. Occasionally I have pain in my heart, feeling like my heart is a pin cushion. I have seen many doctors blaming my weight, calling it a cold, telling me to see my psychiatrist to change my anxiety meds. All of these things are insulting. I feel miserable. Nobody will run any further tests than a chest x-ray. Nothing shows, but I know something is wrong. Not mention, I got married 6 months ago and in the last month my husband has also started hacking and coughing. On top of all of this, I am a nursing student and I am terrified of potentially passing whatever I have to a patient when I start clinicals. I don't know what to do to get doctors to take me seriously so I can get to feeling better. Please, please help me!","like_count":"0","tags":["Triggers","Treatment","Tests"]},"responses":[{"author":"coupongal1","resp_time":"over 1 year ago","resp_title":"RE: Chronic cough/breathing problems 2+ years!!! What to tell doctors to get them to run further tests? PLEASE ADVISE!!!!","resp_content":"It could be a lot of things (I have that issue too) - my suggestion would be a thorough physical FIRST, to rule out any other causes - then try cutting back on how much dairy and eggs you eat (both can cause mucus), make sure you're drinking a LOT of water, make sure you're not smoking - look into herbal remedies - there are some wonderful ones out there - look up Dr. Christopher's Lung and Bronchial Formula or his Sinus Plus formula - BOTH are great for the lungs and the breathing and both will help you a LOT (i've taken them and continue to take them with great results)!\n"},{"author":"flogercho","resp_time":"over 1 year ago","resp_title":"RE: Chronic cough/breathing problems 2+ years!!! What to tell doctors to get them to run further tests? PLEASE ADVISE!!!!","resp_content":"Hi, I really feel for you. I've been suffering from chronic cough (productive) for 7 long years. It all started with having a bad cold. I was admitted 4 times to ER for unable to breath. I slept on the couch sitting up position. Over 10 doctors including Chinese medicine folks treated me with no avail. I've lost 50 pounds from 180. I couldn't even stand up to take shower due to lost all of my energy. I was going through full box of tissues every night for cough up mucus. All doctors told me that I am suffering from bronchitis and asthma. Some said I had severe case if allergy. After spending iver $80k of my own my money, my family thought I've reached the end of road to survive. My skin started to dry up and I couldn't finish the sentence due to short of breath. Some doctor thought I have a lung cancer and went through complete test and came out negative. Since two years ago I am 100% normal without any symptoms. I accidentally found a cure myself. It was the asthma medication and advil for my back pain. These two should never be mixed. As soon as I stopped taking Advil, everything came back to normal in 3 months. Now I take Tylenol for my back pain and have no issues. It was a miracle discovery for me. I hope this respond replies for you also.\nGood luck.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/55409/chronic-cough-breathing-problems-2-years-what-to-tell-doctors-to-get-them-to-run-further-tests-please-advise"},{"post":{"author":"uhhmanda","post_time":"over 1 year ago","post_title":"Today I was exercising and I just had to sit down. I felt like I was going to pass out.","post_content":"My coach asked me if I had asthma, I said no. My mom has asthma, and I think I've heard it's genetic, don't quote me on that. I was breathing rather heavily but I don't want to self-diagnose. It was really scary and I may also mention that I have had this happen 3 or 4 other times. I do not have a history of heart problems either. My other coach mentioned that I looked very pale. I don't know if this has anything to do with what happened but I had terrible chest pains for about 3 days about a month before this happened. Help me out if you can!","like_count":"0","tags":["Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/56483/today-i-was-exercising-and-i-just-had-to-sit-down-i-felt-like-i-was-going-to-pass-out"},{"post":{"author":"samlas","post_time":"over 2 years ago","post_title":"What can I do to permanently stop blocked nostrils and struggle for breathing when asleep","post_content":"I always experience my two nostrils blocked when asleep, especially during cold season. How can this be stopped pamanently","like_count":"0","tags":[]},"responses":[{"author":"robertfall","resp_time":"over 2 years ago","resp_title":"RE: What can I do to permanently stop blocked nostrils and struggle for breathing when asleep","resp_content":"You need to see the doctor. What goes well for the other person might not really work for you so to avoid such see the doctor and get the best\n1\n"},{"author":"samlas","resp_time":"over 2 years ago","resp_title":"Have seen Dr, all was advice is to always get and kip myself warm.","resp_content":""},{"author":"WebMD Medical Editor - Neha Pathak, MD","resp_time":"over 2 years ago","resp_title":"RE: What can I do to permanently stop blocked nostrils and struggle for breathing when asleep","resp_content":"I am so sorry to hear that you are feeling his way. The stuffy nose this must really make it hard to get a good night’s sleep. The symptoms you are describing sound like what doctors call, “rhinitis.” This is a fancy way of describing inflamed nasal passages that can cause symptoms like runny nose, stuffy nose, postnasal drip, and sneezing.\n\nRhinitis can be caused by to allergies (from things like furry animals and pollen) or from other triggers in the environment (like strong smells, cigarette smoke, chemical fumes, and weather changes to name a few). Sometimes people can develop nasal polyps in their noses and this can cause a constant feeling of stuffiness. Nasal polyps are small growths in the nose and they are not dangerous. They sometimes happen to people that have asthma or irritation in their nostrils and sinuses for more than 3 months.\n\nThere are a couple of ways to treat the stuffy nose. It is best to work with your doctor to come up with a plan that works for you. You might start by avoiding triggers that cause congestion. It might also help to prop your head up with a few pillows so you can breathe more easily when you sleep. You can also learn about cleaning out your nasal passages with saline solution- your local pharmacist can help you find products that are safe to use. There are also nasal steroid sprays that can help. Be careful to check what is in your nasal spray, because some (like nasal decongestants) can actually worsen congestion is you use them for more than 2-3 days. IF your doctor thinks you have nasal polyps, then they will check you for that and help you come up with a plan to treat the polyps.\n\nPlan to follow up with your doctor to let them know what you have tried. Let them know how difficult your symptoms are to deal with and that you need more help trying to find a plan that works for you.\n\nI hope you get a good night’s sleep soon!\n"},{"author":"darrell2018","resp_time":"over 1 year ago","resp_title":"I have experienced two very different solutions to years of sinus issues. The first was accidental, I was stung by a red wasp between my eyes right above where my glasses rest on my nose (I am not kidding) and experienced life changing relief in less than 30 minutes and lasted almost a year. When the \"inoculation\" wore off I didn't have the will power to force a wasp to sting me (my old symptoms started coming back). I was miserable for years, I could tell doctors were polite but mentally rolling their eyes when I explained the experience. When I was diagnosed with extreme sleep apnea years later I found one of the wonderful side effects of CPAP use was much improved sinus function. A good supply of filtered air during sleep is I think one of the most miraculous health improvements on the planet. I wish everyone could get this help but unless you can get a diagnosis of apnea your insurance will not buy you the (expensive $1000+) CPAP machine. This is a condition that only the insured or wealthy person can afford.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/36172/what-can-i-do-to-permanently-stop-blocked-nostrils-and-struggle-for-breathing-when-asleep"},{"post":{"author":"l1ke2sew","post_time":"over 1 year ago","post_title":"Obstructive Restrictive and Odd Chest Pain","post_content":"Hello, I am new to having asthma. I was sick in October, then again the full month of March with bronchitis. Doc thought pneumonia but xray didn't show any. Did spirometry in April. Diagnosed with mild obstructive and restrictive lung defects. I am often wheezing inhale and exhale. Doc said it was asthma. I thought asthma was only obstructive. I use a preventive inhaler and rescue inhaler. I have lots of bronchospasms or esophageal spasms or something going on in there daily. I can't seem to get it under control. I had a charlie horse under my left arm for about 5 minutes 3 weeks ago. This of course got me a walking stress test which I passed with flying colors. Then last night I thought I was getting one again, it went away, then came from the left side across my chest. I got dizzy with this one and started to go to the doctor again, but feel like it must be nothing. Could this possibly be a reaction to my inhaler? They have not come at times within a few hours of either type of inhaler use. And I did not use the rescue inhaler afterwards because I don't know if it is my lungs-esophagus-muscle, etc. However, it has not killed me in the past 3 weeks so I know it is not a heart attack. Could this be muscular and part of the restrictive diagnosis? I am 50, a little overweight, but not obese.","like_count":"0","tags":["Living & Managing","Treatment","Diagnosis","Tests"]},"responses":[{"author":"jeffbo","resp_time":"over 1 year ago","resp_title":"RE: Obstructive Restrictive and Odd Chest Pain","resp_content":"You might want to check out these two articles full of case studies>>\n\nhttps://jefftbowles.com/longer-term-high-dose-vitamin-d3-therapy-cures-asthma/\n\nhttps://jefftbowles.com/copd-is-incurable-dont-tell-that-to-high-dose-vitamin-d3/\n1\n"},{"author":"l1ke2sew","resp_time":"over 1 year ago","resp_title":"Thanks. I didn't see anything about obstructive and restrictive lung defects both being due to asthma. Do you know anything about that?","resp_content":"Reply\njeffbo\nover 1 year ago\nHi there...if you read the asthma article in depth you will find the part where it explains that Vitamin d3 is actually a tissue remodleing hormone which basically drills more airways into the lungs and makes them less dense and able to absorb more oxygen. From this one might infer it could help in remodeling various defects. For example I once had a bone spur (a defect) on my elbow for 20 years ...after about 6 months of high dose D3 it simply dissolved and was remodeled intgo a normal elbow....The same thing might happen to your lungs...you will have to see....but sont worry it is not very risky if you take vitmain k2 and magnesium with it..It's up to you to give it a try...if it doesnt work ...at least you tried...Now a modern day Dr woudl likely rfeccomend surgery first....I say why not let your body try repairing it..it has the blue plans!\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/54833/obstructive-restrictive-and-odd-chest-pain"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"PLEASE HELP","post_content":"So I'm a teenager and I play sports but I have asthma but my doctors say it's minor. I take proair (albuterol) as a rescue inhaler but it doesn't help. I can't do anything and it's causing me to make up stuff to get out of sports practice. I can't even bend down and tie my shoes without getting out of breath. I have had 3 asthma attacks in my life and I know this is serious but my mom kind of just brushes it off. What should I do??","like_count":"2","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: PLEASE HELP","resp_content":"Find another doctor for 2nd opinion\n1\n"},{"author":"thequietone2","resp_time":"over 1 year ago","resp_title":"RE: PLEASE HELP","resp_content":"I would definitely consult a doctor such as pulmonologist. Do some research and get your condition under control. I've recently been diagnosed and now the treatment I'm on has been helping.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/51842/please-help"},{"post":{"author":"hareman","post_time":"over 1 year ago","post_title":"A possible aid for chronic asthma","post_content":"Immunade, Nature’s Immunity Food, was developed as the human adaptation of our Veterinary Biologic egg powder, which has the registered claim to help prevent diarrhea caused by E. coli in young animals.\n\nQuite by accident we have seen it work as an anti inflammatory in some people. That is, some people who have taken it on a daily basis for digestive disorders, have seen complete reversals in osteoarthritis joint pain and asthma symptoms.\n\nMy layman’s explanation for this is that the initial cause of the digestive disorder was also causing enteric inflammation. In reading research reviews on the subject it is possible that enteric inflammation can trigger inflammation elsewhere in the body, such as joints and lungs.\n\nLately I have made it my mission to read all research about the gut microbiome and its possible connection to many health disorders. And there is research showing an association for almost every chronic health problem.\n\nI recognize our testimonials do not constitute scientific results. They are legitimate however and there is other peer reviewed research showing the connections of these ailments to gut microbiome health. Maybe by alleviating a bad bacteria overgrowth and resulting enteric inflammation, Immunade can help some people with asthma and joint pain, which are both caused by Inflammation.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/53533/a-possible-aid-for-chronic-asthma"},{"post":{"author":"weberwoman","post_time":"over 1 year ago","post_title":"Asthma Treatment","post_content":"After struggling for many years,I have been treated by a fabulous pulmonary physician who specializes in the treatment of asthma. Sharon R. Rosenberg, MD at Northwestern Memorial Hospital in Chicago has literally given me my life back. Outstanding bedside manor, expert medical management and quick access by phone and email have controlled my symptoms to the point I live life fully. Hurrah for Dr. Rosenberg at Northwestern in Chicago.\nJean M. Weber","like_count":"0","tags":["Living & Managing","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/52627/asthma-treatment"},{"post":{"author":"valiavalia","post_time":"over 2 years ago","post_title":"Asthma and pro air medication for asthma","post_content":"I got a severe leg cramp again last night I never thought it was related to my inhaler. Now, for 3 months I will get off milk pruducts and see if I don't need the albuterol anymore. These cramps are terrifying I scream because the pain is so severe! I have had these cranks sporadically as long as I have been on asthma medication. I got off the steroids because I was becoming obese.\n\nValia\nIn NYC","like_count":"0","tags":["Living & Managing"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Asthma and pro air medication for asthma","resp_content":"Pro air can cause many side effects such as, nervousness, feeling shaky, muscle tension, and a lot more but the ones I listed are more common. I am confused about the milk though... Does milk supposedly make asthma worse? If so I don't think milk effects me, as I haven't had milk in months and I'm still having bad asthma. Maybe talk to your pulmonologist or primary care doctor about changing your medication or what you can do to help ease the side effects. (Sorry if I've spelled anything wrong)\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/7998/asthma-and-pro-air-medication-for-asthma"},{"post":{"author":"valiavalia","post_time":"over 2 years ago","post_title":"Asthma inhalers","post_content":"Sorry for typographical errors\nI took more pro air inhalations recently and had a cramp in my right leg about a week ago while in the bathtub. Truly terrifying!\nAnd no doctor ever warned me about cramps . I just called a pharmacist and was told that yes, pro air, which is Albuterol, causes cramps.\n\nI plan to stop milk products and perhaps won't need the inhalers again!!","like_count":"0","tags":["Living & Managing"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Asthma inhalers","resp_content":"Pro air can also cause shaking, muscles tenseness, nervousness, and nausea. If you've ever had a breathing treatment you would probably get all of them (I do) and it is very scary\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/7999/asthma-inhalers"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Asthma?","post_content":"When I do light exercise or run, it feels almost like my throat is being closed up and I can't breathe. It also feels like I can't fill my lungs to their full capacity and I wheeze too. I was put on a Prozac (?) rescue inhaler 30 minutes before exercise and when needed, and it did nothing. Now I'm on an Advair inhaler twice a day, and no surprise, it's not working. It's definitely not because I'm out of shape because it happens during any exercise all throughout the year. I really need help on figuring out what this is, because it's getting scary when I can't breathe and I'll have to quit my track team :( Help?","like_count":"0","tags":["Living & Managing","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Asthma?","resp_content":"You might need respiratory therapy...see your pulmonologist...\n"},{"author":"jklingel","resp_time":"over 1 year ago","resp_title":"RE: Asthma?","resp_content":"exercise-induced asthma? allergies? pneumonia? lots of options that only a doc can pin down, perhaps a specialist as mentioned already. no waiting; git 'er done, jack!\n"},{"author":"mtntrek","resp_time":"over 1 year ago","resp_title":"RE: Asthma?","resp_content":"Prozac or ProAir? Definitely get a referral to a pulmonologist. I feel your pain. I took a moderate hike and my oxygen levels dropped to where I had to be rescued. Was a scary day for me. Take care of yourself.\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Asthma?","resp_content":"Do you use a spacer? I hadn't been using one but just last night I was in the ER with a asthma attack and they gave me one. It actually helps a lot. I take pro air (albuterol) and when it gets old it doesn't work. Check the date on your inhalers. Hope it gets better : )\n"},{"author":"tjfb2810","resp_time":"over 1 year ago","resp_title":"RE: Asthma?","resp_content":"Not a medical professional, but could be exercise induced asthma? Try starting small and working your way up to longer and harder exercises. Warm up and down each time. Maybe you could even look up some breathing exercises to help strengthen and regulae your breathing ability?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/47525/asthma"},{"post":{"author":"sankhosh","post_time":"over 1 year ago","post_title":"Asthma","post_content":"Last year my 5 year old starting suffering from asthma. He's been I and out of e/r with asthma, mainly because of pneumonia. We've tried daily singular, not working. I've taken him to get alternative treatments for prevention, cupping, acupuncture, herbal treatment. It's not working. We've discovered that exposure to dogs triggers it and colds too. I'm suspecting chlorine as well from swimming. He's allergic to everything so I do my best to keep house air clean and keep his exposure to triggers minimal. I don't know what more to do. Doctors now want to put him on daily stetiod. I've read that stem cells can probably cure. I banked his cord blood cells. So reaching out to the MD community for anyone to chime in and give me some hope to possible cure. Thank you.","like_count":"0","tags":[]},"responses":[{"author":"kobemamba24","resp_time":"over 1 year ago","resp_title":"RE: Asthma","resp_content":"May Type 1 hypersensitivity reaction. Estimate the levels of IgA IgE IgD\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/49359/asthma"},{"post":{"author":"786ahme","post_time":"over 2 years ago","post_title":"Toddler breathing","post_content":"My 3 1/2 year old has been taking deep breaths for the last couple of days every 30 seconds . She is happy, playing normal . But taking deep breaths that seem uncomfortable . She’s to your to explain what she’s feeling . I told her to urgent care , her oxygen levels were fine and chest x Ray came out clear . Followed up with her pediatrician and she said she sounded fine, had no idea what could be wrong . I’m desperate to find a solution . Would love opions on what over test could be ran to help find an answer. I will not give up on my child, it can’t be comfortable taking deep breaths like that, any advice is much appreciated.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Toddler breathing","resp_content":"Hi, i am not a dr but could it be a heart condition?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/38700/toddler-breathing"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Allergies?","post_content":"I'm a 13/yr female and I was diagnosed with bronchitis (idk if that's what it's called but it's like asthma but not as bad) a couple years ago, and just recently my doctor said we can now say I have asthma. But a couple months ago my nose was stuffy on a daily basis but it was really runny at the same time and I sneeze at least twice every day. I have 2 dogs, I don't go near anyone who smokes , and my house is probably a little dusty... but could I be slightly allergic to my dogs or could asthma cause these symptoms?","like_count":"0","tags":["Triggers","Diagnosis"]},"responses":[{"author":"ZDubs","resp_time":"over 2 years ago","resp_title":"RE: Allergies?","resp_content":"Yes, allergies change all the time. I'm more allergic to short hair cats than long hair cats. I suggest an allergy test to be sure of what's going on.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/41046/allergies"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Health problems. (1) HYPERTENSION)(2) ANEURYSM IN THE AORTA CHEST AT 4.2 CM at size. ANXIETY ATTACKS, BREAST CANCER, AND NOW I HAVE VERY SEVERE ASTHMA ATTACKS.","post_content":"First of all I attended schooling to become a Pharmacists, I completed only 5 yrs. That was my goal. I attended schooling in S.D. CA. I couldn't finish my schooling due to an abusive ex husband drug addict. I relocated back to my hometown GUAM.","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/45070/health-problems-1-hypertension-2-aneurysm-in-the-aorta-chest-at-4-2-cm-at-size-anxiety-attacks-breast-cancer-and-now-i-have-very-severe-asthma-attacks"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Is this Athma??","post_content":"Its a bit of a story, if anyone has had something slimier I would love to hear about it. I hope there is a light at the end of this tunnel. At the end of December I caught a nasty Bronchitis cold, it was a horrific 3 weeks of being unable to breath and tons of ER visits with breathing treatments. Ever since then my breathing has never been the same as it was befor. I am constantly struggling to breath its a fight ever single moment and even with qvar, rescue inhailer, neutralizer with albuterol sulfate, antihistamines( allegra D or claritin D) and omeprizol ( for gerd). I am still struggling to breath even with all those. They offer no improvement what so ever. They used to help. But now no longer help. My doctor says my lungs sound fine and my oxygen lvls are most of the time 95-100 and somehow a test from 2 years ago disproves that I don't have asthma. They wouldn't do another test. Is this asthma doing? or is there something else I should be looking into? Has anyone else had this issue? Is it just bronchitis healing and if so how much longer will it take to breath again? It has been a month since this all started.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Is this Athma??","resp_content":"Have you tried seeing a pulmonologist..? A regular internal/primary doctor sometimes cannot figure out what's going on. I've seen this in some cases with patients and usually going to a specialist they can figure out what's going on within two weeks after reviewing blood work and preforming breathing test. Not just listening to your lungs and checking O2 stats\n"},{"author":"music_53","resp_time":"over 2 years ago","resp_title":"RE: Is this Athma??","resp_content":"Hi, wow does your story sound familiar! I would definitely see either an adult asthma specialist or a pulmonologist (get a referral from your GP). That's the only way the specialists can really get an idea of what is really going on. The eNO (exhaled nitric oxide)test was an additional breathing test I got while seeing an adult asthma specialist, and it showed inflammation where the other pulmonary tests did not show issues, including oxygen levels (oxygen levels do not measure if you have asthma, only shows that the arterioles in your bronchial tubes are getting good oxygen. Oxygen levels do NOT show if you have inflamed/hard to breathe problems in your chest). I too had two bad bouts of bronchitis last summer, had nasal allergies all of my life, but never asthma. Suddenly after those bouts, I was having wheezing, crackle sounds, feelings of not being able to breathe, mucous coughed up, constant coughing. I am 60 years old. Got onto the Advair inhaler (combines steroid with another med to loosen bronchial walls), and along with the allergy meds, I am doing much better. I still do cough and am junky, but I no longer have the breathless sensation. I really hope that you can get to a specialist. My dr said that 30% of people with allergies will eventually get asthma, and it's often all started off with nasty virual infections, etc. Good luck, and don't put up with breathlessness and struggles. You need to get a good combo of medications after thorough testing by a specialist.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/38244/is-this-athma"},{"post":{"author":"missjilly","post_time":"over 2 years ago","post_title":"Prednisone","post_content":"I have a sinus infection and bronchitis. This has caused my asthma to go into a major tailspin. I went to the emergency Wednesday night (it's now Thursday night). I have taken 2 prednisone pills both 50mg. I don't feel like it's doing anything. I am still taking my Ventolin via an aero chamber as well as my Pulimort. I'm not feeling like any headway is being made. I know that I have only taken two pills of a 5 day dosage, I just get really nervous when my asthma is this bad.\n\nShould I head back into my doctor or still give it a couple of days?","like_count":"0","tags":[]},"responses":[{"author":"granette","resp_time":"over 2 years ago","resp_title":"RE: Prednisone","resp_content":"Any trouble with asthma necessitates medical care. Please seek medical care immediately. I lost my lifelong best friend due to complications from asthma that she was unaware she had.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/37520/prednisone"},{"post":{"author":"leslieann77","post_time":"over 2 years ago","post_title":"IGE","post_content":"So what IGE mean? What is the 79 mean? I don't understand.","like_count":"0","tags":["Tests"]},"responses":[{"author":"breannnaaa_ma","resp_time":"over 2 years ago","resp_title":"RE: IGE","resp_content":"IGE is tested on people to see if they are allergic to a specific substance or to see if there is a reaction having with the immune system. If your IGE result is less then 100 you're good. But people who have high IGR results such as 200 and more it means they have immune problem. Such as eczema and so on.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/33767/ige"},{"post":{"author":"heatherk86","post_time":"over 2 years ago","post_title":"Shortness of breath","post_content":"31 y/o female, 7 months postpartum, 3rd child, SOB with normal pulse, Pulse oximetry, normal heart sounds, no wet lung sounds, persistent dry cough, since 1 month postpartum. Stress related? Heart related? Help :( family physician and pulmonologist no help. This has never been an issue before, no fam hx of asthma but I did have a greater than 20% drop on my methacoline test at the 10mg mark, I have been healthy my entire life. It's driving me crazy and making me a nervous wreck.","like_count":"0","tags":["Living & Managing","Treatment"]},"responses":[{"author":"heatherk86","resp_time":"over 2 years ago","resp_title":"RE: Shortness of breath","resp_content":"Should also add that this is a 24/7 occurrence in my life\n"},{"author":"mhousehouse","resp_time":"over 2 years ago","resp_title":"RE: Shortness of breath","resp_content":"Hi there\n\nHave u had any developments of this ? I posted recently I will post my message below I have a similar situation and I am 6months post partum!!\n\nI hope we can find an answer!\n\nI am a F 26YO. I have suffered from severe lack of breath for about 13months now. It started when I was pregnant and I am not 6m post partum and still struggling.\nI have severe shortness of breath and irregular breathing for about 80% (sometimes more, sometimes less) of my waking day. Sometimes I breath in so deep and so hard that my ears pop and unpop, and I can continue in that state for an hour or more trying to regulate my breathing and unpop my ears permanently. Sometimes my breathing is so messed a whole hand or side of my body will go numb like I’m having a stroke. Sometimes my chest gets very tight and I feel I really won’t be able to catch my breath. I often think I’m going to pass out or choke but I never do. It affects my life as I can be rude or snappy to people when I’m trying to regulate my breathing, and I’m often not present in what’s going on. Plus all the hard deep breathing is causing pain in my back. When I was pregnant I had a dry cough for 6m which was literally just from lack of breath.\nI have been to three different doctors and all of them have diagnosed anxiety (something I have struggled with in different forms for 11years). They think it’s this because i seem to be fine when I sleep and for the first 10 minutes when I wake from sleeping, and if I am very preoccupied (in some situations). I have been diagnosed escitocitalopram 20mg for the anxiety. I’ve been on it for around 10 months (or longer) with no success. In my country you only qualify for free/subsidised non-medical counselling help if you are depressed and on the verge of suicide. Other than my days being hard work because I can’t breathe I have a happy life and am not depressed hence why I cannot get counselling. In my country doctors are extremely overworked and I’m concerned they have overlooked something hence why after 13 months I am still struggling.\nI can’t do another year of this, please help !\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/33229/shortness-of-breath"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Lung Scarring","post_content":"I am a 26-year-old male. I recently went to the emergency for chest pain. After an EKG and a chest x-ray, I was told that the pain was probably due to musculoskeletal strain. However, after leaving I noticed that the findings from my chest x-ray included the following: \"Biapical pleural/parenchymal scarring is noted.\" I assume that this is not very serious, since no one mentioned it to me at the emergency room. Can anyone shed some light on what this means and whether I should be concerned?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/37946/lung-scarring"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Lifelong chronic symptoms rapidly reduced after taking potassium. Unknown cause. Would appreciate any theories or ideas!","post_content":"I’m very interested in your theories for my undiagnosed condition.\n\nI’m a 30 year old male that has suffered from a long list of chronic severe symptoms for most of my life. Dozens of specialists consultations and different tests and treatments have yielded no results.\n\nRecently, I tried a potassium gluconate supplement. I experienced rapid and dramatic reduction in all of my symptoms. This effect has been repeatable for 2 months. If I stop the supplementation, the symptoms return within a day.\n\nSevere, chronic symptoms improved:\n\n• Asthma and respiratory issues.\n• Nasal congestion.\n• Constipation.\n• Headaches.\n• Muscle cramping, weakness and pain.\n• Insomnia.\n• Palpitations.\n\nI’ve also suffered from unexplained osteoporosis since my twenties.\n\nIt would be life-changing to finally know what has caused me so much suffering throughout my life. This potassium effect is my first piece of evidence that might help me solve the mystery. I would appreciate any opinions and theories!\n\nI’m booked to see an endocrinologist. Suggestions of other recommended specialists are welcome. I’m taking 400mg to 800mg of potassium gluconate per day. I understand that this is within a safe dosage range. Previous years pathology show low but not out-of-range serum potassium levels.","like_count":"0","tags":["Treatment","Diagnosis","Tests"]},"responses":[{"author":"unfoldedcube","resp_time":"over 2 years ago","resp_title":"RE: Lifelong chronic symptoms rapidly reduced after taking potassium. Unknown cause. Would appreciate any theories or ideas!","resp_content":"Any chest discomfort I. The middle of your chest when breathing in deep? Or breathing in when bending over?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/31302/lifelong-chronic-symptoms-rapidly-reduced-after-taking-potassium-unknown-cause-would-appreciate-any-theories-or-ideas"},{"post":{"author":"suavacado","post_time":"over 2 years ago","post_title":"Symptoms not going away","post_content":"I have exercise induced asthma and am a recent ex-smoker (for like the 6th time, after 9 years). Until the past year my symptoms only fared up about once a week or less but has been getting more and more frequent and then today, about 3 days after quitting I have mild symptoms that have not gone away even after using my inhaler and it came on for seemingly no reason.","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis"]},"responses":[{"author":"asthmaistheworst","resp_time":"over 2 years ago","resp_title":"RE: Symptoms not going away","resp_content":"I recommend going to see your doctor, they may be able to give you new medication if yours isn't working, as well as help with your more frequent asthma attacks.\n1\n"},{"author":"michaelfoxfox","resp_time":"over 2 years ago","resp_title":"RE: Symptoms not going away","resp_content":"Maybe you will turn to official site of manufacturer? I think that it's unnormal for treatment. My friend from https://www.domyhomework4me.net/ advised to read the instruction to a medicine\n"},{"author":"missjilly","resp_time":"over 2 years ago","resp_title":"RE: Symptoms not going away","resp_content":"This might sound really strange but after I quit smoking my asthma actually got worse for the first couple days and weeks, and then improved significantly. That's just my experience but I would say head to your doctor and I really encourage you to be a full fledged quitter this time :) good luck!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/19719/symptoms-not-going-away"},{"post":{"author":"srb1989","post_time":"over 2 years ago","post_title":"Horrible Dull Pain Behind Shoulder Blades","post_content":"What is this Horrible Dull Pain behind shoulder Blades? Had the flu at the beginning of last week. Felt fine Thursday evening, all day Friday and Saturday morning except for a lingering cough. Saturday afternoon my mid to upper back started hurting especially under my shoulder blades. Hurts whether I am sitting or up moving. Still hurting today and my cough is still present with chest pain when I cough. Any answers to what this could be would be great. A little more info....my 2 year old son was diagnosed on Friday with pneumonia.","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"missjilly","resp_time":"over 2 years ago","resp_title":"RE: Horrible Dull Pain Behind Shoulder Blades","resp_content":"Is it possible it's your gallbladder? I had terrible chest pains when I had attacks but have heard that it's incredibly common for people to get pains in their shoulder blades. Sorry I don't have much else to offer. I do hope you get some relief soon.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/37084/horrible-dull-pain-behind-shoulder-blades"},{"post":{"author":"samlas","post_time":"over 2 years ago","post_title":"Could this be asthma, if yes what can I do","post_content":"In a year, I mostly have a blocked nostrils when asleep and a times struggle to breath even with mouth especially during cold weather. But during dry season, when there is heat, I also experiences tight chest and syrugle to breath. I consult a Dr who prescribed ventolin sabutamol tablet for me, any time I noticed this symptoms, I take one or two tablets prescribed for me and after like 2-3minutes, the symptoms will disappear.\nI need a candid medical guides to stop all this, or cattah, as in cold can't be cured?","like_count":"0","tags":[]},"responses":[{"author":"mariajasminefreeman","resp_time":"over 2 years ago","resp_title":"RE: Could this be asthma, if yes what can I do","resp_content":"Given you show a response to bronchodilators( salbutamol n ventolin), and short of a direct physical exam, indeed Asthma is v highly likely. You thus need to go for inhaled corticosteroids for control of your asthma( to avoid needing rescue medications( ventolin), especially that using those latter alone may increase your health risks.\nYou seem to also have a nasal allergy element( often escorting asthma), thus antihistamines at bed time will add benefit, at least as a preliminary step, besides. In such a case, even starting with nasal local steroids even prior to antihistamine use, is recommended.\nDr Hana Fayyad, pediatrician\nMaria Jasmine Freeman\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/36170/could-this-be-asthma-if-yes-what-can-i-do"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Silicon inhalation","post_content":"I inhaled a small amount of fine silicon once . Should I be worried or go see a doctor soon ? Please help","like_count":"0","tags":[]},"responses":[{"author":"holzier","resp_time":"over 2 years ago","resp_title":"RE: Silicon inhalation","resp_content":"To be on the safe side, go and see a doctor. According to my research with https://hireessaywriter.org you might have been exposed to pulmonary diseases\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/36899/silicon-inhalation"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Mental \"rewind\"","post_content":"I am of \"senior\" age, but certainly don't feel it. My question is relating to reoccurring thoughts-almost like a \"rewind\". Will come up at anytime..bad when it happens in middle of night. Usually sad, things of the day, decisions made. I know of writing down, but often wonder if there's more to this. Please share your thoughts.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/32615/mental-rewind"},{"post":{"author":"blufadoodle","post_time":"over 2 years ago","post_title":"Not fully recovered from Bronchitis from 5 months ago","post_content":"In early June I got sick and i get sick very often and i usually am sick for 1-2 weeks with low fever, so it was no surprise i got sick. But it went on and I was sick for 4 weeks with bad coughing and wheezing so i went to the doctor and they said I was fine. Coughing got worse and fever was still going so 3 weeks later we went back and it turns out I had atypical pneumonia (diagnosed only by her listening to my wheeze) and was on 10 days antibiotics (Not z-pac, im allergic) and my fever went a way and cough got better but was still wheezing daily and coughing. 2 weeks after i finished antibiotics I got sick with bad cough for 2 weeks again after school started. When im not sick-sick with a fever and apparent sniffles I get fatigued very easily. I used to be able to run 2 miles without stopping in 23 minutes but so far in PE i am the slowest and physical activity has been difficult for months. I have headaches often and am very fatigued and I just got sick again this week and started hyperventilating in PE when biking slowly-ish on a relative flat trying to catch up because I am the slowest. Going into the doctor next week but I am scared that I will never get better. I had a breakdown today because I used to be so fit but now I can't do anything... Any idea what I might have? Will I get better? Since my doctor didnt think anything was wrong after i was sick for 4 weeks IDK if her info is 100% accurate....","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"blufadoodle","resp_time":"over 2 years ago","resp_title":"RE: Not fully recovered from Bronchitis from 5 months ago","resp_content":"Forgot to mention I also have been wheezing daily since june, usually only when I lay down but sometimes when I am just sitting in class and relaxed.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/32054/not-fully-recovered-from-bronchitis-from-5-months-ago"},{"post":{"author":"polkahauntus","post_time":"over 2 years ago","post_title":"Long term lung issues","post_content":"I was born with mucous in my lungs after my mother smoked during her pregnancy. I eventually improved, but years later on and off, I'd have issues pop up. Breathing difficulties that would stem from being around potent chemicals and pushing myself too far physically. I would wake up short of breath afterwards, and this would continue until I took liquid sleeping medication and I could feel my lungs calm, and I could breathe easier.\n\nI have no idea what to call this... what I deal with. It's not constant, it's erratic and I can never tell when it's about to happen. But it's very worrisome for myself and family. Due to financial limitations I have not been able to determine what is happening to me. I was wondering if anyone has any insight into what's happening to me, or if someone is dealing with something similar. Is this asthma? Something else? I just want a better understanding of what's happening to me.","like_count":"0","tags":[]},"responses":[{"author":"WebMD Morgan","resp_time":"over 2 years ago","resp_title":"RE: Long term lung issues","resp_content":"Hi there and welcome.\n\nI think it's important you talk to your doctor about these symptoms. Shortness of breath upon waking up can be due to a multitude of reasons, including sleep apnea, which is a sleep disorder that occurs when a person's breathing is interrupted during sleep. You can read more about sleep apnea here: http://wb.md/2iHBqmR\n\nThis is clearly a problem for you and you deserve to have it recognized, diagnosed, and receive treatment so you can get some relief.\n\nPlease follow up with a doctor and share your concerns and all your symptoms.\n\nLet us know how you're doing (((hugs)))\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/25441/long-term-lung-issues"},{"post":{"author":"whazzer","post_time":"over 2 years ago","post_title":"Cold or Flu always becomes bronchitis and sinus infections","post_content":"Sorry for the long post... but i am desperate at this time. I am 52 years old that had bad asthma when I was a child. I seemed I outgrow from my 20 to mid 30's. In my mid 30's I started getting frequent sinus infections. I have had 3 sinus surgeries and take advair, singulair, nasonex, astepro daily along with other medications. Also, in my mid 30's I started getting severe IBS. After many, many tests I eventually found a \"cure\" for that on the internet. The 'cure' is taking digestive enzymes after every meal.\n\nI have been on more antibiotic than I can count and any cold or flu always turns into sinus infection and bronchitis combination.\n\nMy question... has anyone experience the below symptoms and if so what did they do to improve and prevent the same scenario moving forward?\n\n-a cold or flu turns into fever for 5 plus days.\n-cold or flu always turns into sinus infection and bronchitis which always required prednisone and long term antibiotics which get less effective and 80% of the time don't work.\n-severe coughing which requires quadrupling asthma medication.\n\nI am desperate and looking for any answers.\n\nThank you for your time and any suggestions.","like_count":"0","tags":["Living & Managing","Treatment"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Cold or Flu always becomes bronchitis and sinus infections","resp_content":"Do you think your colds/flu might be becoming anti-biotic resistant? Have you had your immune system checked?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/27462/cold-or-flu-always-becomes-bronchitis-and-sinus-infections"},{"post":{"author":"arallen","post_time":"over 2 years ago","post_title":"Breathing problems?!","post_content":"Months ago I started having issues breathing and catching my breath but it wasn’t that bad and I thought it was associated with other issues I have like anxiety. When I was a baby I had really bad RSV and had to sleep with a breathing machine but I do not know of any other problems that would cause what’s happening. Now as months have gone by, my breathing is getting worse. Just trying to talk to someone I lose my breath, I try to sit down and catch it but it’s like I am not getting oxygen in. I had an ekg, chest X-ray , and cat scan and nothing was found except my blood clot levels were a little high and the ekg showed there could be a strain on my heart. I was prescribed a rescue inhaler but when I use it I feel like it is not working.\nCan anybody help? Maybe you’ve had this issue or know someone who has?","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Breathing problems?!","resp_content":"I have the same situation and I was given three different inhalers to use and still nothing is changed. In fact, doing any chore that causes me to rush a little bit makes it hard to breathe and heart to beat faster.\n"},{"author":"djoec1983","resp_time":"over 2 years ago","resp_title":"RE: Breathing problems?!","resp_content":"I'm going through the same thing bouncing from one inhaler to the next and the doctor doesn't seem to be taking it seriously.\n"},{"author":"WebMD Morgan","resp_time":"over 2 years ago","resp_title":"RE: Breathing problems?!","resp_content":"Hi there and welcome,\n\nI'm sorry to hear that you're having a tough time! Have you spoken to your doctor about your rescue inhaler not working?\n\nIf you find that you're not satisfied with the level of care you're getting, you might consider seeking a second opinion or a referral to a specialist. This is clearly a problem for you and you deserve to have it recognized, diagnosed, and receive treatment so you can get some relief.\n\nPlease let us know how you're doing once you've talked to your doctor *hugs*\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/29947/breathing-problems"},{"post":{"author":"Breatheeasy7","post_time":"over 2 years ago","post_title":"Asthma and Reflux","post_content":"Have had asthma for several years now but has been fairly well managed with medication. Recently had been having more trouble with reflux and the over the counter generic Prilosec has become ineffective. The throat was becoming inflamed and had trouble swallowing sometimes. Went to the specialist who switched me to the next version- Nexium and it has greatly relieved many of the reflux symptoms and had an endoscopy to check things out after 6 weeks. I know that the reflux exacerbates the asthma, but now the symptoms have come under better control, still have trouble with the asthma, tightness in the chest and coughing. Has anyone else experienced this and found answers in getting rid of the asthma ?","like_count":"1","tags":[]},"responses":[{"author":"WebMD Morgan","resp_time":"over 2 years ago","resp_title":"RE: Asthma and Reflux","resp_content":"Hi there and welcome,\n\nThis is a good question for your doctor, as he/she would know this answer for you best. Talk to the doctor, share your thoughts and concerns. The sooner you get these symptoms addressed, the sooner you can hopefully get some relief.\n\nPlease let us know how you're doing once you've talked to your doctor.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/29608/asthma-and-reflux"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Humidifiers & Asthma","post_content":"Will a humidifier help asthma? If so which is better, warm mist or cool mist?","like_count":"0","tags":["Living & Managing"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Humidifiers & Asthma","resp_content":"Mayo clinic says YES and NO. If you or your child has asthma or allergies, talk to your doctor before using a humidifier. Increased humidity may ease breathing in children and adults who have asthma or allergies, especially during a respiratory infection such as a cold. But dirty mist or increased growth of allergens caused by high humidity can trigger or worsen asthma and allergy symptoms.\n\nSource: https://www.mayoclinic.org/diseases-conditions/common-cold/in-depth/humidifiers/art-20048021?pg=2\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/31235/humidifiers-asthma"},{"post":{"author":"loowaters","post_time":"over 2 years ago","post_title":"Emergency Attack Shots","post_content":"Why is epinephrine and then Susprin no longer used for emergency asthma relief? When I was a kid this cleared me up and got me home and back to school the next day. Now I can't find info on Susprin anywhere.\n\nLoo","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/31157/emergency-attack-shots"},{"post":{"author":"cynthiakartini","post_time":"over 2 years ago","post_title":"Bronkitis","post_content":"Hii,i want to ask\nwhat is bronkitis? how we know someone has bronkitis.thank you","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"WebMD Morgan","resp_time":"over 2 years ago","resp_title":"RE: Bronkitis","resp_content":"Hi there. Bronchitis is when your bronchial tubes, which carry air to your lungs, get infected and swollen. You can read more about bronchitis here: http://wb.md/2zjBVOI\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/30042/bronkitis"},{"post":{"author":"sammieanddeanie","post_time":"over 2 years ago","post_title":"Mint Asthma Trigger.","post_content":"The other day my teacher told me she'd never heard of mint triggering asthma before. Has anybody else ever had the problem with mint triggering their asthma, or was it just me..? Thanks.","like_count":"2","tags":["Triggers"]},"responses":[{"author":"polioduck","resp_time":"over 2 years ago","resp_title":"RE: Mint Asthma Trigger.","resp_content":"You're not alone. I've had asthma for many years. My pulmonary doctor discovered that mint triggers my asthma. I've avoided mint anything since. I still get asthma, but not from mint anymore. So there are at least two of us whose asthma is triggered by mint. I have other triggers, but mint is definitely on my list.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Mint Asthma Trigger.","resp_content":"It is possible to have an allergy to mint. Another consideration is that mint is known to relax the sphincter muscle above the stomach. This can cause heartburn or reflux symptoms. This can trigger asthma as the esophagus and lungs become irritated.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/7996/mint-asthma-trigger"},{"post":{"author":"echoeselephant94","post_time":"over 2 years ago","post_title":"Could my asthma be back? Or is it anxiety?","post_content":"Hi all!\n\nI just need some insight, because I am getting a bit freaked out!\n\nWhen I was a baby, I had an asthma attack that triggered the fear of not being able to breathe. Until about middle school, I had mild asthma so I had an inhaler that I would use when need be. It has been many years since I have had an asthma attack, and I don't even have an inhaler anymore. I have mild anxiety as well that has not been diagnosed by a medical professional, but I know it exists in my life. I do not take medication for it.\nSunday night, I went to sleep and woke up in the middle of the night not being able to breathe, and since then (today is Thursday), I have had a really hard time breathing. This means chest heaviness/tightness, shortness of breath. I feel like the only way I can get a good breath is through a yawn. This freaks me out and triggers that anxiety in me that \"I'm gonna die, I'm going to suffocate\", that I probably had when I was a baby.\n\nI went to Immediate Care and had an EKG that came out normal, my blood pressure was 107/70 which is normal and my blood work was also normal. I am going to my primary care doctor next Saturday, but does anyone have any idea what this could be?\n\nP.S - as of now, the only thing that has helped me is Valerian Root (the herbal extract and marijuana to relax me).\n\nHELP! Thanks :)","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis"]},"responses":[{"author":"polioduck","resp_time":"over 2 years ago","resp_title":"RE: Could my asthma be back? Or is it anxiety?","resp_content":"I also have asthma and it scares the hell out of me when I feel like I cannot breathe. I also have PTSD from spending months in the hospital, a week in a coma and four weeks in ICU. When I go to a hospital I get very anxious.\n\nI've been having asthma lately with the symptoms you describe. However, my doctor thought that something else was causing my breathing problems. Several x-rays and other tests. Turns out to be pneumonia, which I've had several times. My EKG & blood pressure are normal. It's hard to tell the difference as I'm short of breath and coughing like crazy. I'm on my 3rd round of antibiotics.\n\nI'm not a doctor, but that's been my experience. Have you had chest x-rays yet? That's what nailed the pneumonia. Hope this helps.\n"},{"author":"dottiekay","resp_time":"over 2 years ago","resp_title":"Going to the doctor is the best choice for you. I have asthma too. Not fun to have and I think everyone that has it is scared of not being able to breathe to the point of possibly dying it is a scary situation for sure. You could be having panic attacks... or an asthma issue...or something new","resp_content":""},{"author":"sandy028601","resp_time":"over 2 years ago","resp_title":"RE: Could my asthma be back? Or is it anxiety?","resp_content":"hi my name is sandy, like you i suffered from Asthma all my life along with my twin Sister i can tell you from experience its scary i'm sure you know that, like you my asthma was in remission for about 5 years during that time i was taking vitamin C's in Capsule form i was taking Basic Vitamins you can get those at krogers and it help lot the thing you have to remember is to relax and slow down the breathing, if you are around animals and their feces and dust or any perfume or any thing musky it can trigger it with a vengeance my advice is getting a breathing nebulizer i got one in my bedroom on standby if i needed it i hope you get better\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/24965/could-my-asthma-be-back-or-is-it-anxiety"},{"post":{"author":"rannaichang","post_time":"over 2 years ago","post_title":"Could it be asthma","post_content":"I have lot of allergies. I had asthma test when I was a young adult and I was told to practice breathe . I can't breathe when the wind is blowing lot and I have cough attack lot . Could I have asthma ? When I laugh I feel like I can't breathe . Need help","like_count":"1","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Could it be asthma","resp_content":"[deleted]\n"},{"author":"georgiagail","resp_time":"over 2 years ago","resp_title":"Stop with the SPAM!","resp_content":"Reply\nrannaichang\nover 2 years ago\nFirst this is not spam. I have a honest question . So if you can't me please don't respond georgiagail\n"},{"author":"winasthma","resp_time":"over 2 years ago","resp_title":"RE: Could it be asthma","resp_content":"You need to consult with your physician. Asthma can be managed easily with current medications available.\n1\n"},{"author":"silver144","resp_time":"over 2 years ago","resp_title":"RE: Could it be asthma","resp_content":"How long has it been since you were tested? I had tests done when I was younger, and it was only last year that I was diagnosed. Ask to be tested in the respiratory therapy department in your local hospital. They may have more sophisticated equipment; mine did. Your symptoms sound like asthma, but of course you have to be tested to make sure.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/9670/could-it-be-asthma"},{"post":{"author":"silver144","post_time":"over 2 years ago","post_title":"Increased resp symptoms after quitting","post_content":"One thing that ex-smokers have often experienced is that their respiratory symptoms, especially cough, actually get worse for awhile after quitting (as well I know). Your body is trying to get rid of all that gunk in your lungs and grow back the cilia that line your bronchi and help to sweep out contaminants. I would definitely see a doctor, but be aware that it may take a month or more as this healing takes place. But hold on! You will feel so much better as a nonsmoker. Please allow me to put in a plug for Nicotine Anonymous. It does so much more than just help you quit, and it was a completely different experience than any other. I quit 22 years ago after nothing else worked. Good luck!","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/24492/increased-resp-symptoms-after-quitting"},{"post":{"author":"maggieskittles","post_time":"over 2 years ago","post_title":"Asthma Help for Person Allergic to Sulfur","post_content":"My sister is allergic to all medications that are sulfer based and as far as we've found, the only inhalers are sulfer based. She needs the inhaler, but they're not very helpful with her allergies considering. Does anybody know of any asthma pills or inhalers that don't contain albuterol or ventolin?","like_count":"1","tags":["Living & Managing","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/23224/asthma-help-for-person-allergic-to-sulfur"},{"post":{"author":"kaileysaccount","post_time":"over 2 years ago","post_title":"Asthma problems not helped by steroid shot?","post_content":"My asthma has been getting worse over the last few months. well, both my mother and I get this horrific cough every single time the seasons change. I don't know what to call it. All I know is that its related to my asthma, and it mimics bronchitis, but its not bronchitis. when I'm dealing with it, I'm much more prone to having an asthma attack, too. I'm short of breath constantly, and when I cough it hurts deep in my lungs. In the past, a steroid shot and occasionally some antibiotics fix it. I've been to the doctor for it twice now and had both a steroid shot and antibiotics, and they helped for maybe two days. I'm back at square one. I don't know why it didn't help this time, but it really concerns me that it didn't. This has been going on for almost a month now, and I don't know what to do or what is even wrong at this point. I don't even know that my doctors can do anything else for it. If anyone could provide a little insight or advice, I would be so grateful.\nBTW, I've never smoked.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/22493/asthma-problems-not-helped-by-steroid-shot"},{"post":{"author":"tjbanes","post_time":"over 2 years ago","post_title":"Asthma and VCD","post_content":"I am a military veteran. While on active duty, I was diagnosed with Exercise Induced Asthma and used an albuterol inhaler for several years which seemed to diminish the effects somewhat. Upon retirement, I received VA benefits commensurate to that disability.\n\nA few years ago, the VA conducted a follow-on test and determined that I no longer had asthma. After several months and visits to the pulmonologist, it was determined that I actually have VCD and not asthma as originally diagnosed. My claim with the VA is that my asthma was originally misdiagnosed and should have been determined to be VCD\n\nThe VA has now not only denied my claim for asthma, but ruled that my VCD is not service connected. Some of their logic seems faulty and wanted to get some opinions.\n\n1) The VA claims that my asthma issued \"resolved itself\". As I understand asthma, and I am not a medical professional, asthma just doesn't go away. Is that a correct assumption?\n\n2) VCD and asthma symptoms present in very similar ways so they are easy to confuse. As I understand it, asthma medication, such as albuterol, should not have any effect on VCD symptoms. Would albuterol not make breathing easier for someone without asthma, if only marginally?\n\nObviously, there is more to the story, but these are the basics.","like_count":"0","tags":["Triggers","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/13861/asthma-and-vcd"},{"post":{"author":"errorfound","post_time":"over 2 years ago","post_title":"Weird symptoms","post_content":"Hi there.\nI had asthma when I was young(triggered by allergies).\nI smoked for the past 4 years, up to this day without any health problems.\nAfter this winter, which was marked by 2 or 3 colds(very unusual for me to get a cold more than once a year), I found myself coughing up tonsil stones.\nThis spring, I started noticing pain in my chest(not localised in one place) while bending over and breathing deeply(sometimes).\nAnother thing that made me question my health is that my smoker's cough changed into what I can describe only as a vibrating cough( vibration comes from the lungs or trachea?) that sometimes brings up some kind of white/translucent tissue that looks like the skin inside my mouth. I wouldn't be so concerned if those pieces of skin weren't striking my palate that hard(i drew the conclusion that they come from somewhere down my throat?).\nI don't know if I can blame any of this on allergies, but I think I should mention that they've hit me with full force this season.\n\nAny hope for a diagnosis?","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Weird symptoms","resp_content":"Definitely get this checked out by a doctor.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/8864/weird-symptoms"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Asthma and Tylenol Cold Nighttime","post_content":"I have asthma but it only gets bad when I do heavy excersize or get sick, I have a cold and want to sleep at night but I can't because I am always waking up from cold symptoms and coughing (from my asthma). I really want to get a good nights rest so would it be dangerous if I took some Tylonal cold nighttime or would that be dangerous and prevent me from waking up when I need to take my inhaler?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/8828/asthma-and-tylenol-cold-nighttime"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"trigger prevention","post_content":"A friend has recently been diagnosed with Asthma, triggered by smells. She feels secluded, unable to go to church or anywhere with many people, due to the perfumes and lotions. Is there any mask that prevents smells from entering her nose? Or would mouth only breathing prevent an attack? Any information would be appreciated so that I could help my friend. Thank you.","like_count":"0","tags":["Living & Managing","Triggers"]},"responses":[{"author":"tiff121979","resp_time":"over 2 years ago","resp_title":"RE: trigger prevention","resp_content":"Hello! Smells are also one of my triggers. I personally use this mask https://www.amazon.com/gp/product/B007Q35I1U/ref=oh_aui_search_detailpage?ie=UTF8&;psc=1 and it works wonderfully for me. Hope this helps!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/7957/trigger-prevention"},{"post":{"author":"sevensixtytorr","post_time":"over 2 years ago","post_title":"Can spirometer tests be inaccurate?","post_content":"I took a spirometer test last week to see if I have asthma from having bronchitis a couple of times when I was younger, and the results came back at my lung function is 62%. She said it was a low number and I do, but it's \"controlled\". The nurse that gave the test seemed pretty careless and I didn't understand as she kept changing her instructions and was pushing all kinds of buttons on the machine. She said to exhale as fast and as hard as I could within the beeps, but I didn't have enough within them and I was \"going too fast\", then \"not fast enough\". She got tired, printed off the results, and the doctor insisted I have asthma despite not needing an inhaler while active or sick, or being symptomatic in general for over three years and told me I need to give up on my military dreams. She sent me home with a prescription to some inhaler. Please help, she said \"you would know if you have asthma\", but I don't think I do and I don't want to give up just yet.","like_count":"0","tags":["Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/8780/can-spirometer-tests-be-inaccurate"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"Do You Know the Signs of an Asthma Attack?","post_content":"Coughing, wheezing, trouble breathing? Asthma attacks rarely happen without warning. Rate and track your asthma symptoms here for better asthma control: http://wb.md/2plS1j2\n\nJoin the conversation! How do you know when you’re about to have an asthma attack?","like_count":"0","tags":["Triggers","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/8433/do-you-know-the-signs-of-an-asthma-attack"},{"post":{"author":"TheresaP65816","post_time":"over 2 years ago","post_title":"Asthma Management","post_content":"I've had asthma for 27 years and been on a slew of medications. I've learned to live with symptoms no matter where or what I'm doing. Unfortunately it's become my normal and I'm just now wanting to put a stop to all my daily flare ups. I find it very hard to avoid triggers and medications only do so much for me. Anyone else feel in such a fog?","like_count":"2","tags":["Living & Managing","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/8096/asthma-management"},{"post":{"author":"jbstonewall","post_time":"over 2 years ago","post_title":"Flowers of sulfur taken internally","post_content":"I am Woking in the woods and Deet is Okay, but I read that sulfur will work if taken internally in 1/8 tsp doses. Is this okay to do?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/7977/flowers-of-sulfur-taken-internally"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"News Flash: Thunderstorms Can Trigger Asthma Flares","post_content":"Rain often helps people with allergies or allergic asthma by bringing pollen to the ground. But a new study says that's not necessarily the case with thunderstorms, which may actually trigger asthma outbreaks.\n\nClick here to read more: http://wb.md/2qwoRk9\n\nWe want to hear from you: What are your asthma triggers?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/7573/news-flash-thunderstorms-can-trigger-asthma-flares"},{"post":{"author":"shereehoffman","post_time":"over 3 years ago","post_title":"Best air purifiers for asthma and animal dander, etc","post_content":"My asthma dr says it would help for me to put an air purifier in my bedroom. I do have allergies to dust and dog dander. The higher the CADR ( clean air delivery rate ) the better. Also a HEPA filter. They are not cheap. My bedroom is about 400 sq feet. Does anyone have any experience with these or knowledge you can share. If I am going to spend this kind of money, I want the best one for me. Thanks. Sheree","like_count":"0","tags":["Treatment"]},"responses":[{"author":"skipadedodah","resp_time":"over 3 years ago","resp_title":"RE: Best air purifiers for asthma and animal dander, etc","resp_content":"I have had a few, after expensive filters and having a hard time finding filters I went really researched. I finally found the perfect one for me. I own a Honeywell Pure HEPA Round Air Purifier. Model 50150-N.\n\nMake sure to get the Dash N model. It has a lifetime filter that gets wrapped in a charcoal outer filter. I clean both with a shop vac in the garage.\n\nI had a problem where the plastic base broke after 6-7 years. I made calls and was put in touch with Kaz.com. I had to buy a new one, ($150ish) they shipped it, I put rage busted in box and shipped back. The refunded all but shipping.\n\nThe old an new filters had some color change, I was not getting everything out, but I was shocked how well it held up.\n\nOnly negatives, noise and light. I cover the dial at night with a wash cloth, it glows bright blue. The noise is considerable. At night I turn it to low and get white noise, in the morning I crank it to clean during the day. I can hear it 3 rooms away.\n\nGreat unit, costs very little in filters, I buy 4-5 boxes once a year of the outer filters. Vacuum them a few times and swap them out. Amazon sells some that are twice the size you need, and they are very easy to cut down.\n\nI hope this helps it really did help me.\n"},{"author":"researchin8ly","resp_time":"over 2 years ago","resp_title":"RE: Best air purifiers for asthma and animal dander, etc","resp_content":"Rainbow has a great little air purifier that uses water and releases negative ions. I saw it on www.myindoorairquality.com - you should be able to find somebody local I'm sure that sells them. We have the whole system and it works!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/3157/best-air-purifiers-for-asthma-and-animal-dander-etc"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Asthma flare ups","post_content":"I have had asthma for 10 years. It has been under control for most of these years until these past 2 years. It seems to be so much worse, frequent flare ups, trips to the Dr. I have the breathing tests which shows I do have some problems, but they say its not COPD. Never smoked. I actually lose my breath, which causes me to panic. I feel light headed a lot. I am tired all the time. I also have chronic rhinitis which adds to this equation. And have PVC'S OF my heart which makes me lost my breath too. I was wondering what the hell I can do to make myself have a normal day. I am overweight and working on it...","like_count":"0","tags":["Triggers","Treatment","Diagnosis","Tests"]},"responses":[{"author":"stormcloud123","resp_time":"over 3 years ago","resp_title":"RE: Asthma flare ups","resp_content":"Hope you feel better. I've been the same ways for years and years with bronchitis and out of breath with asthma. Do you live in a place where weather changes often?\n"},{"author":"skipadedodah","resp_time":"over 3 years ago","resp_title":"RE: Asthma flare ups","resp_content":"See a Pulminologist.\n"},{"author":"anita532","resp_time":"over 2 years ago","resp_title":"RE: Asthma flare ups","resp_content":"All those fancy schmancy tests are usually useless. If you are going through a puffer can in a week, you need a bronchoscopy. It will get rid of all the gunk built up inside you. I've been there, done that. Is it possible you are allergic to humidity? I have to make sure I get out of the shower as quickly as possible. Any humidity and I am in asthma. And our climate is extremely dry. Catch 22.\n"},{"author":"braveunicorn1","resp_time":"over 2 years ago","resp_title":"I so agree with what your saying. Since I've had my nose operation n tonsils taken out it's like my asthma has gotten worse than better. I go thru my blue pump quite regular I feel like I'm limited to doing things coz I run out of breath.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/2406/asthma-flare-ups"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"May is National Asthma Awareness Month","post_content":"Asthma affects more than 24.5 million Americans and is one of the most common long-term diseases of children. While there is no known cure for asthma, it can be controlled with regular monitoring, proper treatment and by avoiding \"asthma triggers.\"\n\nTake a look at asthma symptoms and treatment options, as well as the most common causes of asthma and what can trigger an attack: http://wb.md/2plvgxY","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/7199/may-is-national-asthma-awareness-month"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"News Flash: Nearly 600,000 Asthma Inhalers Recalled","post_content":"More than 590,000 albuterol inhalers are being recalled by GlaxoSmithKline because there could be problems with the delivery system.\n\nFind out if this recall affects you here: http://wb.md/2nZPutz","like_count":"1","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/6373/news-flash-nearly-600-000-asthma-inhalers-recalled"},{"post":{"author":"19jessica_davison","post_time":"over 3 years ago","post_title":"Do I Have Asthma?","post_content":"Hi, i'm jessica. I'm 16 years old and ever since about 2 years ago I've been having trouble breathing during exercise. Every time I exercise I begin to wheeze and it's embarrassing because everyone on my volleyball team can hear it and they think i'm dieing or something so they offer me a use of their inhalers, but of course I turn down their offer because it is unsanitary. Also, throughout the day I notice that the beds of my fingernails are purple and my hands feel very cold. please let me know if you think I should have an appointment or if it sounds like no big deal.","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"dorothylee1","resp_time":"over 3 years ago","resp_title":"RE: Do I Have Asthma?","resp_content":"have u got check out\n"},{"author":"srg1018","resp_time":"over 3 years ago","resp_title":"RE: Do I Have Asthma?","resp_content":"Asthma is a serious lung disease that can take your life. You need to go to your doctor right away.\n"},{"author":"katbird12","resp_time":"over 3 years ago","resp_title":"RE: Do I Have Asthma?","resp_content":"It is imperative that you see a doctor- breathing problems, such as asthma, can be life threatening. Start with your family doctor, but she may refer you to a specialist such as a pulmonologist or allergist. You can begin to feel better in a hurry- especially during exercise.\n1\n"},{"author":"whatever12222","resp_time":"over 3 years ago","resp_title":"RE: Do I Have Asthma?","resp_content":"You are describing asthma. It's stupid not to treat it; asthma is often very easy to manage.\n\nSomething else could be going on with your circulation, or you may actually not be getting enough oxygen. If something does ail your circulation you may be taking risks by exercising without getting it checked out.\n\nIf you have asthma it may also act up at other times, such as when you have a cold or the flu, even without your realizing it, and make you more vulnerable to secondary infection such as bronchitis and pneumonia.\n\nAsthma can be easily managed with inhaled medications.\n\nWhat are you asking us for instead of going to your doctor. Honestly!\n2\n"},{"author":"alpha1bair","resp_time":"over 3 years ago","resp_title":"You should see a pulmonologist, also ask them to test you for Alpha 1 antitrypsin deficiency. It is a genetic condition that can cause respiratory and liver problems. A simple blood test is all that is needed. You can also do it for free through the Alpha 1 Foundation, they will send you a test kit.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/3983/do-i-have-asthma"},{"post":{"author":"ritt89","post_time":"over 3 years ago","post_title":"Post Op Breathing complication","post_content":"Hello I am a 27 year old female. I had surgery one month ago to remove a osteochondroma in my left distal femur. They gave me two types of anesthesia, one was through my IV and they injected anesthesia in my left leg as well. The surgery was about 20 min but I woke up 3 1/2 hours later. Ever since my surgery I have been having shortness of breath, chest pressure, hurts a little when breathing. Since my surgery it's getting worse. I went to the hospital a few days ago. They did d dimer blood test to confirm if any blood clots but they said everything was clean. The doctor gave me Breo Elliptca inhaler to use 200/25 mcg for one month to help with my breathing. She said it's a post op complication that may have occurred. But I'm still having these issues especially more at night. Can someone help me figure out what this is and if I will get better ?","like_count":"0","tags":["Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/5278/post-op-breathing-complication"},{"post":{"author":"jacqline","post_time":"over 3 years ago","post_title":"Asthma and hospital admissions","post_content":"Hi, I am a 55 year old woman who has suffered asthma for 30 years, which means it was adult onset. My question is about being admitted to the hospital due to an acute asthma flare. This is the norm for me, rather than the exception. Once an asthma attack gets hold of me albuterol rescue inhalers don't work... I wheeze so loud you can hear it across the room. I also cough. Shortness of breath is terrifying. I am just done in, generally, and off I go to the ER. Invariably I am admitted because the neb treatments and mega doses of intravenous steroids given in the ER don't open my airways enough and my wheezing and overall illness continues. On average I spend 3 days in the hospital getting these treatments. I thought everyone with asthma went through this, but I came to understand that most asthmatics just go to the ER occasionally and they get fixed up and go home the same day. I don't know why my symptoms are so stubborn. The only good news is my attacks are much less frequent since giving away one of my cats. I was horribly allergic to her, but not particularly allergic to my older cat! But the real bugaboo is catching a cold. That's a guaranteed hospital stay, for me. Because of the phlegm and congestion my asthma turns into bronchitis, with yellow and greenish sputum.","like_count":"0","tags":[]},"responses":[{"author":"skipadedodah","resp_time":"over 3 years ago","resp_title":"RE: Asthma and hospital admissions","resp_content":"Been there... first if you have a pro-air rescue inhaler throw it. I never got rescued. Ventolin works better. Talk to your doc, or see a pulminologist. Get on a daily treatment of an inhaled steroid advair works. GET A NEBULIZER AT HOME!!! You can give yourself a treatment to avoid getting so bad you go directly to the ER\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/4153/asthma-and-hospital-admissions"},{"post":{"author":"skipadedodah","post_time":"over 3 years ago","post_title":"Bronchial Thermoplasty","post_content":"Today the doctor said I should consider Bronchial Thermoplasty has anybody had this procedure? Did it work for you? What was your experience?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/4310/bronchial-thermoplasty"},{"post":{"author":"ali822","post_time":"over 3 years ago","post_title":"severe shortness of breath","post_content":"hi\ni am 25 years old male with 6 years of smoking and also 6 years of working out(im in a good shape). i have a problem during last 6 days that scared me alot. i also live in canada which is really cold now.\ni havent slept because i woke up every time with shortness of breath. when i sit down it gets better but i cant sleep. i went to a doctor she said my heart and lung is ok with just checking the blood pressure and heart rate and she gave me a puffer (vertolin). when I use this it gets better immediately but i still have problems at night i wake up few hours after sleeping. i also have lots of egg white mocus but no ther symptoms. ive never had this kind of symptoms before so it scares me alot.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/3978/severe-shortness-of-breath"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Asthma medication alternative","post_content":"Hello, does anyone know an alternative to taking advair? Not another steroidal drug, but something Natural...homeopathic to replace it? Thanks","like_count":"1","tags":[]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Asthma medication alternative","resp_content":"Hi there! Thanks for posting. There are many natural asthma remedies believed to relieve asthma symptoms. However, there is limited evidence backing this notion. Furthermore, the effectiveness and safety of such remedies are unknown. To read more about natural asthma remedies, click here: http://wb.md/2iKN3fO\n\nThe article provides examples of natural asthma remedies such as: (1) Herbs and natural dietary supplements like magnesium, omega-3 fatty acids, and antioxidant supplements such as vitamin C and vitamin, but once again, there is no evidence on their effectiveness (2) Yoga, which includes breathing exercises found to reduce stress --a common asthma trigger (3) Diet (4) Acupuncture (5) Biofeedback. If you want to learn more about any of these natural asthma remedy possibilities, then click on the link provided above!\n\nBefore starting treatment of any kind, be sure to speak with your doctor! I hope you'll come back and let us know how you're doing soon :)\n1\n"},{"author":"testify2","resp_time":"over 3 years ago","resp_title":"Thank you. Im just tired of advair.I'll check it out.","resp_content":"1\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Asthma medication alternative","resp_content":"not homeopathic but I went from symbicort which had me throwing up every meal, low blood sugar, etc. awful side effects to taking asmanex and montelukast which have little to no side effects and I feel great. I went from a 60% lung function and am now within the 72 to 78% range.\n"},{"author":"testify2","resp_time":"over 3 years ago","resp_title":"I hope your breathing continues to get better. Mine is ok. God Bless","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/3064/asthma-medication-alternative"},{"post":{"author":"jeseii","post_time":"over 3 years ago","post_title":"Wheezing wheezing my lungs!","post_content":"Please help!\n\nI'm 26 and I've smoked for 6 years. It's been on and off and I averaged about 5 cigarettes a day.\n\nAbout 2-1/2 months ago, I came down with a really bad respiratory infection with wheezing when I exhaled sharply. My Doctor prescribed prednisone and albuterol to help. I was hacking out green phlegm constantly for about 2 weeks. The infection cleared up but the wheezing has remained since and it's been 2-1/2 months now.\nSometimes in the morning, I will cough out some grayish phlegm, sometimes it will appear greenish. I can still hear 'wheezing' when I exhale sharply. I also feel the need to clear my throat a few times throughout the day and when I try spitting out, it will appear clear with some white in it.\nI returned to my doctor three weeks ago and she said it can take longer for smokers to recover but how long is longer? She prescribed more prednisone from that visit.\nI haven't touched a cigarette since the infection and I don't intend to anymore.\nI'm terrified right now after reading about chronic bronchitis and COPD. Please, what are your thoughts on this? I'm freaking out!","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Wheezing wheezing my lungs!","resp_content":"Sometimes these chest infections take a long time to clear up. Took one of my friends the better part of a YEAR for it clear completely. See a pulminologist if it continues. Sorry to tell you though, smoking is only going to excerbate the problem. Also to smoke when your lungs/chest is in a really compromised state is really not smart. I highly suggest you get on the patch and hang up this habit for good. Well wishes.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/2257/wheezing-wheezing-my-lungs"},{"post":{"author":"belkit","post_time":"over 3 years ago","post_title":"Panic attacks caused by emphysema and asthma.","post_content":"I suffered in my youth from a social phobia and I used to get panic attacks when I had to deal with people, I could not carry on a normal working career and was put onto a disability pension. Through treatment I was able to overcome the panic attacks, which eventually stopped. Then in my 40's I contracted TB. I had been a heavy smoker. and the TB left me with Asthma and Emphysema. I have a problem with my breathing and am on various pumps and tablets.\nI find if I try to do too much or get upset I get very short of breathe. Now I am finding when that happens I start to panic and get a panic attack, which just makes things worse. Am I wrong in calling this a panic attack because shortness of breathe is not the result of the panic attack but the cause of the panic attack. When I mention this to health workers, they cant seem to see it as I do. Yet the panic is still the same, you feel that this time its it, you cant see that you will overcome this one. I have to be on my guard all the time because each one is worse. I have managed the last 10 years without all the shrinks and the heavy medication they had me on and I don't want to go back to that.","like_count":"1","tags":["Living & Managing","Triggers","Diagnosis"]},"responses":[{"author":"stormcloud123","resp_time":"over 3 years ago","resp_title":"RE: Panic attacks caused by emphysema and asthma.","resp_content":"I know how you feel about the anxiety. Last Friday I had a bad asthma attack and was having crazy anxiety after my breathing treatment. Today, I went to the dr and found out I had bronchitis. I didn't mention the anxiety because I know it's a side effect but I fell asleep hugging a stuffed animal I have to calm down. And listened to favorite chillmusic\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/2762/panic-attacks-caused-by-emphysema-and-asthma"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Was this prescription/diagnosis something I should address with a licensing body or disciplinary panel?","post_content":"Dear whomever may be interested,\n\nI went into a Doctor's office earlier today after about 5 days with a low grade fever (99.5 - 101.0), a cough that sometimes I indulged a bit to try to \"cough things up\" which probably contributed to some of the soreness/swelling, and a sore throat / headache. The last two of the five days, when I've sort of forced air out of my mouth, you hear a little rumbling, but not on a normal, shallower exhalation. I am a non-smoker adult male and live a fairly active lifestyle.\n\nThe doctor told me that the little rumbling which sounded to me like phlegm suggests that I have ASTHMA, that my bronchial tubes had become \"overstressed\", and the sound was due to the tubes having become swollen and touching each other on the sides, rather than a phlegm buildup. I was also diagnosed with a \"minor upper respiratory infection\".\n\nHere are my concerns: (1) I am under the impression that you need to have at least a little bit more real evidence to diagnose someone with asthma, which as far as I was aware is a chronic disease and to diagnose it requires lung tests, etc. Is this correct? (2) The doctor attempted to give me a package of BREO Ellipta which she recommended I take once a day and attempted to prescribe me a ZPak along with it.\n\nI diligently read up on this BREO Ellipta and found that this should apparently NEVER be prescribed for someone other than someone who either has asthma unmanageable with less potent medications or who has COPD, and that to prescribe a ZPak / azithromycin along with BREO is definitely contraindicated. Furthermore, I've found no support in favor of diagnosing ASTHMA, a chronic disease, in any way resembling what this Doctor did. Everything I've read has convinced me there is no way in hell this should ever have been provided to me and, unless I am gravely mistaken here, I am very glad I did not merely trust this Doctor and begin taking this medication. Infact, after easing up on trying to cough everything out my cough has significantly diminished after 6-8 hours.\n\nSo, my main question is, what would you recommend I do, is this something I should be reporting to someone? Are my assumptions correct?","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"stormcloud123","resp_time":"over 3 years ago","resp_title":"RE: Was this prescription/diagnosis something I should address with a licensing body or disciplinary panel?","resp_content":"If you feel that strongly about it, maybe you could report it anonymously or see an ENT since you feel you're not supported.\n"},{"author":"stormcloud123","resp_time":"over 3 years ago","resp_title":"RE: Was this prescription/diagnosis something I should address with a licensing body or disciplinary panel?","resp_content":"If you feel that strongly about it, maybe you could report it anonymously or see an ENT since you feel you're not supported.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/3039/was-this-prescription-diagnosis-something-i-should-address-with-a-licensing-body-or-disciplinary-panel"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"News Flash: 1 in 3 Adults Diagnosed as Asthmatic May Not Be","post_content":"Many adults who've been diagnosed with asthma may not actually have the respiratory disease, a new study suggests.\n\nFind out why here: http://wb.md/2iKGA4p\n\nWe want to hear from YOU! Have you ever been misdiagnosed?","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/3107/news-flash-1-in-3-adults-diagnosed-as-asthmatic-may-not-be"},{"post":{"author":"greatgateway","post_time":"over 3 years ago","post_title":"Asthma or not? Doctors aren't sure","post_content":"Things that point to asthma:\n\n- Short of breath\n- Tight chest\n- Night gasping\n- Had eczema and hayfever growing up.\n- Ventolin relieves symptoms immediately.\n\nThings that say it is not asthma:\n\n- Preventers not helping\n- Peak flow never drops and is very high. (640+)\n- No cough\n- No wheeze\n- Can vanish with small posture changes\n- Minimal family history, only in grandmother.\n- Contradictory symptoms such as a SLOW heart rate and difficulty INHALING.\n\nI am praying I do not have asthma as I have a phobia of chronic illness but I cannot deny the blue inhaler helps me. My pharmacist suggests the Ventolin relaxed chest muscles tended up from anxiety but I can't find anything backing this up.\n\nWhat is wrong with my body?! Please help!!","like_count":"0","tags":["Living & Managing","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Asthma or not? Doctors aren't sure","resp_content":"Sounds like anxiety. You might need meds and talk therapy. Don't go to a pharmacist. Doctors you can go to: Pulminologist (lung doctor) or Allergist and/or a Psychiatrist.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/2007/asthma-or-not-doctors-aren-t-sure"},{"post":{"author":"claregrey","post_time":"over 3 years ago","post_title":"Asthma resource and articles","post_content":"Hi all, I have had asthma for 11 years, had great difficulty geting my symptoms under control, am allergic to house dust mite. Enjoy reading about medical topics online. Came across this site which has several good articles about asthma: http://www.emedmd.com/content/asthma\nAm finally getting my asthma under control, but worry about the amount of inhaled steroid I am taking. Best wishes Clare","like_count":"1","tags":[]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Asthma resource and articles","resp_content":"Thanks for sharing!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/1803/asthma-resource-and-articles"},{"post":{"author":"barefootbeachgirl","post_time":"over 3 years ago","post_title":"My daughter in law","post_content":"She has severe asthma. Regularly gets sinus infections. Had allergy tests that said she was not allergic to cats. However, she has 2 cats and a hedge hog and lots of litter boxes etc in her apt. I believe this doesn't help her asthma. Am I wrong?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/1832/my-daughter-in-law"},{"post":{"author":"lue4028","post_time":"over 3 years ago","post_title":"Shortness of Breath Symptom","post_content":"I've been having shortness of breath for several years, but this year it's become more noticeable and uncomfortable. It started in high school, while I was running cross country. My first semester I never had difficulty breathing, but the next semester I noticed my breathing was holding me back. Gradually my times tapered off as the years progressed. After races it's took me many more minutes that my friends to regain my breath. I asked my doctor for an invalid but it didn't make running any easier. One time I broke my mile time by 2 minutes effortlessly but after the race started coughing up mucus. Another time, I was racing my brother, who was 10. I beat him at sprints, but he won when we raced a lap around the track. He asked me if I had really been trying. It was clear to me then that I was fighting against something that he wasn't, and it only affected me in longer races that required efficient, constant breathing. I learned not to fight it and to just slow down if it happened. But the Shortness of breath was only an issue during exercise. I stopped running competitively in college, and in my final year of college I noticed Shortness of breath while not exercising. Now after graduating, I have episodes where my Shortness of breath is making me feel like I can't get enough air, even when I'm sitting or lying down. So now it's gotten to the point where I can't ignore it like I did before. The hardest part is expelling air- it feels like I can't breathe out to make room for more air. Pressing something against my back offers some relief. So what do you think? Is this asthma?","like_count":"0","tags":[]},"responses":[{"author":"lue4028","resp_time":"over 3 years ago","resp_title":"RE: Shortness of Breath Symptom","resp_content":"I asked my doctor for an inhaler** not an invalid.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/1632/shortness-of-breath-symptom"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Uniquely Shaped Lungs","post_content":"I recently had a chest Xray after getting a respiratory illness, and although I am fine now, the doctor said that my lungs are shaped unusually.\n\nApparently most people's lungs are smaller at the top and get wider towards the bottom, whereas mine are largest at the top and taper narrower towards the bottom. Mine are symmetrical and not deformed, just shaped different.\n\nThe doctor said it wasn't a problem, but I want to know if this condition has a name. I can't find anything about differently shaped lungs on the internet.\n\nMy rib cage seems kind of small for my body, so maybe it is my rib cage being different that caused my lungs to take this shape. Any insight would be appreciated.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/1477/uniquely-shaped-lungs"},{"post":{"author":"butchiethecat","post_time":"over 3 years ago","post_title":"My brother has asthma & is 68 yrs.","post_content":"What should our house temperature be? I keep it at 65-68 in the winter & 72-74 in the summer. I like for the windows to be open when weather permits & it airs out the stuffiness inside. My brother keeps his room closed up at all times. But --- he goes out on the front porch & sits for long periods. I do have a cat & she is a buddy to him. She's very clean & gets baths.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/1448/my-brother-has-asthma-is-68-yrs"},{"post":{"author":"arghtastic","post_time":"over 3 years ago","post_title":"Why do I get stupid when O2 levels hit 97%?","post_content":"I have suffered from Asthma most of my life. Normally I'm fine, but I've found that when stress levels get high or I get a head cold, I need to keep a closer eye on things as my lung capacity tends to reduce noticeably.\n\nAs part of living and managing I've had an O2 meter for a few years; I've largely found O2 meters to be a completely inaccurate measure of asthma severity. But I have noticed a disturbing trend that no physician ever believes or understands:\n\nI get stupid when O2 levels hit 97%. (I recently found out my dad is the same way--the lower the O2 levels the stupider we get.) It's so constant and predictable that I can feel when I hit 97%. I no longer need an O2 meter to check.\n\nIs my body chemistry that unique or is this more common than any physican has ever led me to believe and does this indicate anything dangerous?","like_count":"0","tags":["Living & Managing","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Why do I get stupid when O2 levels hit 97%?","resp_content":"You're probably not stupid....97% is a completely normal O2 reading. You might be reading way into things.\n"},{"author":"arghtastic","resp_time":"over 3 years ago","resp_title":"As far as I know; down to 90% is \"normal\" but it certainly does not feel normal for me. I have a noticeably hard time focusing and solving complex problems at 97%. The lower I go, the worse I get. Every general practitioner I tell this looks at me like I'm a nutjob.","resp_content":"\nIt's such a different feeling that I can tell when I hit 97 or lower without the O2 meter with 100% accuracy.\n\nSo, no, I'm not reading into it. I feel awful at 97% and I always get told that it's fine; but it's not fine. I feel horrible.\n\nSo I ask again, is my body chemsistry that unique or do I have a lurking problem no one has found?\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Why do I get stupid when O2 levels hit 97%?","resp_content":"If you feel that way, and you are feeling as though you are entering into a diminished brain activity state because of your O2 level, then stop what you're doing and take long, deliberate breaths to regain a higher O2 level. Yoga/meditation is great for what you're experiencing because breathing is such an integral part of it. I wouldn't say you're a nut job and after all, perception is reality. So if you are feeling this way, and to be honest, there is no medical treatment for what you're experiencing, so honing a breathing regime/meditation regime will hopefully make a huge difference. Tell me how it goes!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/1284/why-do-i-get-stupid-when-o2-levels-hit-97"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"Newsflash: Many in U.S. Say 'No' to Scented Rooms and Products","post_content":"Fragranced products such as soaps, candles and air fresheners cause more than one-third of U.S. adults to suffer ill health effects, including headaches, dizziness and breathing difficulties.\n\nClick here to read more: http://wb.md/2f119UE\n\nTell us what you think of this news. What's your preference? Do you find that products with fragrances affect your breathing/asthma?\n\nTo join the conversation, be sure to log-in or sign up. We look forward to hearing from you!","like_count":"0","tags":["Triggers"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Newsflash: Many in U.S. Say 'No' to Scented Rooms and Products","resp_content":"Scents bother me so much and so severely that I had to leave hotel rooms and hotels depending on how heavily scented their cleaners are. Not all scents are this bad; typically anything that smells like (dead) flowers. Spice-scents (like cinnamon) are generally okay.\n\nIn general I'm totally miserable in the world at large; because too many people think bathing in cologne and perfume is an acceptable practice.\n\nI wish that things were a little bit different with all the scented products.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/1243/newsflash-many-in-u-s-say-no-to-scented-rooms-and-products"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"Newflash: Clean Home May Help Keep Kids' Asthma in Check","post_content":"Reducing indoor allergens and pollutants can help control children's asthma, reducing their need for medication, according to a new report from the American Academy of Pediatrics.\n\nClick here to read more: http://wb.md/2eb2Nl1\n\nDo you feel as though the cleanliness of your home affects your asthma?\n\nHere ( http://wb.md/2ekzDU5) are tips on how to asthma-proof your home.\n\nRemember, to reply to this post, sign in or sign up to be a WebMD member. Thanks!","like_count":"0","tags":["Living & Managing","Triggers"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/1235/newflash-clean-home-may-help-keep-kids-asthma-in-check"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Asthma Correlation","post_content":"Had read somewhere that researchers had been drawing a connection between asthma and G.E.R.D. but have not seen any recent articles. Has anyone seen any recent studies on this?","like_count":"0","tags":[]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Asthma Correlation","resp_content":"Hi there. Thanks for posting.\n\nGreat question! It says here ( http://wb.md/2eRHdpA) that people with asthma are twice as likely to have GERD as people who do not have asthma, especially those with treatment-resistant asthma.\n\nI found this news article on WebMD, which explains the link between GERD and asthma: http://wb.md/2dZHEz0 .\n\nI hope this helps!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/1207/asthma-correlation"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"Are you in prepared in case of an emergency?","post_content":"Hurricane Matthew is aiming for the U.S. this week. While you may or may not be affected by the upcoming storm, it's important to brush up on these tips to keep you and your family healthy: http://wb.md/2cTZqyk .\n\nFor someone who has asthma, their controller medications and quick-relief medications are crucial for them to live a healthy and normal life. Do you have all of your asthma medications and inhalers in an accessible place where you can grab them and go quickly?\n\nNote to Readers: If you want to join this conversation, sign in (or sign up to be a WebMD member). See the link in the upper right corner of this page. Thanks!","like_count":"0","tags":["Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/747/are-you-in-prepared-in-case-of-an-emergency"},{"post":{"author":"arc52","post_time":"over 3 years ago","post_title":"Allergy, asthma and immunology center","post_content":"hi! i'm an architecture student and currently working on a project proposal about allergy, asthma and immunology center. I just want to ask questions in order to improve my research. What are the latest trends in terms of facilities which asisst in the development of medication or treatment of patients with asthma, allergy or immunologic problems? And what are the facilities inside an allergy, asthma and immunology center?","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/415/allergy-asthma-and-immunology-center"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Asthma attacks too frequent lately","post_content":"Hi i am over 50 ..and i have asthma for the last 10 yrs. What i wanted to know is why are my asthma attacks happen only at night when i am sleeping. And i noticed with asthma comes skin problem which is itchy and irritating and my skin turns dry ..is there anyone here having the same problem as i am? Love to hear from you and how you overcome this problem. Thank you.","like_count":"1","tags":["Living & Managing","Triggers","Treatment"]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Asthma attacks too frequent lately","resp_content":"Hi there & thanks for posting :)\n\nAre you currently being treated for your asthma attacks that occur only at night? Asthma attacks that occur mostly at night are commonly related to a condition referred to as nocturnal asthma, which according to this article ( http://wb.md/2cmamHA) , can be caused by a multitude of things such as increased mucus or sinusitis, internal triggers, your sleep position, air conditioning, GERD, late phase response or hormones. Knowing the triggers of asthma attacks that occur at night and how to prevent them might help in decreasing the number of attacks you have in the future.\n\nAlso, have you ever consulted an allergist to see what you're allergic to that could be causing your itchy and irritated skin? What is causing both your asthma and your skin irritation might be related, and I think it is worth a shot to check this possibility out.\n\nUltimately, I suggest talking to a doctor about your symptoms! You owe it to yourself to have this recognized, diagnosed and treated.\n\nBe sure to come back and update us after you've spoken to a doctor.\n\nAs always, we're here for you.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/342/asthma-attacks-too-frequent-lately"},{"post":{"author":"brightstar500","post_time":"over 3 years ago","post_title":"Asthma again","post_content":"Hi to all,\n\nI went to docs monday as my asthma has flared up again 3 rd time this year i am bk on steriods which i hate they keep me awake at night and give me thrush i am a diabetic i cant see me taking them tomoz for these reasons.\n\nWhat can i do?\nI think i have 2 days left of them.\n\nDolphin500","like_count":"1","tags":["Treatment"]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Asthma again","resp_content":"Hi brightstar500. Have you communicated your symptoms to your doctor? If not, I highly suggest that you do. Your doctor might be able to prescribe a different treatment option that won't interfere with your other medical conditions or help you to manage your symptoms for the next 2 days.\n\nIt says here ( http://wb.md/2c4Z3SX ) that thrush is a rare side-effect of inhaled steroids. This article also says that rinsing the mouth, gargling after using the asthma inhaler, and using a spacer device with metered dose inhalers can help prevent these side effects. Thrush is easily treated with a prescription anti-fungal lozenge or rinse. I suggest asking your doctor if these preventative measures and treatment methods could help to manage your symptoms.\n\nPlease give us an update after you've spoken to your doctor.\n\nWe're here for you ((hugs)).\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/244/asthma-again"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"Can Vitamin D help to cut the risk of a severe asthma attack?","post_content":"Taking vitamin D supplements alongside asthma medication helps cut the risk of severe asthma attacks, according to a review of scientific studies.\n\nAs someone who was previously deficient in vitamin D and who also suffered asthma attacks regularly as a child, I am intrigued by these findings.\n\nWhat do you make of these findings?\n\nClick here to read more: http://wb.md/2c4PW3p","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/268/can-vitamin-d-help-to-cut-the-risk-of-a-severe-asthma-attack"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"How do you prevent an asthma attack?","post_content":"As most people with asthma know, preventing an attack before it happens is key in keeping your asthma under control. When I was a child, I suffered from severe asthma, which has since cleared up in my adulthood. Two of the first signs of an attack for me were tightness in my chest and a persistent wheeze. I knew then that I needed to start acting proactively so that I could prevent a full-blown asthma attack.\n\nHow do you prevent an attack?\n\nClick here for more information about how to prevent an asthma attack: http://wb.md/1Nn7diy","like_count":"0","tags":["Triggers"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/107/how-do-you-prevent-an-asthma-attack"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"Welcome to the Asthma Message Board!","post_content":"We are so excited to finally be able to share our new boards with you! Just a few housekeeping things to go over before you get started:\n\n- Bookmark this page so you can easily find us any time.\n\n- Make sure you check back frequently as conversations are always being added and expanded.\n\n- Head on over to your Message Board profile (just click on your account avatar in the top right corner of the page) to update your personal story and add a photo.\n\nDon’t see what you’re looking for?\n\n- Look through the tags at the top of the page to customize your view to only see posts that interest you.\n\n- When creating a post, choose a tag to add that most clicks with you. Using tags is encouraged but not required.\n\nLike what you see? Or need help? Send us an email at CommunityManagement@webmd.net","like_count":"0","tags":["Living & Managing","Triggers","Treatment","Diagnosis","Tests"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/asthma/86/welcome-to-the-asthma-message-board"}]