[{"post":{"author":"claudiapoz","post_time":"1 month ago","post_title":"I have HcV and have now been diagnosed w lymphoma (Pozbo/Pozitude here)","post_content":"From way back when 1997....anyone around ?\n\nI treated with \"combo\" back in 1998 ~ 2000 for HcV. Mono-interferon 12 months/relapsed in 2 weeks/went back on interferon w/ribiaviron for 12 months. And still undetected however I've just been diagnosed with lymphoma non-Hodgkins b cell low grade, stage 3. And the PET scan suggests as a cancerous growth on my thyroid. Biopsy in 2 days.\n\nCould my treatment for HcV have messed up my lymph nodes ?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/110503/i-have-hcv-and-have-now-been-diagnosed-w-lymphoma-pozbo-pozitude-here"},{"post":{"author":"Anonymous","post_time":"1 month ago","post_title":"Questioning how long Hep C remains contagious","post_content":"My elbow rubbed up against dried blood on a wall at work. I then went about my day but started to worry about touching the things that my elbow then touched like my desk. Should I somehow disinfect my desk now. I'm worried because I've already touched so many things that I'm freaking out about cleaning everything and about touching surfaces now that my arm might have rested upon.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/110193/questioning-how-long-hep-c-remains-contagious"},{"post":{"author":"Anonymous","post_time":"4 months ago","post_title":"\"Scare\"","post_content":"Just found out that I may have been in direct contact. How long do I need to wait for an accurate test result?","like_count":"0","tags":["Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/102779/scare"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Losing my hair","post_content":"My hair is falling out in clumps, which is devastating to me because how I've always prided myself on my hair. My hair length was always at the small of my back, flowing and very healthy and shiny. I've done some research and it's not looking too good in terms of treatment. Most people who have legitimately received treatment which resulted in significant hair growth had to shell out a lot of money and this just isn't in the cards for me. I am a recovering addict, a felon and unemployed. First off, is this normal to lose a lot of hair because of hepc meds? And is there anything I can do about it? It's making me feel absolutely horrible about myself and very unattractive. I don't even want my boyfriend to see me anymore and even have gone as far as asking him to break up with me.","like_count":"1","tags":["Treatments","Living & Managing","Symptoms","Diagnosis"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Losing my hair","resp_content":"I am so sorry that you are going through this. Did this begin shortly after starting to take your Hepatitis C medication? This article lists some of the possible side effects of different Hepatitis C medications: http://wb.md/2dkevxt (Hair loss is listed for some)\n\nIf you don't see the medication you are taking in the above list, you may wish to look it (and its possible side effects) up using our Drugs and Medications Center: http://wb.md/2dzAiPb\n\nHave you spoken with your doctor about your hair loss? He/She may have some ideas on what can help and if the level of hair loss you are experiencing could be directly related to your medications. You may want to ask about the possibility of things like switching your medication or changing your dosage.\n\nThere are also a number of other things that can cause hair loss and that you may wish to discuss with your doctor. This slideshow has information about possible causes of hair loss in women as well as some treatment options: http://wb.md/2dCYJhO\n\nI hope you'll check in soon and let us know how you are doing!\n"},{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Losing my hair","resp_content":"Interferon caused my hair to dramatically thin. It was also long, but I refused to cut it until I broke the vacuum cleaner and found hair stuck to the ceiling :) Once I cut it and stopped trying to pretend that nothing was happening, I felt a whole lot better. Nioxin hair produts, while expensive, made a big difference in how my hair looked and felt. After i stopped treatment, my hair came back so full that my poor hairdresser called it \"Supernatural\"! However, my biggest concern is not your hair loss, but your reaction to it. Simply put, you are not your hair. Your boyfriend isn't with your hair, he's YOUR boyfriend. Turning him away because of your ego is unkind to both of you. However, I was shocked to discover how upsetting I found my hair loss - completely unexpected. I finally realized that it was more about being vulnerable and ill - neither was something I was conscious of experiencing so acutely. It was never really my hair - it was being out of control. Once I figured that out, I stopped being so self-absorbed and able to be present for myself and others. If you need help dealing with this emotional state, please get yourself some support and help. There's no need to go as long as I did before getting some relief! And let the world - and your boyfriend - love you along the way.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Losing my hair","resp_content":"I am also facing the same problem. Any suggestion would be appreciated.\n\nThank you.\n1\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"I also facing the same problem couple of month ago but now I am tring few home remedies and it is just slow down a little.","resp_content":"You could check simple remedies here https://akclinics.org/blog/tips-for-getting-thick-strong-and-healthy-hair/ .\n"},{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Losing my hair","resp_content":"I did the treatments 4 times since 2000 lost most of my hair each time. It was upsetting the first time but then it gave me opportunity to try hairstyles I never would, even pixie cuts. Your hair will grow back.\nThe over the counter hair products for stopping hair loss don't really work well for this. Plus it's putting chemicals into your body that your liver has to process, not good.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/542/losing-my-hair"},{"post":{"author":"brandynorris","post_time":"over 1 year ago","post_title":"Liver Function Testing and Hepatitis","post_content":"i recently received the following lab tests, and no explanation except it could be hepatitis or liver disease. Can anyone tell me what these numbers mean and if they are dangerous?\nAlbumin 3.75\nProtein 7.5\nSGPT 60\nSGOT 100\nAlk Phos 157\nBilirubin 0.6\nBilirubin 0.17","like_count":"0","tags":["Treatments","Symptoms","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Liver Function Testing and Hepatitis","resp_content":"Make yourself an appointment with a gastroenterologist, he should be able to figure it out.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/54220/liver-function-testing-and-hepatitis"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"i can not get help for my hep c","post_content":"My insurance will not pay for hep c medication what else can i do","like_count":"0","tags":["Treatments","Prevention"]},"responses":[{"author":"didisgirls","resp_time":"over 1 year ago","resp_title":"RE: i can not get help for my hep c","resp_content":"Contact Patient Access Network Foundation 866-316-7263. This organization saved me !!\n"},{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: i can not get help for my hep c","resp_content":"There is often financial help through the manufacturer of the medication companies. You need to talk to your doctor about this they should be able to send you in the right direction.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/65139/i-can-not-get-help-for-my-hep-c"},{"post":{"author":"Anonymous","post_time":"11 months ago","post_title":"Hepatitis C","post_content":"Can I take the Hep B vaccine if I am positive for Hep c","like_count":"0","tags":["Treatments"]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Hepatitis C","resp_content":"You need to be vaccinated for Hep B. The sooner the better.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/89658/hepatitis-c"},{"post":{"author":"johnjohnsonson","post_time":"over 1 year ago","post_title":"Two different questions about tiny scratches and cuts.","post_content":"If i get a scratch the size of a non bleeding cat scratch (no actual bleeding, just mark left behind) do i need to worry if i touched someone? Also if i got a different cut that did bleed slightly, how long after a tiny cut (hours, days) such as that can i stop worrying about touching people?","like_count":"0","tags":["Prevention"]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Two different questions about tiny scratches and cuts.","resp_content":"Hepatitis C is only contagious through blood to blood contact. So if you have a non-bleeding scratch, you can't pass it. If you have a bleeding scratch it has to enter into another person through a bleeding cut, but you should keep a bandage on anything bleeding as a safety thing. Also if your cat scratches you and has blood on his claws I would imagine the cat can pass it to another person if it draws blood, but usually you don't bleed right away when your cat scratches you.\nHepatitis C is not contagious through body fluids and only through sex if there's blood involved.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/78410/two-different-questions-about-tiny-scratches-and-cuts"},{"post":{"author":"Anonymous","post_time":"11 months ago","post_title":"Hepatitis C","post_content":"I just found out today that 5 years ago the VA performed a test on me and it came back positive. I was Never made aware of this! No, I’ve never used intravenous drugs! Over the past couple years I’ve had some very strange & painful things happen. Several times I would get, what I call, an organ spasm. So bad that it swoll & inflated through &under my ribs. It lasts for about 5 minutes but it’s happened several times since. Is this a sign of or caused by the Hep C?? That I just heard about today. Even though, they knew it in 2015. I’m scared and am unsure what to do. I Do know something is Definitely Not Right! Would you please give me your instagrams to this?? Thank you","like_count":"0","tags":["Treatments","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/89666/hepatitis-c"},{"post":{"author":"cindyjo4me","post_time":"over 1 year ago","post_title":"ibuprofen use","post_content":"what can i take for my headaches my Dr said not to use ibuprofen because of my hep c?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/84743/ibuprofen-use"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Maybe scratched by an instrument, high anxiety","post_content":"Hello,\n\nI work at a dental office and while I was taking instruments out of the ultrasonic I felt a “scratch”of sort. I immediately took off my gloves, which I didn’t see any holes I saw redness and in three spots that I had felt the “scratch”. I didn’t see any blood I even squeezed the spots and nothing came out. I went through all the patients that had came in that morning and none had any reports of hiv or hepatitis of any kind. If they do report and blood borne disease we take extra precautions, and empty the ultrasonic spray it with cavicide and let it sit for three minutes, rinse, and refill . (But like I said this day there were no reported diseases) When I reported to my doctor all she had said was wash it out. NO REPORT WAS MADE! Because she said there was no risk patients. A few days later I did go get blood work and everything came back fine but it was too late for any antibiotics that would help. So In three months I am being tested again. My practitioner said my chances of contracting any thing was very low, and she thought I would be fine. ( maybe to help calm my nerves a bit . I still have lots of anxiety and it effects my everyday life. I am even considering getting out of the field or at least that office. Please any opinions on the risk of getting anything!","like_count":"0","tags":["Risk Factors","Prevention","Diagnosis"]},"responses":[{"author":"georgiagail","resp_time":"over 1 year ago","resp_title":"RE: Maybe scratched by an instrument, high anxiety","resp_content":"Your risk of getting anything are zero.\n\nGail\n"},{"author":"amandar1976","resp_time":"over 1 year ago","resp_title":"RE: Maybe scratched by an instrument, high anxiety","resp_content":"Wow, I can't believe that you'd act like this. You didn't even have a spot of blood or anything, why would you even be freaking out like this? You need out of the medical field completely since your extremely terrified of catching something. Idk how you even function in today's world with so many diseases. Stop being like this, yes things happen and people can catch diseases from others but you can't stay tormented from worrying about it when there basically maybe .1% chance out of a bazillion that you could have caught anything.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/54743/maybe-scratched-by-an-instrument-high-anxiety"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Hep B/C risk?","post_content":"Would it be possible to get an STD from masturbating with a used bra strap that had been left untouched in a drawer for a few weeks? The bra strap was one of those clear plastic ones (not cotton/nylon). I found it when I moved into my new apartment. I have read that some viruses like Hepatitis B and C can live on surfaces at room temperature for a long time. Do I need to get tested? I am really worried. Any advice would be much appreciated. I am really ashamed of this and have thrown the bra strap in the trash. I've never done anything like this before.","like_count":"0","tags":[]},"responses":[{"author":"amandar1976","resp_time":"over 1 year ago","resp_title":"RE: Hep B/C risk?","resp_content":"Is it just me or what but I'm not understanding just exactly what you could have done with a bra strap that you think could give you hep of any type. Can you explain a little better maybe l?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/68968/hep-b-c-risk"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Hep C","post_content":"I got sepsis 4 months ago, was diagnosed with hep c. Drs say its about 15 yrs old, which adds up. I have genotype 2, with cirrhosis. I see my dr fri to go over labs and treatment options. Im in chronic side pain always. My pcp says this shouldnt be painful. My liver and kidneys failed during septic shock. I know pain, this hurts. Im just looking for advice, and support from individuals that know more than I do. Feeling lost. Thanks in advance.","like_count":"1","tags":["Living & Managing","Symptoms","Diagnosis"]},"responses":[{"author":"jdpz71","resp_time":"over 2 years ago","resp_title":"RE: Hep C","resp_content":"I don't know why drs & nurses say that \"it shouldn't be painful\" or \"there's no way you have pain\" from your liver. Well BULL! Yes the actual organ the liver may not have nerves running those it but ALL AROUND that liver there's thousands if not millions of nerves in the abdomen. I believe the nerves get \" hyper\" & can & DO cause great discomfort. Your not crazy. Keep hollering until someone listens. Lyrica helps my pain. Good luck.\n"},{"author":"cntryboy6","resp_time":"over 1 year ago","resp_title":"RE: Hep C","resp_content":"Hey there. I had hep c for 10 years and never had symptoms either. I was cured 2 years ago but i found out it came back 4 months ago. My liver never fully recovered. I'm in constant pain now with alot of other symptoms going on. You're not crazy at all. This is serious stuff. I would get a new doc if he said that to me. Idk where you're located in the USA but I'm in Florida and the docs here are amazing. I would find a good g.i. doc and get the proper blood work done and then meet with him to go over the results. It's tough for someone like me to understand what those numbers mean so i asked alot of questions. The cure is very expensive. Hopefully you have great insurance that will help you. I wish you the best of luck getting the cure. If you ever need to talk please don't hesitate to message me. Have a great night\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/38446/hep-c"},{"post":{"author":"friggininspector","post_time":"over 1 year ago","post_title":"Hepatitis with Autoimmune disease","post_content":"Is hyperbaric treatment a reasonable treatment for Hep with Autoimmune Disease sufferers, or may hyperbaric treat stimulate the immune system...which worsen the patient condition? Thoughts?","like_count":"0","tags":["Treatments","Prevention"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/61427/hepatitis-with-autoimmune-disease"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Liver funcyion","post_content":"A recent liver function test showed serum phosphatase 133 - lab. top figure 130. Is 133 dangerous?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/61296/liver-funcyion"},{"post":{"author":"kenneltech","post_time":"over 1 year ago","post_title":"What does this test mean, and what does the result mean?","post_content":"I am getting ready to start that Harvoni, but they took some tests and I would really like to know what this one test means, and what the result means? Here it is:\n\nf low-intensity warfarin therapy with conventional-intensity warfarin therapy for long-term prevention of recurrent venous thromboembolism.\n\nThe result was: F 11.9 (h) which means high. Can somebody tell me what this is for, and what is high and if that is a problem?","like_count":"0","tags":["Treatments","Prevention","Diagnosis"]},"responses":[{"author":"kenneltech","resp_time":"over 1 year ago","resp_title":"RE: What does this test mean, and what does the result mean?","resp_content":"I forgot, the 11.9 is compared to the range they gave as 2.0-11.3sec. Hope that helps.\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: What does this test mean, and what does the result mean?","resp_content":"There are a lot of meds & otc drugs that can alter the Harvoni treatments. Happy your taking Harvoni, early congratulations on slaying the dragon.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/48961/what-does-this-test-mean-and-what-does-the-result-mean"},{"post":{"author":"ahmedzuhair","post_time":"over 1 year ago","post_title":"HCV","post_content":"Hello, I recently shaved using a disposable razor, unfortunately I didn’t know tge razor was used until It was too late. I used it lightly and I didn’t cause and cuts or blood spills, I’m worried about HCV now. What should I do?","like_count":"0","tags":["Risk Factors"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: HCV","resp_content":"If you start to show symptoms go to the doctor right away. But unless you show symptoms I wouldn't worry.\n1\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: HCV","resp_content":"If there was no obvious cuts then DON'T Sweat It.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/51562/hcv"},{"post":{"author":"crazytownbananapants","post_time":"over 1 year ago","post_title":"I don't have hep C but have a question","post_content":"I went to the doctor for what I thought was a simple STD test. Got a $90 bill and thought it was all good. And now I just got a $1,000 bill in the mail from the hospital my blood tests went to. Just the hep C test was over $700. Is this normal?","like_count":"2","tags":["Prevention"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/53519/i-don-t-have-hep-c-but-have-a-question"},{"post":{"author":"pmanghna","post_time":"over 2 years ago","post_title":"High GGT, Alkaline Phosphate and Cholestrol levels in health report","post_content":"Hi,\n\nI am posting this question on behalf of my mom. She recently had some blood work done and there were high levels of GGT, Alkaline Phosphate, Cholestrol and Barium in her blood. Below are the details:\n\nBarium - 32.9 µg/l\nGGT - 45.6 U/l\nAlkaline Phosphate - 128.6 U/l\nCholestrol -\nTOTAL CHOLESTEROL 261 mg/dl\nHDL CHOLESTEROL - 53 mg/dl\nLDL CHOLESTEROL 170 mg/dl\nTRIGLYCERIDES 208 mg/dl\nNON-HDL CHOLESTEROL 207.9 mg/dl\nTC/ HDL CHOLESTEROL RATIO 4.9\nLDL / HDL RATIO 3.2\nVLDL CHOLESTEROL 41.6 mg/dl\n\nShe is 50 yrs old, weighs about 149 pounds and her height is 5.3\".\n\nCould the high levels be an indication of some tumor in the bile duct or other liver problems?","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/48584/high-ggt-alkaline-phosphate-and-cholestrol-levels-in-health-report"},{"post":{"author":"amy2112","post_time":"over 2 years ago","post_title":"I have Chronic Hep C n have a question.","post_content":"A few years ago, I did the interferon shots treatment. After, my viral count was almost zero. I recently had a blood infection from contaminated water! After 105 fevers, my viral count was back up. Also, I believed once the shots were used, u couldn't use the pills for treatment. I'm in the \"Chronic\" stage with some liver damage now. I was happy to find I was wrong about the pills tho n am half way thru. However; my concern is last time I needed 3 white cell \"booster\" shots after the interferon shots. I received ONE. My insurance wouldn't allow the other two! I'm very afraid now, if I need those shots again, the stupid insurance won't help me. Any idea on if I'll require white cell shots like last time, after my pill treatment?? Thank you for any help u can give. I'm pretty worried honestly.","like_count":"2","tags":[]},"responses":[{"author":"partlysunny","resp_time":"over 2 years ago","resp_title":"RE: I have Chronic Hep C n have a question.","resp_content":"The medication you took the first time is an old and barbaric treatment compared to todays antivirals. You may have headache, nausea and be lethargic. Most aren't, I can't imagine you having such severe reaction to the newer antivirals but be sure to keep your doctor on his or her toes. I would think they'd want to do a blood test as soon as you began the meds and then periodiccally. You should be on the 8 or 12-week treatment of one pill a day unless you need ribavirin also since you are not a naive Hep C patient. Good luck at slaying the dragon. I really hope you have a much milder reaction to your current treatment and in the end you are clear. Stay strong.\n1\n"},{"author":"jdpz71","resp_time":"over 2 years ago","resp_title":"RE: I have Chronic Hep C n have a question.","resp_content":"During my time of taken pills & getting cured I became anemic. Soon after my last Harvoni I returned back to what's normal for me. I did receive a transplant November 12,2009 & was cured of hepc 5yrs later.\nI believe that you should bounce right back when your regimen is completed. Good Luck\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/38196/i-have-chronic-hep-c-n-have-a-question"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Hepatitis C exposure","post_content":"There was an accident at work. I wasnt hurt. The employee that was hurt, cut the artery in his wrist. I got his blood on my hands. I had fresh scratches on my hands. He told me he has hepatitis c and os an intravenous drug user. I have a few questions.\n1) how soon should o het tested for hep c and hiv?\n2) do i need to be tested more than once amd for how long?\n3) should i treat this as a workers comp case?\nI just dont know enough to make a decision. Ty","like_count":"0","tags":[]},"responses":[{"author":"georgiagail","resp_time":"over 2 years ago","resp_title":"RE: Hepatitis C exposure","resp_content":"Typically screening can be done at one month, followed by three months. However, keep in mind that unless your \"fresh scratches\" involve OPEN, BLEEDING wounds these are not likely to be \"open portals\" into your body and thus pose no risk for transmission for either of these viruses. Even fresh scratches seal quickly and once sealed they are not the entrances into the body required for transmission to occur.\n\nGail\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Hepatitis C exposure","resp_content":"Hepatita virala C (HVC) acuta reprezintă o boală infecțioasă acută, din grupul infecţiilor sangvine şi antroponoze, provocată de virusul hepatic C (VHC). Mecanismul de transmitere a infecției este parenteral. Hepatita virala C reprezintă o frecventă afecţiune cronică în lume. Hepatita virala C (HVC) acuta se caracterizează prin afectarea ficatului și a altor organe și sisteme (renale, endocrine, hematologice, dermatologice, neuro-musculare, articulare, oculare și salivare). poti citi mai multe in acest link: https://newsmed.ro/hepatita-virala-c-acuta-la-adult/\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/37817/hepatitis-c-exposure"},{"post":{"author":"abdulmoneim","post_time":"over 2 years ago","post_title":"Hapatitis c v","post_content":"I daigonised hcv antibodies positive.\nPcr quality nagative\nCould me be a source transefere virus c to another person?\nHave I tell doctor before any surgery?","like_count":"0","tags":[]},"responses":[{"author":"partlysunny","resp_time":"over 2 years ago","resp_title":"RE: Hapatitis c v","resp_content":"Yes, you can infect others. There are many medications now that can clear you. Yes to telling doctors and anyone who lives with you. They can become infected by using your razor, accidentally using or borrowing your toothbrush(yuck). There are numerous precautions that should be taken until you seek medication to clear the virus. I'd imagine no one else would be very happy about contracting a virus that has a prognosis that is grave. Take care of yourself and those around you. You may want to get a 2nd opinion on how to handle being a carrier. Take care.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/37823/hapatitis-c-v"},{"post":{"author":"9ayourbiz","post_time":"over 2 years ago","post_title":"Hep C Genotype 4 info","post_content":"Hello Everyone,\nI was diagnosed with Hep C Genotype 4 in 1995. I was told that I have a RARE EUROPEAN Strain. I then proceeded to ignore it until very recently.\nThe very 1st thing I learned was that Genotype 4is not RARE or a EUROPEAN STRAIN. its more prevalent in Egypt so calling it a RARE EGYPTIAN STRAIN would be more correct.\nWhat I find EXTREMELY PUZZLING is that I managed to contract anything considered RARE or EGYPTIAN since the reason I was exposed to Hep C was by being a Heroin addict of the most ordinary type. Nothing special or unique about me at all.\nIt reminds me of my cat. His name is Sausage and I adopted him and he brother Dude 2 years ago.\nDude is a grey Tabby and that's very common but Sausage is a Calico. A MALE Calico and that's very RARE indeed.\nOur vet says that in her 20 + years of experience Sausage is the first she has ever seen. That's pretty darn rare.\nAbout as unusual as Genotype 4 I think.\nIf anyone wants to know absolutely anything about Calico's or cats (of any color) then I'm your girl. I know A LOT about cats.\nBut... if ANYONE can tell me ANYTHING about Hep C Genotype 4 specifically I'd be very grateful. I know next to nothing about that.\nWell, THANKS for your time.\nSincerely,\nNina","like_count":"0","tags":["Treatments","Living & Managing","Symptoms","Diagnosis"]},"responses":[{"author":"arinilisa","resp_time":"over 2 years ago","resp_title":"RE: Hep C Genotype 4 info","resp_content":"I would believe if any information would help you with your researching of HEP C, you should read up about it in the Mayo Clinic Web Sight!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/34138/hep-c-genotype-4-info"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Got known Hepatitis C blood all over my hands","post_content":"My grandmother got hcv through a blood transfusion. She is blind, and was rummaging through a travel bag when she accidentally cut herself deep on a razor. I had to treat her wound and got blood all over my hands. I washed my hands with soap, but i kept on getting on my hands as I was treating her. I had forgotten that she had hep c, and didn't realize how hardy the virus was, and that it should be cleaned with bleach. I didn't use bleach until an hour later. Blood got over a significant area of my hand, and I had a torn cuticle on my finger. I'm not sure what all I've touched, or scratched, but I want to know how high of a risk I carry, and what steps I should follow from here on out, since i'm not sure where all I had touched.","like_count":"0","tags":["Risk Factors","Prevention"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/35148/got-known-hepatitis-c-blood-all-over-my-hands"},{"post":{"author":"tcaveras94","post_time":"over 2 years ago","post_title":"whats the risk of getting hiv or hep c if a small amount of blood got on your hand..i have no visible cuts but a little thing of peeled skin","post_content":"whats the risk of getting hiv or hep c if a small amount of blood got on your hand..i have no visible cuts but a little thing of peeled skin on my hand","like_count":"0","tags":[]},"responses":[{"author":"georgiagail","resp_time":"over 2 years ago","resp_title":"RE: whats the risk of getting hiv or hep c if a small amount of blood got on your hand..i have no visible cuts but a little thing of peeled skin","resp_content":"The risk is zero. Peeled skin is not an open portal into the body.\n\nGail\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/33844/whats-the-risk-of-getting-hiv-or-hep-c-if-a-small-amount-of-blood-got-on-your-hand-i-have-no-visible-cuts-but-a-little-thing-of-peeled-skin"},{"post":{"author":"1978z","post_time":"over 2 years ago","post_title":"Dental infection control concerns","post_content":"I was watching my son have a root canal and an assistant from another room took the 'filling paste' syringe and ran down the hall - obviously to another patient. She returned soon after and they replaced the applicator at the top of the syringe before applying the paste to my son's tooth. this is concerning enough and I wasn't quick enough to pull them up on it but did afterwards and the dentist admitted it was wrong and in response and to try to make me feel better he then went down the hall and argued with the other dentist (we are in China and I could not understand what they were saying) then came back and pulled up the other patient's information on the computer and explained to me this was a child & hence low risk. By this time I was in shock and could not believe what I was seeing and hearing. I am now concerned that they may have re-used lidocaine vials that are meant to be only for one patient. What if they used the same needle twice for one patient and invected the vial then used it on my son? What to test for and how long to wait? The clinic looked clean and everything that was re-usable looked like it was packaged as if it had been autoclaved. Four days post this he has a sore throat :(","like_count":"2","tags":["Risk Factors","Prevention","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/33543/dental-infection-control-concerns"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Jaundice and itching","post_content":"I don't have Hep C, but I thought someone in this group may have some knowledge about itching related to jaundice.\n\nI recently became jaundice because of a billiary obstruction. One of the symptoms I had was an intense, unrelenting itching everywhere. Once the obstruction was removed, my billirubin came down, the itching somewhat relented. Now, (5 days later), I'm having some issues with the itch. It's not as bad as it was, but it's still uncomfortable. Does anyone have any idea when the itching should stop completely?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/32664/jaundice-and-itching"},{"post":{"author":"nos1010","post_time":"over 2 years ago","post_title":"Hep b diagnosis","post_content":"Hello, I have a question about my hep b serology results. I was under the impression I have a chronic infection, I was told this around 6 years ago. I had a blood test done a couple of days ago and the results are confusing to me as they indicate that I am immune and that I have cleared a past infection.\n\nI’m wondering if the original diagnosis oh chronic hep b was incorrect, when I was diagnosed with chronic hep b I don’t think I had actually had hep long enough to clear it.\n\nI have also read that the body sometimes takes longer than the standard 6 months to clear.\n\nResults:\nHBsAg: negative\nHBsAb: 140 IU/L\nHBcAb: positive\n\n\nI have done research into the interpretation of\nThese results and I’m lead to believe that the presence of HBsAb and a negative HBsAg shows I am immune and that I cannot infect others with the disease, is this correct?\n\nMy doctor also said I was immune and that I likely cannot transmit the infection to another person. If this is so am I cured of the disease?\n\nOne last question, can a chronic hep b sufferer, have a positive HBsAb ? I thought this is only present when the body has created surface anti bodies and the disease has been recovered from, is this correct?\n\nThanks for reading, and help will be much appreciated.","like_count":"0","tags":["Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/32651/hep-b-diagnosis"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Jaundice confirmation","post_content":"Since,last 5-6 days , I am unable ,I was suffering from pain in abdomen near belly, my doctor asked to do sonography, sonography was totally normal , but still I am unable to eat ,even doctor give me longifene syrup ,and she said there may be jaundice, but my eyes and skin are not yellow , urine is only darker ,plzzz tell me it is jaundice or anything else","like_count":"0","tags":["Risk Factors","Treatments","Living & Managing","Prevention","Symptoms","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Jaundice confirmation","resp_content":"Did you ever find out what was going on? I'd go back to the doctor if you're still having pain. Hope you're feeling better!\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Jaundice confirmation","resp_content":"if u any doubts of HEP C contact me :\nhttp://www.millionpharma.com/sofosbuvir.php\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/9083/jaundice-confirmation"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Pharmacist did not change gloves between patients when administering flu shot.","post_content":"Hello,\n\nI just had my flu shot give to me and the pharmacist did not change her gloves between the prior patient and myself. Do I need to be tested for anything. Is this legal? Normal?\n\nThanks","like_count":"0","tags":["Risk Factors","Prevention","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Pharmacist did not change gloves between patients when administering flu shot.","resp_content":"As long as she changed needles I think you're fine.\n1\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Pharmacist did not change gloves between patients when administering flu shot.","resp_content":"check this HEP C Treatment Tablets\nhttp://www.millionpharma.us/\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/23321/pharmacist-did-not-change-gloves-between-patients-when-administering-flu-shot"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Hep C testing question","post_content":"Hello, there is a possibility i was exposed to hepatitis C five months ago involving needles. I was tested two weeks after possible exposure and came up negative, and i was recently tested again a few days ago (roughly 5 months after possible exposure) and I came back negative again. Is it safe to say I am in the clear? Does testing negative for Hep C mean theres a good chance i dont have A or B? Any insight is highly appreciated. I just want to quit worrying about this once and for all. Thank you.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Hep C testing question","resp_content":"Treatment of HEP C check this link and refer it\nhttp://www.millionpharma.com/sofosbuvir.php\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/30395/hep-c-testing-question"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Can Hep C be spread through sensory deprivation?","post_content":"Hello! This is my first post on here so I'm sorry if this is the wrong place for it. I recently had an exposure that I suppose could be considered \"high risk\" (stupidly tried cocaine at a party and used the same \"straw\" that someone else had used). I plan on getting tested but this incident only happened about a week ago and I know it can take up to three months for the virus to be detectable. I go to a sensory deprivation lounge about once a month just to relax in the water and clear my head. I'm curious, in the interim, while waiting for the window period to end so that I can go get tested, is it safe for me to use these sensory deprivation tanks? If I did happen to have hepatitis C would it be possible for me to transfer it to the next person that uses the tank after I do? They say that the water is filtered in between each client but I would feel terrible knowing that I got someone sick. Any insight would be greatly appreciated!","like_count":"0","tags":["Risk Factors","Prevention"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Can Hep C be spread through sensory deprivation?","resp_content":"I think the main way hep c is transmitted is contact with infected blood. Not sure exactly how a sensory deprivation tank works but from the sounds of it I'd think the risk is low unless you're bleeding in it.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/29515/can-hep-c-be-spread-through-sensory-deprivation"},{"post":{"author":"galaxy_86","post_time":"over 2 years ago","post_title":"Hcv from lancet pen,pls help","post_content":"One day i checked my glucose level at drug store,just to see if it is normal and this checking was performed with lancet pen and glucose ordinary meter.\nI can not remember if lady changed lancet and clean the outer part of lancet pen.\nI returned back to ask her it is procedure safe because maybe many people use this same glucose meter.\nShe said to me the lancet is new and she regulary clean lancet pen.\nI belive her that she really change lancet but\nCan i get hcv or hbv if she not clean lancet pen outer cap,because that pen touches my finger..\nIm sorry if i overreacting but it is possibile transsmision in that case,maybe outer lancet pen cap may contain dried blood from somebody previous me..\n\nPls tell me is this real situation or my anxiety drive me..\nSorry if my english not perfect..\nThanks","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/30228/hcv-from-lancet-pen-pls-help"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Hepatitis B - Should one be hospitalized?","post_content":"My wife was diagnosed with hepatitis B. Prior to diagnoses she had full body aches and we could not understand why. As she has visited rheumatologist in her blood test we saw AST = 850 ALT = 2200 and so we rushed her to check for hepatitis and the answer was positive.\n\nNow, because of high ALT and AST they have told her to be hospitalized to stay under observation of the doctors. And so she did. But as she stayed in the hospital they did not do much to her, they gave her strong painkillers for the body aches that she had for the last 3 weeks and persisted as she was in the hospital. And did some blood cleansing procedures. This lasted for the whole weekend and on Monday her ast and alt results were the same, and they said she should stay in the hospital, but we did not listen and she returned home, in a restful manner.\n\nThis was a week ago, but all this time she has been testing for ast and alt and it is increasing. At his moment it is AST = 1850 ALT = 3270. And so doctors call her to go to the hospital.\n\nBut no medication is given to her at all.\n\nSo I want a second and more opinion on how to deal with this situation. Mainly I am confused because from what I read on the internet it should not be so complicated, hepatitis B, if it is acute, should pass away with time. Does she really need to be hospitalized? Doctors claim that only reason why they say is that of high ast and alt, but they don't give her any medications. So what is the point?\n\nPlease help with good advise, I don't know what to think or do. I need her not to suffer from the time of hospitals, but at the same time, we don't want to risk of course. But at the same time, doctors don't say any more than what I described above, and it is just not logical for me.\n\nPlease advise.\n\n\nPrior to the discovery of high ALT and AST because of body aces she was given Ibuprofen painkillers.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/29745/hepatitis-b---should-one-be-hospitalized"},{"post":{"author":"***","post_time":"over 2 years ago","post_title":"Oral sex and hepatitis","post_content":"Hi its me again. . I would like to ask a few questions with regards to my exposure. .\n\nI gave a blowjob and had a deep open mouth kissing with a guy of unknown hepa status. .\n\nThe problem is i had a large mouth ulcer which wasnt bleeding at that time. . Am i at risk?. .\n\nPlease i want to know ur opinion thanks","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Oral sex and hepatitis","resp_content":"No, you should be fine. Hepatitis C, pretty much like HIV, is transmitted by four routes: From unprotected vaginal or anal sex, from infected mother to child at birth( or in utero), contaminated blood transfusions, and sharing needles. Oral sex can expose you to things like HPV infection and Herpes, but not a risk of HIV/Hep C. The biggest risk factors here are sharing needles and being transfused contaminated blood products.\n"},{"author":"***","resp_time":"over 2 years ago","resp_title":"Thanks maam/sir for the response. . But how about hepa b? . . Am i at risk also?.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/19176/oral-sex-and-hepatitis"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"Hepatitis C and Your Skin","post_content":"Hepatitis C affects your liver the most, but it can cause problems with other body parts, too, including your skin.\n\nIn fact, bumps, rashes, and itchy spots may be the first signs you notice of this infection.\n\nHere's what to look for: http://wb.md/2fISg3G\n\nHave you been diagnosed with hepatitis C? Did your skin show any signs?","like_count":"2","tags":["Symptoms"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Hepatitis C and Your Skin","resp_content":"I knew I had hep c when my skin and EYES took on a yellowy color. Also had abdominal pain. Thanks for passing along the link.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/27708/hepatitis-c-and-your-skin"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"help me my hepatitis profile.","post_content":"im a hepatitis b reactive, help me to understand my profile thanks !","like_count":"0","tags":[]},"responses":[{"author":"leo1938","resp_time":"over 2 years ago","resp_title":"RE: help me my hepatitis profile.","resp_content":"You have to have a bit more information before you can say if you have hepatitis B, or you are immune. Most people these days who are younger than 30 have had a series of hepatitis B immunizations...it is one of the first immunizations you get as a baby and if you were ever in the military, you have been immunized there also. Without knowing what your exact test results were, I cannot say that you do or do not have hepatitis B.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/25887/help-me-my-hepatitis-profile"},{"post":{"author":"dejace","post_time":"over 3 years ago","post_title":"Blood test","post_content":"I was recently in the hospital for kidney failure. The drs at the hospital took me off abunch of my they thought were hurting my kidneys. I went to my dr last week and she ordered blood tests. One of them was a Hepscreen, Chronic. The results came back reading HEPATITIS B, SURFACE AB, REACTIVE H. What exactly does that mean and do I have Hep B?\nThank you,\ndejace","like_count":"0","tags":["Risk Factors","Treatments","Prevention","Symptoms","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Blood test","resp_content":"Those words mean nothing unless you have a negative or positive next to it, look over the results again\n"},{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Blood test","resp_content":"Let's make it simple - call your primary HCP and ask THEM the question. Asking specific questions here can get you wonky info. And the response about + or - is great. Trying to interpret your own bloodwork takes practice, so as a newbie, don't do it!\n"},{"author":"leo1938","resp_time":"over 2 years ago","resp_title":"RE: Blood test","resp_content":"You have probably had a Hepatitis B immunization at some time in your life and this is a test confirming that you are immune, not infected.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/3173/blood-test"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"What You Should Know About Hepatitis C","post_content":"About 3.5 million Americans have hepatitis C, and 17,000 or so others get it each year. But how much do you know about how this disease is spread, who's most at risk, the symptoms to look for, and the treatments that are available?\n\nLearn the basics here: http://wb.md/2y6bz27","like_count":"0","tags":["Risk Factors","Treatments","Living & Managing","Prevention","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/26771/what-you-should-know-about-hepatitis-c"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Can I get Hepatitis C/HIV from prolonged nosebleed?","post_content":"Hello! I've had a recurring nosebleed (daily) that lasted 2-3 months. I've since done cauterisation. However, I realised that I've been picking at my nose on a daily basis, and it bled everyday. The nose picking happened randomly and my hands were definitely not cleaned or washed. Considering that it was daily for a couple of months, and bleeding everyday, what is the likelihood that I contract Hepatitis C and HIV through the wounds in my nose (from daily surfaces that my hands come into contact with like subway railings, public tables, toilets, etc.)?","like_count":"0","tags":["Risk Factors"]},"responses":[{"author":"georgiagail","resp_time":"over 2 years ago","resp_title":"RE: Can I get Hepatitis C/HIV from prolonged nosebleed?","resp_content":"Absolutely none from this scenario.\n\nGail\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/22132/can-i-get-hepatitis-c-hiv-from-prolonged-nosebleed"},{"post":{"author":"tescurious","post_time":"over 2 years ago","post_title":"Hepatitis?","post_content":"A 27 yr old friend from Madagascar just passed away after a 4 month sickness. It is known that she had hepatitis (not positive which one- I suspect B or C). She had severe weakness and vomiting and after having jaundice for 3 weeks she died- no doubt from liver damage. I lived in Madagascar for a year and am quite disappointed in the medical treatment, especially where she was located (Southern Madagascar- very poor). She has a 20 month old daughter and I am concerned that the child and the 5 family members that cared for her during this time may have had exposure. Should this be a concern? Should I inform them to be watchful for any signs? I do not want to loose another close friend of this family!","like_count":"0","tags":["Risk Factors","Treatments","Living & Managing","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/12833/hepatitis"},{"post":{"author":"pkl1949","post_time":"over 2 years ago","post_title":"Hepatitis C . can this be cured?","post_content":"During recent medical test, my test showed 0.9 on Hep C. As this is close to limiting value of 1 for medical test, i wish to take up a treatment to cure this high level. Is there a cure for Hep. C?","like_count":"0","tags":["Treatments"]},"responses":[{"author":"WebMD Addie","resp_time":"over 2 years ago","resp_title":"RE: Hepatitis C . can this be cured?","resp_content":"Hi pkl1949,\n\nThis article has some good information about hepatitis c treatment options: http://wb.md/2tKDUGk . Talking with your doctor about what treatment may be right for you would be a good place to start. I hope you'll check back in and let us know how you're doing!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/9749/hepatitis-c-can-this-be-cured"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Can Hep C clear on its own?","post_content":"I was diagnosed with Hep C 2 months ago and had a viral load at that time of 4.4 million. My genotyoe is 1a, but my liver panel has always been normal and I have no symptoms. I'm not scheduled to see the GI for two more weeks, but was wondering if it was at all possible that my body will clear itself of the virus on its own? Could it possibly be a mistake?","like_count":"0","tags":["Treatments","Symptoms","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Can Hep C clear on its own?","resp_content":"Some people go years without knowing that the have hepatitis c and have no symptoms. Did your doctor run any other tests to confirm your diagnosis?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/9206/can-hep-c-clear-on-its-own"},{"post":{"author":"bsticks","post_time":"over 2 years ago","post_title":"Understanding the Test Results","post_content":"My girlfriend last week called me in a grief stricken panic last week because she failed a medical for a job she was applying for. I was shocked to find out that she tested positive for Hepatitis B, which surprised me since she was given the vaccine at birth and so was I. Today she did the follow up hepatitis profile test and some of the test results were confusing to me. She has a few days before she will speak with her doctor to go over with her the results but to be supportive and also brace myself for the results I wanted to know whether the results mean she is in the acute stage (less than six months) where there is a good chance to beat it or if she is in the chronic stage (greater than six months).\n\nHBsAg - Reactive 1.112\nAHBs - Nonreactive .099\nHBeAg - Nonreactive .056\nAHBe - Reactive .114\nAHBc IgG - Reactive .085\nAHBc IgM - Nonreactive .099\n\nAny information about what these results could mean is very appreciated. We are both American but are currently overseas in a 3rd world environment where getting English speaking doctors is a bit of a challenge.","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Understanding the Test Results","resp_content":"Did you get an answer from the doctor on this? Hope your girlfriend is doing well!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/8968/understanding-the-test-results"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"News: New Combo Pill for Hepatitis C","post_content":"Some exciting news: \"A pill that contains three powerful antiviral drugs might offer a cure for many hepatitis C patients who have failed other treatments, researchers report.\"\n\nYou can read more about this combination pill and who it could help, here: http://wb.md/2rpkUvT\n\nAre you currently on antiviral drugs for hepatitis c?","like_count":"0","tags":["Treatments"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/8982/news-new-combo-pill-for-hepatitis-c"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Hepatitis B Test Results","post_content":"I recently donated blood to the American Red Cross and later received a letter telling me that I had tested reactive for hepatitis B core antibody (anti-HBc).\n\nThe results for all hepatitis B Virus Tests are as follows:\n\nHepatitis B Surface Antigen Test: Nonreactive\n\nHepatitis B Core Antibodies Test: Reactive\n\nHBV PCR: Negative\n\nThe letter said that additional tests were performed on my blood and show that I likely do not have HBV. It says that it may be a false reactive but also says they can not be sure in every case.\n\nI participate in no activity from the list that could have led to any sort of transmission, definitely haven't had any contact with others blood as far as I am aware. I also was born in the United States in 1996 so assume that I was vaccinated when I was a baby.\n\nIn short, the 8 pages they sent with information was very confusing and different websites tell you different things. Should I be concerned as to if I have HBV or not? What do my results mean? And I plan on meeting with my primary care doctor, is this necessary in my case?\n\nThanks.","like_count":"0","tags":["Prevention","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Hepatitis B Test Results","resp_content":"I'd keep your appointment with your primary just to confirm if it was in fact a false reactive and if treatment is needed.\n"},{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Hepatitis B Test Results","resp_content":"More than highly unlikely that you have any problem, but it never hurts to repeat the test. Many people have been exposed to the antigen, but don't become infected. If it was me, I'd repeat the test, but lose absolutely no sleep over it :)\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Hepatitis B Test Results","resp_content":"Can you share your results from the doctor? I recently donated blood and the Red Cross gave me the exact same results as above. I'm also getting a follow up test done with my primary doctor to confirm but would like to know if your results proved to be negative for hepatitis b.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/1515/hepatitis-b-test-results"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"Famous Faces With Hepatitis C","post_content":"From Steven Tyler to Naomi Judd, learn about some the famous folks with hepatitis c and how they continued to live and thrive after their diagnosis: http://wb.md/2qzxp99\n\nWere you surprised to see any of the famous faces in this slideshow?","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/8443/famous-faces-with-hepatitis-c"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Worried about possible infection. What type of doctor should I see?","post_content":"I'm worried that I may have been exposed to hepatitis C. I let my friends talk me into getting a piercing while on vacation and the place we had it done wasn't exactly the cleanest. I know it was stupid and believe me I regret it. I'm a 28 year old man in good health if that makes any difference. I haven't had any symptoms but I tend to worry and of course looked up all the things that could go wrong with a piercing. The possibility that I could have hepatitis C has me freaking out. What are the chances that I've been infected? Can I just go into my regular doctors office or what type of doctor should I see and are there tests that can be done if you don't have symptoms? Trying to stay calm here.","like_count":"1","tags":["Risk Factors","Diagnosis"]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Worried about possible infection. What type of doctor should I see?","resp_content":"Hi there and thanks for posting,\n\nI'm sorry to hear that you are worried about a possible hepatitis C diagnosis. But I am glad to hear that you are taking your health seriously and wanting to learn more about seeing a doctor.\n\nIt says here ( http://wb.md/2csQUqq) that hepatitis C is spread through the blood and bodily fluids, so getting a piercing with an infected needle could have caused transmission. I can't speak on the chances of you being infected, but I definitely suggest getting tested for the virus by a doctor.\n\nIt says here ( http://wb.md/2cuOSvx) that the following health professionals can diagnose hepatitis C: Family medicine physician, Internist, Pediatrician, Physician assistant, Nurse practitioner, Gynecologist, Gastroenterologist, Hepatologist, and an Infectious disease specialist.\n\nAccording to this resource ( http://wb.md/2d0ISKL) , most people don't immediately exhibit any signs or symptoms, which is why it is important to get tested.\n\nPlease be sure to come back and give us an update. We care about you and we are here for you.\n\n((Hugs))\n"},{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Worried about possible infection. What type of doctor should I see?","resp_content":"Step One - STOP WORRYING and STOP READING. Unlikely that you were infected from a single piercing. However, for your mental health more than anything, either ask your doc or a public health clinic to test for the virus. And stop letting your idiot friends talk you into any more piercings or tattoos. Neither will be attractive as you age :)\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/406/worried-about-possible-infection-what-type-of-doctor-should-i-see"},{"post":{"author":"ragman55","post_time":"over 3 years ago","post_title":"hep c info","post_content":"my hep c went active about two months ago what should i expect","like_count":"0","tags":["Living & Managing"]},"responses":[{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: hep c info","resp_content":"So much better for this to happen now than 20 years ago! Lots of treatment options these days and you may not need any treatment at all. There's no generic answer to your question because most people have no symptoms for 25-30 years and don't suffer any liver damage. Other people (sadly, like me) have the opposite experience, but end up healthy in the long run (happily, like me!) . Your doc can tell you more about the type of Hep C you have and that will indicate a great deal about treatment if you need it. Good luck and try not to see yourself in every unhappy story:) . Until then, eat well (carb-rich, dense protenin light diet), get decent sleep, rest if you feel fatigued, get exercise and take it one day at a time. This is NOT a death sentence!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/2961/hep-c-info"},{"post":{"author":"pi1956","post_time":"over 3 years ago","post_title":"Do I still have the Hepatitis bug, in me???","post_content":"I had hepatitis about 1975, I don't know if it was XY or Z.\nFirst I turned yellow, later my fingers and toes turned black, then later on, I started shedding the dead skin, like a snake, and survived.\nMy Wife is a nurse, I asked her if she had ever seen someone who's skin turned black, she replied only on dead people.\nI was trying to find out which type it was.\nRecently I heard that you are never clear of the disease, I had two kids since, could they have the bug it them.","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Do I still have the Hepatitis bug, in me???","resp_content":"Have you discussed this with your doctor? He/She may be best able to determine what type of hepatitis you had based on your medical history and a description of your symptoms.\n\nHere is an overview of hepatitis that you might find helpful to look through: http://wb.md/2eKqTZt It says that \"the symptoms of types A, B, and C may include fatigue, nausea, poor appetite, belly pain, a mild fever, or yellow skin or eyes (jaundice).\" The slideshow has more about how each type is spread (including risk to babies), more information about symptoms that you could compare to what you experienced, what puts you at risk, and how long it may live in your body.\n\nHope this helps!\n"},{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Do I still have the Hepatitis bug, in me???","resp_content":"There are multiple kinds of hepatitis and back then they couldn't tell one from the other...believe me because I was there. Never heard of this reaction from Hepatitis either. Many people permanently clear some of the types of hepatitis, other types are usually chronic. Simple answer, if you have insurance, have your doc check. If not, public health clinics will usually check for free. Most people our age have been checked for the virus over the years during checkups, so I wouldn't worry about yourself or the kids. If you were a risk, your wife would be raising the roof!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/956/do-i-still-have-the-hepatitis-bug-in-me"},{"post":{"author":"bill914","post_time":"over 3 years ago","post_title":"Positive Hep C person vomit in my mouth","post_content":"I just recently learned that a person whom accidentally projectile vomited and it had some had gotten into my mouth. Am I at risk? Really scared.","like_count":"0","tags":["Risk Factors"]},"responses":[{"author":"bill914","resp_time":"over 3 years ago","resp_title":"RE: Positive Hep C person vomit in my mouth","resp_content":"I also found out that the person may be HIV positive\n"},{"author":"georgiagail","resp_time":"over 3 years ago","resp_title":"No to either concerns.","resp_content":"\nGail\n"},{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Positive Hep C person vomit in my mouth","resp_content":"Your mouth is loaded with enzymes designed to kill just about anything, but I'd check with your doc in a couple of weeks, just to be sure. As a note, I had an AIDS patient vomit blood in my face and eyes without becoming infected, so I'd guess you're quite safe.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/2162/positive-hep-c-person-vomit-in-my-mouth"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"I have chronic liver disease and hepatitis b","post_content":"is chronic liver disease painful?","like_count":"0","tags":["Risk Factors","Treatments","Living & Managing","Prevention","Diagnosis"]},"responses":[{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: I have chronic liver disease and hepatitis b","resp_content":"In my experience, the answer is no, but you may feel kind of lousy. You've already been having this experience, so you know the answer to your question already. To feel as good as you can, eating a carb-rich, dense-protein light diet helps to maintain liver health. Lots of water, avoiding exhaustion and getting regular rest are also helpful. I have no symptoms at all with just a quarter of my liver as long as I don't push myself into overtiredness - every time I move, as an example :) If you have the chance to treat your virus, you'll definitely feel more energetic. Good luck\n\nPS - NO booze or ibuprofen and as few other meds as possible!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/2260/i-have-chronic-liver-disease-and-hepatitis-b"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Water sports/Urine play and Hepatitis C","post_content":"I'm aware that this type of sexual activity carries high risk for Gonorrhea/Chlamydia/Herpes/etc and very low (almost non-existant) for HIV.\n\nBut what about Hepatitis C? Considering no anal sex, just oral (man on man) and urine play (swallowing). How much of a risk does one one put themselves in for engaging in oral sex and water sports/urine play?\n\nand also.. according to US Department of Veteran affairs, virus particles (called HCV RNA) can be detected within 1-2 weeks. Does that mean if one get tested negative 3-4 weeks after potential exposure, that person is negative for Hep C?\n\nThanks","like_count":"0","tags":["Risk Factors"]},"responses":[{"author":"georgiagail","resp_time":"over 3 years ago","resp_title":"RE: Water sports/Urine play and Hepatitis C","resp_content":"Even assuming your partner is Hepatitis C positive, simply swallowing their urine would not transmit the virus to you. Like HIV, the virus for Hep C must be able to enter your bloodstream for transmission to occur. Simply swallowing urine (and this urine would need to contain the blood of a positive individual) would not transmit the virus to you.\n\nGail\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"Thank you. What about the window period for testing? Would a negative result after 3 weeks be sufficient enough?","resp_content":"Reply\ngeorgiagail\nover 3 years ago\nYes; although not all labs can do this testing. Some rely on the standard antibody testing with the recommendation to undergo this at 3 months post possible exposure.\n\nGail\nReply\nAnonymous\nover 3 years ago\nThank you\n"},{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Water sports/Urine play and Hepatitis C","resp_content":"I'd stick to asking this question of your doc. In my experience, I think there is only a small risk, but lightening does strike occasionally :) Ask your doc or call the local public health office for a better answer. Large medical centers, like University of California in San Francisco, have lots of info online that is probably more specific to your question. A phone call to your doc or one of the med centers with more expertise is a good place to start. Interesting question and I would be interested in the answer. I know that UCSF has an STD clinic that might be able to help you\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/3054/water-sports-urine-play-and-hepatitis-c"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Autoimmune Hepatitis","post_content":"My son was recently diagnosed with autoimmune hepatitis type 1. He is 14 years old and recently started medication (Prednisone & 6MP) which he has responded well to. He has really severe acne and I'm wondering if this is related to the meds or the AIH? He had acne before he started meds.\nAnyone else out there with a teenager with this diagnosis. It's so rare and I can't accept that this is his life forever.\nThanks","like_count":"0","tags":[]},"responses":[{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Autoimmune Hepatitis","resp_content":"The course of treatment sounds right and I don't know about the acne...sorry. But as for the rest of his life, I've seen amazing advances in treating HCV over the last 20 years and hope this will be true for your son as well. My strategy, learned over many years, was to approach each day as new because none of us can predict the future. Just think about how many times you've been wrong about just about everything in the past :) . Taking it one day at a time is the only way to handle the long run...if it turns out to BE long. If you can do this for yourself, it will be a tremendous gift for both yourself and, in particular, your son. It's hard to have hope when contemplating an endless grim future, so let it go. There are lots of resources available in communities and online for developing skills in this area. Wishing you lots of peaceful days -\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/3849/autoimmune-hepatitis"},{"post":{"author":"cajun13","post_time":"over 3 years ago","post_title":"Have strong symptoms of the hcv.","post_content":"I have been very fatigued, abdominal swelling, forgetfulness, and can't hardly eat anything. Just got all my test taken and stressing over the out come. Any help?","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Have strong symptoms of the hcv.","resp_content":"Those symptoms could mean a million things. Do not worry it usually isnt the worst case and if it was youd probably have worse symptoms\n"},{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Have strong symptoms of the hcv.","resp_content":"Yep - you can only do this one day at a time. It's the only way to get through something challenging like this. So many possible answers and just as many solutions, so do try to just hang in there until you get your results. I've been there and it took me a long time to understand that stressing and worrying are NOT activities or solutions :) . It just seems so natural, doesn't it? And also, if possible, it's good to stop planning your funeral already :) I know it's harder than I'm making it sound, but worrying won't fix anything and will definitely add more to your body to deal with. You are not in charge of the results and just waiting for more information. Could be as simple as a food you've become allergic to or something you were unwittingly exposed to. MIght be something worse, so conserving your energy for a future fight is also a good idea. Eat carbs because they are the easiest on your liver, light on the protein and lots of water, no booze. I'll send good thoughts and look forward to an update.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/4752/have-strong-symptoms-of-the-hcv"},{"post":{"author":"amberrrosexo","post_time":"over 3 years ago","post_title":"Hep c and fatty liver","post_content":"I have hep c and just had CT scan and showed I filtration of liver with fatty tissue..is that normal for hepc?","like_count":"0","tags":["Treatments","Prevention","Symptoms","Diagnosis"]},"responses":[{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: Hep c and fatty liver","resp_content":"Same here. Fatty liver is most often found in those who drink and those who have gained and lost a lot of weight. Not always found with Hep C. It didn't prevent me from clearing the virus however, so worry about something else :)\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/5596/hep-c-and-fatty-liver"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"WINES...HEALTHIEST,,WORST,,AND FACTUAL WHYS PLEASEEEE????","post_content":"WHITE OR RED WINE IN MODERATION,,AND WHY SPEC.??? HEALTHIEST..IF EITHER THT IS??? PL HELPPPPP","like_count":"1","tags":["Living & Managing"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: WINES...HEALTHIEST,,WORST,,AND FACTUAL WHYS PLEASEEEE????","resp_content":"REPLY POST\n"},{"author":"dogdame","resp_time":"over 2 years ago","resp_title":"RE: WINES...HEALTHIEST,,WORST,,AND FACTUAL WHYS PLEASEEEE????","resp_content":"With any kind of hepatitis, the two things to avoid ALTOGETHER is booze of any kind and ibuprofen, which is as liver toxic as booze. A sick liver is particularly susceptible to damage and you might as well pour acid on it with either booze or Motrin. You can probably get away with a little wine, but why poke the snake? If going without booze is a huge problem, then ( as someone who has been there), the problem isn't the Hep C, but the booze. Hopefully, you'll be smart and simply stay sober. I can say after 41 years, that the world is full of marvelous flavors and missing out on red or white wine is hardly a ripple. Good luck\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/5288/wines-healthiest-worst-and-factual-whys-pleaseeee"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Symptoms of Hep C","post_content":"I have noticed I have yellowing eyes, could this be related to Hep C? They look like this photo attached.","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"ddatl1","resp_time":"over 2 years ago","resp_title":"RE: Symptoms of Hep C","resp_content":"Yes -- yellow eyes can definitely be a symptom of Hep C. You should go to your doctor and get tested!\n1\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Symptoms of Hep C","resp_content":"No reason to jump to a self-diagnosis! This is almost always a symptom of some kind of liver disease, including Hepatitis A which is infectious. I'd head to an ER for a blood test to make sure you're not infecting anyone around you. If you don't have insurance, the public health office of nearly every city will check your blood for free. Yellow eyes at this level are an indication that your poor liver is working VERY hard, and I encourage you to get on it right away to protect the health of your liver and other internal organs. I encourage you to get this assessed ASAP (even ifyou have to call in sick to work because you should not be going into any public spaces without getting a diagnosis!), not only for your sake, but for the sake of everyone you come in contact with right now. There are lots of different reasons your liver could be chugging along, so please don't let your anxiety get in the way of immediate action. HepA will usually clear itself, but you are a danger to others.\nIn short - a message board is the WRONG place to be checking this out. Get going!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/6394/symptoms-of-hep-c"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"9 Tips for Living Well With Hepatitis C","post_content":"We’ve reached week 3 of Hepatitis Awareness Month. So far we’ve talked about the different types of hepatitis and taken a more in-depth look at hepatitis c.\n\nToday we’re going to talk about how to live the healthiest life possible when you have hepatitis c. From eating healthy for your liver to managing the side effects of hepatitis c treatments, find out how following these lifestyle tips can help you feel better and keep your condition under control: http://wb.md/2pGorUS","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/8069/9-tips-for-living-well-with-hepatitis-c"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"Get the Facts About Hepatitis C","post_content":"Last week for the start of Hepatitis Awareness Month we shared what you need to know about the different types of hepatitis. This week, we’re going to take a closer look at hepatitis C.\n\nAbout 3.5 million American have hepatitis C, and 17,000 or so others get it each year. If left untreated, this liver infection that’s caused by a virus can turn into lifelong liver disease.\n\nLearn more about the basics of hepatitis C here: http://wb.md/2qIN4Bf","like_count":"0","tags":["Risk Factors","Treatments","Living & Managing","Prevention","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/7780/get-the-facts-about-hepatitis-c"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"It’s Hepatitis Awareness Month. Here’s What You Need To Know","post_content":"Hepatitis is an inflammation of the liver that can be caused by drugs, alcohol use, or certain medical conditions. But in most cases, it’s caused by a virus. This is known as viral hepatitis, and the most common forms are hepatitis A, B, and C.\n\nFind out more about each type, what causes them, and what may put you at risk here: http://wb.md/2oQ3XaQ\n\nWhat do you want to know about hepatitis?","like_count":"0","tags":["Risk Factors","Treatments","Prevention","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/7481/it-s-hepatitis-awareness-month-here-s-what-you-need-to-know"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Hepatitis C Viral Load clarification","post_content":"I went through treatment with Harvoni last year and was cleared undetectable. We think I was reinfected by a razor blade I had used while infected. My viral load at onset of reinfection was 6.17 l 2 +, They thought it was maybe clearing as it was to low to get a genotype. 6 months later my test comes back even lower at 1.16 l 1+, they tell me again my body is clearing the virus and if In 6 months if it is the same or lower that is good enough and although it's not completely undetected it will not cause me further damage and unless I was in the medical profession it does not need to be treated. I am not sure what to think. Is this good enough and maybe not undetectable but still great news. I am not sure whether to be happy or cry thank you","like_count":"0","tags":["Risk Factors","Treatments","Living & Managing","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/6499/hepatitis-c-viral-load-clarification"},{"post":{"author":"Kazoomjw","post_time":"over 3 years ago","post_title":"HCV Genotype Drug Resistance Test","post_content":"I recently had the Mayo Clinic test for HCV drug resistance. It showed I am resistant to five of the new drugs. So is there any other treatment for me? I'm a 1A but was told I have a \"unique\" strain. My GI doctor said they don't have any other options for me and referred me to a large medical center.\nHas anyone else been told this?","like_count":"1","tags":["Treatments","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/6107/hcv-genotype-drug-resistance-test"},{"post":{"author":"nikki50","post_time":"over 3 years ago","post_title":"Hep C","post_content":"I was seeing somebody in 2015 that had Hep C didn't transfer any blood at all can you get Hep C from having sex.","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Hep C","resp_content":"Studies show a Hep C is NOT passed to others thru sexual intercourse. At the same time, condoms are recommended for couples where one partner has the hep C dx.\n\nFrom a personal standpoint, I can tell you that 7 years ago my husband of 27(at the time)yrs found out he had hep C after a physical for extra life insurance. He waited almost 2 weeks to tell me!\n\nWe were out of town for a dear friend's daughter's wedding. It was an amazing resort and I couldn't understand WHY my husband was behaving so strangely. Finally, the morning of the wedding, he decides to tell me. I was speechless. And devastated. And pissed. Why would you wait 2 weeks to tell me????\n\nHe had the letter he'd received from the insurance co in his bag. It basically said they regretted to inform they \"couldn't cover him due to his hepatitis status.\". I wanted to know if he'd seen a Dr, made an appt....what. The letter didn't say what type of hepatitis he had!! I was incredulous that someone so intelligent could be so incredibly stupid. And selfish.\n\nThe following Monday, I made sure we were at our PCP docs office first thing for testing. Mine came back negative, which I had a hard time believing. Why? I remembered when we first got together we pricked our fingers, pressed the fingers together & made some sort of corny promise to each other. Our sex life was.....passionate. We'd lived together already 20 plus years. I know I'd borrowed his razer and prob even his toothbrush a time or two.\n\nI cried and mourned the death of such a wonderful sex life. I mean, we still \"do\" it but something definitely changed for me. I could wrote a book. Anyway. So far I've turned up negative so that should make you feel better. Same time, why haven't you been tested????\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/5211/hep-c"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"News Flash: Too Few Baby Boomers Getting Tested for Hepatitis C","post_content":"\"In 2013, the U.S. Preventive Services Task Force (USPSTF) advised all Americans born between 1945 and 1965 to get a one-time test for hepatitis C virus.\"\n\nBut despite these recommendations, a new study reveals that screening rates remain low.\n\nLearn more here: http://wb.md/2lZEZ7y\n\nDo you fall within the age range above? Have you been tested for hepatitis C?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/4992/news-flash-too-few-baby-boomers-getting-tested-for-hepatitis-c"},{"post":{"author":"buddynsoul","post_time":"over 3 years ago","post_title":"Adherence to medication","post_content":"Help us pilot a cool platform on adherence to medication.\nBuddy&Soul is a digital platform for personal development – a way of achieving all those great things you’ve always wanted for yourself. We offer courses where we help members deal with willpower, motivation, illness, relationships, etc.\nWe’re looking to pilot our content and get feedback from savvy users – if you’re interested in improving your adherence habits, we can give you free access to one of our courses “adherence to medication”.\nLimited time offer!\nhttps://goo.gl/forms/68MBjfJFjXgZ4KlX2","like_count":"0","tags":["Living & Managing","Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/4287/adherence-to-medication"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"News Flash: Newer Hepatitis C Drugs May Pose Health Risks","post_content":"\"Newer drugs to cure hepatitis C may put patients at risk for liver failure and other severe side effects, according to a new study from a U.S. nonprofit group that examines drug safety.\"\n\nFind out which drugs researcers identified and what these findings mean here: http://wb.md/2kyaB3Y\n\nWhat are your thoughts?","like_count":"0","tags":["Treatments"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/3266/news-flash-newer-hepatitis-c-drugs-may-pose-health-risks"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Myths and Facts About Hepatitis C","post_content":"How much do you really know about Hepatitis C? Separate myth from fact here: http://wb.md/2eldcPY\n\nDid any of these answers surprise you?\n\nSign in or sign up to join the conversation.","like_count":"0","tags":["Risk Factors","Treatments","Living & Managing","Prevention","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/1371/myths-and-facts-about-hepatitis-c"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"How safe are tattoos?","post_content":"How much do I need to worry about getting hepatitis c from a tattoo parlor? I want a tattoo but my girlfriend isn't too happy with the idea and has been bringing up everything that can go wrong. Anything I can share with her to kind of dissolve her fears?","like_count":"0","tags":["Risk Factors","Prevention"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: How safe are tattoos?","resp_content":"Here is a slideshow that outlines some of the problems that can happen when getting a tattoo: http://wb.md/2emupqh As the slideshow says, if a tattoo needle wasn't cleaned well between uses, \"you could be exposed to diseases spread by blood, like hepatitis B or C, tetanus, or HIV.\" The slideshow gives some tips about precautions you can take to avoid possible tattoo complications.\n\nThis slideshow about tattoo safety has some more really great information on how to choose a tattoo studio and what you need to know before getting a tattoo: http://wb.md/2dRsp75 Hope this helps!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/929/how-safe-are-tattoos"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Hepatitis: What Puts You At Risk?","post_content":"Wondering how hepatitis is spread and what precautions you should be taking? Take a look at this slideshow: http://wb.md/2eaQMBU\n\nSign in (or sign up to become a WebMD member -- see link in the upper right corner of this page) and share your thoughts.","like_count":"0","tags":["Risk Factors","Living & Managing","Prevention"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/869/hepatitis-what-puts-you-at-risk"},{"post":{"author":"darlingdaisy","post_time":"over 3 years ago","post_title":"Hep C transmission from female to male","post_content":"Hey everyone. I have hepatitis C and I am usually very safe when I engage in sex. This guy I am dating wants to have unprotected sex. He knows that I have hepatitis C but says that the chances of a female transmitting Hep C to a male is very unlikely. He also said that the transmission through sexual intercourse is low as a whole, even showing me research on the subject. Is this actually true or just some self-serving propaganda he's showing me? I've never had unprotected sex since I've been diagnosed and I don't want to put him at risk but he's very persistent and convincing.","like_count":"1","tags":["Risk Factors","Prevention"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Hep C transmission from female to male","resp_content":"I mean, is it rare? Maybe. But is it possible? Yes. Wouldn't take that risk if I were him...\n1\n"},{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Hep C transmission from female to male","resp_content":"Hi darlingdaisy, Thanks for posting! I think that you may find this article about protecting others from Hepatitis C very helpful: http://wb.md/2d13rH9 It talks about how hepatitis C is and isn't spread and has a section about having sex when you have hepatitis C.\n\nThe above article does say, \"Hepatitis C can spread through sexual intercourse, but it's rare. And it's extremely rare among monogamous couples. In fact, the CDC considers the risk of sexual transmission between monogamous couples so low that it doesn't even recommend using condoms. Also, there's no evidence that hepatitis C is spread by oral sex.\"\n\nThis is something that you two will have to decide together, and sitting down to talk through your fears with him may be a good idea. It may also help to talk with your doctor about the possible risks of having unprotected sex and if there are additional precautions you and your boyfriend should consider.\n\nHope this information helps!\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/494/hep-c-transmission-from-female-to-male"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"What you need to know about Hepatitis C","post_content":"Whether you’ve recently been diagnosed, have had Hep C for years, are struggling with how to explain your diagnosis to others, or are in search of information for a loved one, this slideshow is a great resource to have on hand: http://www.webmd.com/hepatitis/future-with-hepatitis-c-14/slideshow-hepatitis-c-overview It takes you through what Hepatitis C is, how you get it, the symptoms, how it’s diagnosed and treated, and how to take care of yourself after you’ve been diagnosed.\n\nWhat else do you think everyone should know about Hepatitis C?","like_count":"1","tags":["Risk Factors","Treatments","Living & Managing","Prevention","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/120/what-you-need-to-know-about-hepatitis-c"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Welcome to the Hepatitis C Message Board","post_content":"We are so excited to be able to share our new boards with you!\n\nJust a few housekeeping things to go over before you get started:\n\n- Bookmark this page so you can easily find us any time\n\n- Make sure you check back frequently as conversations are always being added and expanded\n\n- Head on over to your Message Board profile (just click on your account avatar in the top right corner of the page) to update your personal story and add your photo\n\n- Don’t see what you’re looking for? Look through the tags at the top of the page to customize your view to only see posts that interest you\n\n- When creating a post, choose a tag to add that most clicks with you. (Using tags is encouraged but not required.)\n\n- Like what you see? Or need help? Send us an email at CommunityManagement@webmd.net","like_count":"2","tags":["Risk Factors","Treatments","Prevention","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/hepatitis-c/100/welcome-to-the-hepatitis-c-message-board"}]