[{"post":{"author":"misskerribabe","post_time":"1 month ago","post_title":"Congenital kidney disease","post_content":"I have had CKD for 31 years. I've had multiple stones, uti, kidney infections. I have controlled it well until 8 months ago. Both kidneys are 2.5 times normal size with extra ureters growing out the top. I now have a mass on my adrenal gland on my left kidney. I stay in constant pain. Been to a urologist since my bladder wall is too thick. My kidneys only allow me to dribble small amounts of urine at a time. I drink plenty of fluids but no out put. My PC doc isn't trying to help me get well. This is 8 solid months of being I'll and no end in sight. Lost my job n house from this.anyone have any suggestions I'd truly appreciate it.","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/110557/congenital-kidney-disease"},{"post":{"author":"wmh9680","post_time":"2 months ago","post_title":"flakes of deied blood in urine","post_content":"Hi, I had a total knee replacement in Jan of 2019 and after I could not pee for 5 or 6 weeks which really set my therapy back. They kept me in the hosp for 3 days and sent me home with a bag. Well I went back and forth to the Urologist a few times trying to get rid of the bag and I ended up with a bad UTI. Turned out the cough medicine I took every nite for my sinuses was working against my Tamosulin as I have had an enlarged prostate for quite a while and along with the anesthesia I could not pee for 5-6 weeks along with 2 trips to the ER.\n\nWell it is now a year latter and for a few days now I suddenly started having dried blood flakes in my urine. I had a a test done on my urine than showed some microscopic blood in my urine and I am going for a uroscan of my bladder Monday and they want to do a uroscopy on me. Could this flakes be from the infection that healed a year ago? It seems the last couple of days my urine has cleared up. Thanks PS I am a 69 yo male and feel great.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/108411/flakes-of-deied-blood-in-urine"},{"post":{"author":"Anonymous","post_time":"4 months ago","post_title":"How long can I wait to go to the doctor about a kidney stone?","post_content":"I don’t mind toughing it and and waiting for it to pass if that’s safe at this point. What worries me though is that I urinated out 2 chunks of something that wasn’t a kidney stone this morning. It looked like scar tissue and there was a teensy drop of blood on 1 of them. I’m a single 38 year old male who doesn’t smoke or drink, who rarely gets sick so I’ve never been to the doctor very much and have no insurance. And I can’t afford to be laid up in the hospital with a catheter insurance or not honestly.","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/103107/how-long-can-i-wait-to-go-to-the-doctor-about-a-kidney-stone"},{"post":{"author":"Anonymous","post_time":"7 months ago","post_title":"Is Alkaline Water Helpful.","post_content":"Some People suggest that Alkaline water is helpful for kidney and heart problem.\n\nIs it correct ?","like_count":"0","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[{"author":"mrscora01","resp_time":"7 months ago","resp_title":"RE: Is Alkaline Water Helpful.","resp_content":"No. It doesn't work the way the internet doctors theorize. The ph is changed when it goes through the acidic stomach and so it's no longer alkaline. It doesn't do anything except hydrate you. And if you have kidney problems you have to determine the proper amount of fluid so that you don't get accumulation and swelling.\n"},{"author":"gauravdd","resp_time":"6 months ago","resp_title":"If ph of body is changed by using alkaline water ..Is it creates a problem for ckd patients ?","resp_content":"Reply\ngauravdd\n6 months ago\nDo you have any idea about kidney diseases ?\nI want one help if you are able to do it then it will be very helpful for me !\n1\nReply\nmrscora01\n5 months ago\nI have had kidney disease since the 1970s. I've followed closely all technical breakthroughs/treatments and know about all stages of kidney disease. I was pre-dialysis for 25 years, spent one year on hemo dialysis (tried peritoneal dialysis but it didn't work for me for a variety of reasons) and am now 17 years post kidney transplant.\n\nI know a lot.\nReply\ngauravdd\n4 months ago\nI am.also on dialysis from last 5 month .\nDoctors suggest only transplant is the solution . Transplant takes time.And now the weather is cold .\nSometime I have problem for breathing also.is there any medicine or anything else which help me in breathing problem\n1\nReply\nmrscora01\n4 months ago\ngauravdd, if you are drinking too much, it will congest around your heart and lungs and make it difficult to breathe. Are you keeping within your dialysis fluid restrictions? Remember that anything that is liquid at room temperature (like ice cream or jello, or soup) is considered as part of your fluid count. And 'juicy' things like some fruits (grapes for example) will count as 'fluid' as well.\n"},{"author":"Anonymous","resp_time":"5 months ago","resp_title":"RE: Is Alkaline Water Helpful.","resp_content":"Alkaline water helps to restore pH balance by reducing acidity levels in the body. The following is a reference from American Society for Nutrition: \"The kidney serves to regulate pH, but if kidney function declines and other tissues catabolize (activity concerned with the breakdown of complex molecules (such as proteins or lipids) and the release of energy within the organism ) to maintain pH, then it is very probable that manipulating the diet to reduce the acid load could spare tissues and improve outcomes in chronic kidney disease. \" The following reference is from mayoclinic.org about Alkaline water & heart problems: \" Because alkaline water has a higher pH level than does plain tap water, proponents say that it can neutralize acid in your bloodstream. Some say that alkaline water can help prevent disease, such as cancer and heart disease.\"\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/97869/is-alkaline-water-helpful"},{"post":{"author":"jan3574","post_time":"6 months ago","post_title":"Im afraid that i have chronic kidney disease please help","post_content":"Hello 28 years old male here. I m scared to death so here are my symptoms: microscopic blood in urine, for 2 l of water i go pee around 8 times per day with amount of 250 ml, also i have unpleasant feeling down there, no exactly pain and not all the time. no other symptoms no night urinating","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Im afraid that i have chronic kidney disease please help","resp_content":"Contact dr.shebijr@gmail.com and tell him all you have to then you'll know what to do ok .\n"},{"author":"Anonymous","resp_time":"5 months ago","resp_title":"RE: Im afraid that i have chronic kidney disease please help","resp_content":"It's been about 27 days since you posted. How's it going now? Do you have a primary doctor? I'm not whether or not you live in the US but CKD (Chronic Kidney Disease) in the US has 1 of 2 causes, type 2 diabetes or high blood pressure - or both at the same time. There are other health problems that may also cause CKD. You may search on-line or let me know if you need me to list them. Meanwhile until you can see a doctor try and keep your blood sugar and blood pressure in check.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/99796/im-afraid-that-i-have-chronic-kidney-disease-please-help"},{"post":{"author":"kay0922","post_time":"5 months ago","post_title":"High Potassium","post_content":"I went to the DR yesterday for a pre op physical. I have stage 4 Kidney disease and have had Kidney disease for 50 years. She did a basic metabolic and my potassium was 5.6. I have never had a problem with potassium. She wants to recheck in 3 days after I hydrate more and watch my diet. Is this the safe thing to do and is there medication I can take? Karen","like_count":"0","tags":[]},"responses":[{"author":"llunam","resp_time":"5 months ago","resp_title":"RE: High Potassium","resp_content":"Honestly don't know if there is medication to decrease potassium, however by avoiding these foods you can also help decrease it.\n\n•Broccoli\n•Kale\n•Turnip greens\n•Collard greens\n•Bananas\n•Oranges\n•Cantaloupe\n•Honeydew\n•Apricots\n•Grapefruit\n•Some dried fruits such as prunes, raisins, and dates\n•Cooked spinach\n•Cooked broccoli\n•Potatoes\n•Sweet potatoes\n•Mushrooms\n•Peas\n•Cucumbers\n•Zucchini\n•Eggplant\n•Pumpkins\n•Peas, lima beans, black-eyed peas, and pinto beans\n\nHope this helps!\n"},{"author":"mrscora01","resp_time":"5 months ago","resp_title":"RE: High Potassium","resp_content":"There is something called K-xalate but it has it's own problems. You are better off cutting back on high potassium foods (the worst are citrus, tomatoes, high fiber things) and hydrate. See what happens in 3 days. It's very important that your potassium be normal for the surgery.\n"},{"author":"Anonymous","resp_time":"5 months ago","resp_title":"RE: High Potassium","resp_content":"Sounds like hyperkalemia. After 3 days after you hydrated and watched your diet did your potassium level improve? How was your surgery? May I ask what type of surgery it was for? Apparently it was Kidney related. Are you a prospect for dialysis ? Was your CKD (Chronic Kidney Disease) related to diabetes or high blood pressure?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/100076/high-potassium"},{"post":{"author":"Anonymous","post_time":"6 months ago","post_title":"mom with blood clot","post_content":"If a patient is having kidney surgery, can the doctor perform the surgery if the patient has a blood clot in their leg?","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: mom with blood clot","resp_content":"It will be better you dont try it... cos my grandma died when we did that for her....it was after everything the doctor explained this to us and it's already late.. but my mom had same thing...but we Contacted dr.shebijr@gmail.com and all iz settled ....you can also try ok.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/99065/mom-with-blood-clot"},{"post":{"author":"Anonymous","post_time":"6 months ago","post_title":"Prehospital glucagon","post_content":"I'm a paramedic and I've had difficulty on finding an answer to a question I have about prehospital use of glucagon in renal failure patients. I've had two renal failure patients whom were also diabetic. Both of these patients had bgl that registered as LOW on our glucometer. Both patients I was unable to obtain IV access so I used 1 mg glucagon IM. In both cases I did not get a discernable rise in bgl as both pt remained LOW on subsequent rechecks. Why is this?","like_count":"0","tags":["Kidney Failure"]},"responses":[{"author":"mrscora01","resp_time":"6 months ago","resp_title":"RE: Prehospital glucagon","resp_content":"Here's an interesting article that doesn't really answer your questions, but has some good points.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4470208/\n\nApparently, severe hypos are sometimes a side effect of CKD (chronic kidney disease) and have no apparent cause. The (apparently) becomes worse in diabetics. Additionally, I know (from personal experience) that the degredation of injected insulin in your system is somehow impaired with CKD. You get a lot more mileage out of your injection. So consequently, lows become more severe and difficult to manage. So if your CKD patient's low is in part due to too muchinsulin, it's going to be a while lot worse with the CKD.\n\nI also know that glucagon has other associated issues with kidneys, so it's possible that it's action is somehow impaired by a dysfunctional kidney.\n\nSorry, but overall I didn't really find anything specific to your question, so I think it's one of those 'perfect storms' kind of situations. Wish I could have been more help.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/99422/prehospital-glucagon"},{"post":{"author":"squirrel11","post_time":"6 months ago","post_title":"Quadruple Bypass after Kidney Donation","post_content":"A friend of mine needs a quadruple bypass after suffering a heart attack. He has had normal BP and is a very healthy 72 year old individual, otherwise. He donated a kidney to a family member 20 years ago, and has had no side effects or problems related to his donation. He is very worried about the possibility of kidney damage from surgery and having to go through dialysis. What are chances of permanent kidney damage? Anything informative someone can point me towards? Thank you.","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"6 months ago","resp_title":"RE: Quadruple Bypass after Kidney Donation","resp_content":"The odds of permanent damage to his kidneys after a bypass are minimal. His remaining kidney may take a bit of a hit, but the odds greatly favor that hewill come out fine\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/99207/quadruple-bypass-after-kidney-donation"},{"post":{"author":"helpmysister","post_time":"6 months ago","post_title":"Is Dialysis always needed when levels are below 6%","post_content":"My sister has had kidney failure for many years. For the past 10 years it was mostly around 18% functionality. Over the past year it has gone down to 5-6%. With that said, she feels perfectly fine. She has no water retention, no heart noise (I forgot the name of the noise they look for), has driven to from the Northwoods several times without issue, is not nauseous, no muscle cramps, vomiting or any of the other symptoms of kidney failure. Again - she feels fine.\n\nThey've been letting her be because why make her feel like crap if she feels fine. Well, the other day they decided she needed to start dialysis three times a week starting tomorrow. They're fitting her with a port today. Now she will feel like crap 6 days a week.\n\nIs it REALLY necessary for her to start dialysis if she has no symptoms? Aren't there other options? She lives in the Northwoods of Wisconsin (literally). So sadly I don't necessarily trust those doctors. Well, I don't trust any doctor who's going to make her feel sick when she doesn't now.\n\nThoughts, second opinions, ideas? Could any of her other medications cause problems, like the one she takes for gout or HBP? What about certain foods that I'm 'sure' she shouldn't be eating. What about pills she takes for helping her to absorb more calcium? Just love my sister a lot and want to make sure she's making the most sound decisions. Oh, let's not forget to mention that she's 63, about 5'7\", over 250 pounds and is very inactive. She also still has her period from month to month and should have a hysterectomy to relieve that problem since no treatment or D&C's have helped. So lots of blood loss from time to time. Could gall bladder issues cause anything? My mother and I both had 'sand like crystals' in our gall bladders, not stones.\n\nIt just seems that in this case there is another solution, or perhaps problem that is causing this.","like_count":"0","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[{"author":"mrscora01","resp_time":"6 months ago","resp_title":"RE: Is Dialysis always needed when levels are below 6%","resp_content":"The things you listed can be symptoms, but they aren't the real issues. She won't notice fluid accumulation on her chest, until she can't breathe. And she won't notice her high potassium (and I can pretty much guarantee it's high) until she has a heart attack. And she won't notice the calcium/phosphorus imbalance slowly destroying her bones until she suddenly breaks something.\n\nAnd since I've been there, I can tell you she's not feeling well. Her body has just gotten used to not having enough kidney function. Or hemoglobin (your kidneys help produce this - so she's anemic).\n\nOne little thing, a cold, a virus, an infection. And it could kill her becasue at that low level of kidney function her immune system is not working properly either. She's an accident or maybe even sudden death waiting to happen.\n\nSorry to be so blunt, but she needs to be on dialysis if she wants to live out the year. And it may be a bit tough the first few weeks to adjust, you can lead a good life. I adjusted and even felt well enough to go to Disneyworld for a week.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/98810/is-dialysis-always-needed-when-levels-are-below-6"},{"post":{"author":"Anonymous","post_time":"10 months ago","post_title":"Kidney stone surgery","post_content":"I was so afraid before my surgery (two large kidney stones, 13.9 mm each). Here is what to expect that might ease your mind- your prepped before surgery with an IV and the anesthesiologist gives you something to relax (I don’t remember anything until I woke up in recovery). Yes, a breathing tube is inserted during surgery but you won’t know it / you are on your stomach so that the surgeon can enter the kidney from your back so you may have some bruising from being moved during surgery / a second IV is done, and a Foley catheter is inserted to help you after surgery to urinate; does not hurt when removed / a drain is also place near incision for a day or so and removed before you go home, again removal does not hurt /I was in the Hospital for two days and walked within four hours with assistance / the leg compression machine used to prevent blood clots like a soothing “spa massage”, wonderful / it took me five-seven hours before I felt I had most of the pain medicine out of my system; and you are constantly monitored. Don’t be scared by the bleeding after the foley comes out; it is like a medium to heavy period and some pelvic pain but by day three-four up to day six after surgery back to normal / remember 4-6 weeks for recovery (this means no excursion, lifting, driving, though I drove short distance to store in a week or so) and your appetite getting back to normal- it was almost a week before a bowel movement / you will feel wobbly for at least two weeks then slowly start to feel more your self. Don’t rush recovery / don’t shower until your physician advises; it took me two weeks wearing a dressing and bird baths before I felt relaxed to shower but did not bend or lift for weeks- interior stitches still healing up to 4-6,weeks or more (each patient different). Before you are discharged a CT scan is done to make sure no stones left (only pain was going from gurney to CT scan table and back, technicians there to assist you). I want to thank the wonderful care of Vanderbilt Medical Center each step of the way during my pre op, surgery and post op care. SUp2C We will win this fight","like_count":"1","tags":["Kidney Stones","Kidney Cyst"]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Kidney stone surgery","resp_content":"I'm scheduled to go into hospital for a percutaneous nephrolithotomy in a month for a very large staghorn stone. Thank you for explaining the procedure from the patient's side.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/92664/kidney-stone-surgery"},{"post":{"author":"vickyb2010","post_time":"over 2 years ago","post_title":"Possible floating kidney?","post_content":"I have been having right upper quadrant pain and right flank pain. When standing I have a 'mass' on the right which I can move, I can feel it on the flank too. It's quite big-maybe the size of a pear and it feels smooth.\nIt isn't there when I lay down unless I'm on my left side.\nI've had a CT of abdomen, MRI (lay down) and an ultrasound. Nothing shows at all.\nMy urine output it normal but my bowels are unusual as I can go 3 days without going then I'll have to go every day for 4 days, I feel like it blocked by this mass then once it's got 'free' that's when I go for a fees consecutive days. Movements are normal colour, consistency etc and no blood.\nMy doctor told me a floating kidney where I'm describing it is utterly impossible as the kidneys are at the back.\nAny advice?","like_count":"0","tags":[]},"responses":[{"author":"vickyb2010","resp_time":"over 2 years ago","resp_title":"RE: Possible floating kidney?","resp_content":"Anyone?\n"},{"author":"Anonymous","resp_time":"6 months ago","resp_title":"Ask for doing ultrasound while you stand.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/7515/possible-floating-kidney"},{"post":{"author":"kmh1090","post_time":"7 months ago","post_title":"High potassium","post_content":"Hello. I am a 28 year old female. I went to an urgent care a few days ago for all over itching that had been lasting for about 4 weeks. They decided to do a comprehensive metabolic panel and was worried about my liver. Results only showed high Potassium and the doctor wants me to come in tomarrow for a retest. Could this be a sign of kidney problems. Everything else was normal on the blood test. TIA","like_count":"0","tags":["Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/97528/high-potassium"},{"post":{"author":"allwood59","post_time":"7 months ago","post_title":"Problem passing kidney stone.","post_content":"Is it dangerous for a kidney stone to remain in the ureter, not moving? There is no pain at present, but the 6mm stone has not moved in more than 30 days. Are there health risks to just leave it alone and let it pass on it's on time?","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/97369/problem-passing-kidney-stone"},{"post":{"author":"brittanyfr95","post_time":"7 months ago","post_title":"CKD inquiry","post_content":"I have CKD and ovarian cyst I have had the cyst over 5 years and am wondering am I able to get a hysterectomy and if so what would be the risk factors","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/97228/ckd-inquiry"},{"post":{"author":"Anonymous","post_time":"8 months ago","post_title":"24-hour urine test","post_content":"I have never had to do one, but have a sneaking suspicion my doctor might order one at my next clinic visit (too long of a story to relate here). I only have few questions:\n\n1. Does it HAVE to be refrigerated? There is NO. WAY. I am putting a jug of pee in the fridge where we keep our food and beverages. I am also not putting a cooler in the bathroom because a. no room for it and b. the cats would get into it.\n\n2. Can I do it over a weekend? Because I'm never taking a day off from work for this kind of nonsense again (last time was for a colonoscopy...never having one of THOSE again).\n\n3. How important is it to \"catch every single drop\", which is what I am reading in some on-line forums. As an older woman, I have some light bladder incontinence, for which I wear one of those light panty-liner thingies. Also, if the urge comes on me suddenly (and it can), I may not make it to the bathroom with the collection device and/or will probably go a little in my pants. So NO, I will never be able to \"collect every single drop\". And finally...\n\n4. Will anyone REALLY know if I didn't follow all of the above rules to the letter? Years ago I worked in an endocrinologist's office and I watched people bring in those big brown jugs. I then saw the nurses pouring off all but a normal urine specimen cup-full of all that; the rest of the collection was flushed.\n\nIn all honesty, I'm looking at this 24-hour thing with the skepticism I had in sophomore year biology, when the teacher said he COULD tell the difference between a 1st generation fruit fly and a 3rd. He couldn't - because all my flies died after the 2nd generation and I turned them in anyway and wrote a 5-page essay on the experiment. Got an A. My lab partner had the same issue and did the same thing; got a B+. I'm betting I could collect my pee for a WEEK and they wouldn't know the difference. Right?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/95431/24-hour-urine-test"},{"post":{"author":"caoimhemorris","post_time":"9 months ago","post_title":"Is it safe to donate blood?","post_content":"A month ago in April, I was admitted at a desperate time for drinking methanol and ethylene glycol (antifreeze) to get drunk which was cheaper than beer but to my mistake, cost me my kidney health. Luckily, I didn't go blind or suffer total kidney failure\n\nEven though my doctor says my kidney function seems normal, he admits that there could be underlying damage to my kidneys and other organs. Whenever I eat sugar or a protein meal like meat, beans, and even milk, I get pain at the back 30mins to 1 hour later along with pain in my chest near my heart. I never got this before I drank the toxic alcohols.\n\nI've also been getting random toe twiches of the small toe.\n\nIn regards to the original question, is it safe to donate blood? I dont' want to risk anemia but my doctor says it's fine.","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/93358/is-it-safe-to-donate-blood"},{"post":{"author":"akasparky","post_time":"9 months ago","post_title":"Kidney stones for 3 months","post_content":"How long can kidney stones stay? It’s been 3 months (March 1 to June 9)?","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/93070/kidney-stones-for-3-months"},{"post":{"author":"richgat","post_time":"over 1 year ago","post_title":"Creatine level 1.67. Bun 14.","post_content":"Just wondering if this is bad. Creatine 1.65. Bun 14. I had not been feeling well days leading up to my blood draw. So i had not eaten in 3 days. Was drinking ensure and water when i could.","like_count":"1","tags":["Kidney Disease"]},"responses":[{"author":"Anonymous","resp_time":"10 months ago","resp_title":"RE: Creatine level 1.67. Bun 14.","resp_content":"All I can tell you is what the recommended reference ranges are. For BUN, normal range is 6 - 24 mg/dl and creatinine is 0.50 - 1.10 mg/dl. There is also a ratio of the two that I'm not sure how they calculate. Using these reference ranges, your BUN would be \"normal\" and creatinine on the high side. But how high is \"too high\"; that you would need to ask your doctor.\n"},{"author":"AndyMike","resp_time":"10 months ago","resp_title":"RE: Creatine level 1.67. Bun 14.","resp_content":"My nephrologist always factors in the eGFR and the creatinine. My creatinine is always above 1.35 to 1.77 and my 3GFR is about 45 this has been consistant and therefore I have been classified as having Stage 3 chronic kidney disease ( ckd). I believe if your creatinine is high three times in a row, its considered kidney disease but I'd double check with my doc.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/56869/creatine-level-1-67-bun-14"},{"post":{"author":"christianscosby60","post_time":"over 2 years ago","post_title":"Painful Kidney Stones","post_content":"I too have suffered with reoccurring kidney stones for over 20 year currently on my 4th stone which I've been passing for more than 7 years and the pain is beyond words. Tried everything possible. I know it must be some combination of things which causes them to keep coming back. Someone must know something I can do to help with this. Anyone with any suggestions, please.","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"moreis","resp_time":"over 2 years ago","resp_title":"RE: Painful Kidney Stones","resp_content":"I used to have stones almost every 4,5 years.Now Iam on my 10th years,e no stones.I drink a lot of water,never drink coca cola, or dark drinks,or food with a lot of calcium,and I love tomatoes,but I never eat the seeds,less salt on my food .\nThis diet seems that is working for me!\n"},{"author":"jerryh102","resp_time":"10 months ago","resp_title":"RE: Painful Kidney Stones","resp_content":"Since cutting out just the one cup of coffee per day, ive been fine. Now its just a gallon of water per day and juice. Believe me, after having peed out big spiked stones, ill forget about the coffee!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/21793/painful-kidney-stones"},{"post":{"author":"meanmagee","post_time":"over 1 year ago","post_title":"Ureter stent causing pain","post_content":"I had a kidney stone taken out and a ureter stent put in. It's been 2 days and I am very uncomfortable and in pain from the stent. Will this go away soon? Im still peeing blood too and sometimes get little pieces of dried blood that come out.","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"olive996","resp_time":"over 1 year ago","resp_title":"RE: Ureter stent causing pain","resp_content":"Hi,\nAbout your stent causing you pain. I had to have a stent for 6 weeks due to enlarged ureter and reflux up into my kidney. The pain from my stent progressed from uncomfortable to intolerable. I was prescribed oxybutynin to control bladder spasms from the stent. The Dr thought she had prescribed tamsulosin but had not. She did, and that helped alot. Tamsulosin helps smooth out and relax the ureter and surrounding muscles. I also had hydrocodone 5/ acetaminophen 325 otherwise known as norco for pain. But when that stopped helping she prescribed keterolac which was amazingly helpful.\nThey tried to tell me I would be able to go back to work with the stent in. I told them there was no way as I am a pharmacy technician which is a fast paced job and I could barely walk to the bathroom. So I stayed off work and drank plenty of water. Heating pad helped me also but check with your Dr to be sure it's ok.\nI hope this information helps you. Oh, I peed blood the whole 6 weeks. The more water you drink, the less red it will be, but it's normal.\n"},{"author":"jessie47","resp_time":"11 months ago","resp_title":"RE: Ureter stent causing pain","resp_content":"That is not unusual for the stents, however, you should check with your Dr.\n"},{"author":"jerryh102","resp_time":"10 months ago","resp_title":"RE: Ureter stent causing pain","resp_content":"I've had stents in multiple times and this is fairly normal to experience. I did miss plenty of work when I've had them in due to being unable to walk. normally and just the overall pain.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/86083/ureter-stent-causing-pain"},{"post":{"author":"Anonymous","post_time":"10 months ago","post_title":"What does a nephrologist test for","post_content":"Have had two blood tests in last 3 weeks; in one, blood sodium level 125. Retested 3-weeks after stopping a BP diuretic med, now it's 124. ALL my other levels are normal; lipid panel especially good. BUN 15, creatinine 0.70, all within normal limits. Doctor wants to admit me to the hospital for a nephrology work-up. This sounds INSANE to me. When I googled it, the first thing that came up was they would check BUN and creatinine! OK, have had that tested TWICE and normal both times. Stopping the BP med took my BO from 116/68 to 168/99 in just 3 weeks time! Plus bloating, swelling of extremities (hands and feet plus both calves up to my knees). What else would a nephrologist DO in the damn HOSPITAL that I can't do at home?!","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/91921/what-does-a-nephrologist-test-for"},{"post":{"author":"gemini286","post_time":"over 2 years ago","post_title":"Kidney Function Test","post_content":"31 year old female, 5'4\" 135 pounds experiencing increased fatigue, random quick mid abdominal pains, none radiating lower sternum chest pressure which has not been helped by antacids. Went for a kidney function test creatine was at .70 and anion gap 8, urine clear. Three months later I had a follow up with another Dr after extreme muscle sorness after working out. Creatine was up to 1.2, Anion gap up to 21 and mod/high white blood cells in urine with no infection. Dr. Said it was fine despite the high numbers because my electrolytes were normal. My fatigue has gotten worse, slight cramping from time to time in right side and abdomin, not sore to any palpitations. Chest pressure has stayed constant...almost like a brick is placed on it. Should I get a second opinion or wait 6 months for the follow up? What could be causing normal electrolytes with high creatine, anion gap and white blood cells?\n\nThanks","like_count":"0","tags":["Kidney Stones","Kidney Cyst","Kidney Disease"]},"responses":[{"author":"Clelia1128","resp_time":"over 2 years ago","resp_title":"RE: Kidney Function Test","resp_content":"Talk to a nephrologist! They are kidney specialists. No general doctor will be good enough. Get the creatine under control!! or you'll be in trouble. I was on dialysis 4 years and had a kidney transplant 11 months ago. I had high bp and was overweight. Good luck!\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Kidney Function Test","resp_content":"I wouldn't panic with those numbers. The number you want to check is the eGFR. If you can't find it on your lab report you can go to the website Davita.com. There you can enter your creatinine and age to calculate your GFR. I doubt your symptoms are caused by chronic kidney disease because symptoms do not show up until the later stages. I wouldn't worry a whole lot about CKD unless your GFR drops to about 50. I wouldn't even freak out in that case. My number fluctuates between 30 and 40. You can't worry about these kinds of fluctuations, either. Your primary care physician can manager things until your GFR falls below 50. It's only then that you need to start seeing a nephrologist.\n\nThe worst thing you can do is look things up on the Internet, and try to match your symptoms with A particular disease. Like I said, my numbers can get pretty low and I really don't have any physical symptoms. Until you're in the 20s, you should stay calm. From looking at your creatinine level, you're not even close.\nGood luck.\n1\n"},{"author":"Anonymous","resp_time":"10 months ago","resp_title":"I went to the Davita website; based on my last 2 lab results (one was creatinine 0.70 and one was 0.58), my GFR is between 96 and 102; their DESCRIPTION of Stage 1 Kidney Disease is \"Healthy kidneys or kidney damage with normal or high GFR\". What is THAT supposed to mean???","resp_content":"Reply\nAnonymous\n10 months ago\nBTW I'm female, 58, non-African American, 5'5#, 215 lb. BUT there is nowhere to ENTER that information.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Kidney Function Test","resp_content":"One last thing to share. If you're really concerned about having CKD there are some simple dietary adjustments you can make. The first thing you absolutely have to do is virtually eliminate phosphorus consumption. One of the worst culprits are dark colored sodas. If you really need to have a soda now and then, drink a clear one like 7-Up, Gingerale or orange crush. You might also want to switch from cows milk to almond milk, eliminate things like yogurt and eat one ounce of cheese only occasionally. Peanut butter might seem to be a good source of protein but it's also high in phosphorus so don't consume more than one serving per week.\n\nThree other things you need to control are potassium, sodium and protein. Read labels before you purchase things. It's generally recommended to limit sodium to 2000 mg per day. Most labels don't have potassium content but in general if you limit \"white\" foods, that will help a lot.\n\nWhen you think about protein, you must consider eating meats that are more easily broken down. That means cutting back and red meat and eating more poultry and fish. Keep in mind all fish isn't the same so you still have to do some research. My dietitian has my protein limited to 50 to 60 g per day. Again, I highly recommend the DaVita website for all sorts of information about the disease and diet.\n\nThe bottom line is that if you're really concerned about having kidney disease there are things you can do now to either slow the progression or arrest it where it is. Loss of kidney function can't improve but you most certainly can maintain a level for quite some time. I've been hovering where I currently a.m. for the last 10 years.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/38090/kidney-function-test"},{"post":{"author":"originalfrisco","post_time":"10 months ago","post_title":"Complications after kidney biopsy","post_content":"I had a CT guided needle kidney biopsy this past Tuesday. I didn’t show any signs of blood in my urine or even a lot of soreness until 4 days after the procedure. This morning (Saturday) I noticed some blood after urinating (a couple of tiny clot-like drops) and the side containing my biopsied kidney is extremely sore. Has anyone experienced a delay in symptoms/complications after a biopsy?\n\nAs a side note, I have a blood clotting disorder and haven’t resumed taking my Plavix & aspirin as of yet.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/91665/complications-after-kidney-biopsy"},{"post":{"author":"leighhunt56","post_time":"11 months ago","post_title":"Pain behind right ribcage.","post_content":"I had some harsh vomiting today ,but a few hours ago i started having terrible pain coming from beneath my right lower rib area..could that been my kidney?","like_count":"0","tags":["Kidney Stones","Kidney Disease"]},"responses":[{"author":"mrscora01","resp_time":"11 months ago","resp_title":"RE: Pain behind right ribcage.","resp_content":"It could be a kidney stone, but it could also be all sorts of other things like gallstones/bladder stones or other stuff. If the pain doesn't go away, see a doctor.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/90229/pain-behind-right-ribcage"},{"post":{"author":"kay0922","post_time":"11 months ago","post_title":"Pth","post_content":"How high can PTH go with Kidney disease? What can be done for high PTH? Mine was 338 and i'm worried.","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"11 months ago","resp_title":"RE: Pth","resp_content":"The first line of defense is a specialized vitamin D (often called Rocaltrol or Calcitriol). If that fails to bring your PTH down, they can also remove part of your parathyroid to bring down the levels. It's a fairly common surgery - I know many people who have had it done. I'm currently well controlled on the calcitriol\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/89934/pth"},{"post":{"author":"fowlers93","post_time":"over 1 year ago","post_title":"Does anyone know what this means ? Kidney related","post_content":"Just been discharged from the hospital with a kidney infection I had iv antibiotics and a ultrasound on my discharge letter it says something I'm not quiet sure what it means does anyone know just really curious thanks tia\n\n( USS SHOWED PROMINENCE OF LOWER CALYX OF LEFT KIDNEY ) ???","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/88159/does-anyone-know-what-this-means-kidney-related"},{"post":{"author":"jkandalgaokar","post_time":"over 1 year ago","post_title":"Do I need dialysis?","post_content":"I was suddenly dignosed with CKD since January 2018 - everything was alright in December 2017. From January to August 2018, my creatinine steadily dropped with the help of a controlled diet and was 2.9 when I started accumulating fluid in my chest cavity. I was advised to go for a CABG which I did after which I needed dialysis as my urine output was NIL. After about 12 sessions of dialysis, my output reached a reasonable level and the creatinine started correcting. I was off dialysis for about 2 months. Unfortunately in November 2018, after a trip to a hill station, I started retaining fluid again, urine was clear and creatinine started climbing steadily and reached 7.0. I was asked to start dialysis again and have been on it for 2 months. My creatinine levels are 3.2 now and urine output above average. Water intake is low and over the past week, I’ve been having episodes that involve profuse sweating, nausea, black outs (that I don’t have any recollection of) and vomitting. Could I possibly be getting dehydrated? Is this an indication that I no longer need dialysis? Any help would be appreciated.","like_count":"0","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[{"author":"khicks1269","resp_time":"over 1 year ago","resp_title":"RE: Do I need dialysis?","resp_content":"What stage are you at? And do you know your GFR?\n"},{"author":"Mtnairmama","resp_time":"over 1 year ago","resp_title":"RE: Do I need dialysis?","resp_content":"You really need to talk with your nephrologist as your case is complicated.\n"},{"author":"mrscora01","resp_time":"over 1 year ago","resp_title":"RE: Do I need dialysis?","resp_content":"You need to have a long chat with your nephrologist and your dialysis team. Have they discussed with you if they think your kidney disease is chronic or acute (acute may go away). It is also possible given your symptoms that your dry weight needs to be adjusted. This is something you will need to keep a close eye on.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/80542/do-i-need-dialysis"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Renal agenesis","post_content":"I'm 15 and I was born with 1 kidney. I have an excuse of an immunity. I'm anemic and I don't absorb iron. My lungs suck so bad I feel lightheaded every time I step in the shower just because of the humidity. I can barely eat anything without feeling gross, but then again I have two bites and I'm full. I'm always tired, I can't remember when I last wasn't. My periods are like 3 weeks long and I have constant abdominal pain going on 3 years now. I'm on birth control 24/7 to eliminate my period but I guess it doesn't work?? I don't know what to do. I need help and everyone's given up on me.","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/84282/renal-agenesis"},{"post":{"author":"mickiejay","post_time":"over 1 year ago","post_title":"KIDNEY BIOPSY HELP PLEASE","post_content":"So I'm a 22 yr old female. I'm scheduled to have an kidney biopsy Wednesday the 13th and they told me I am supposed to watch the bleeding in my urine afterwards and that it should go away within a day but I think my period will come on either Tuesday night or that morning, how do I know if the bleeding is from my kidneys or my period? Can I still have the biopsy done if it comes on beforehand?","like_count":"0","tags":["Kidney Stones","Dialysis","Kidney Cyst","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/83721/kidney-biopsy-help-please"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Nephrytis","post_content":"I am now 88. Had Acute Nephrytis at age 13. Never appeared to have any problems until recently. Is there any connection to that and a recent weak urine stream","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"mrscora01","resp_time":"over 1 year ago","resp_title":"RE: Nephrytis","resp_content":"The weak urine stream could be do to many things including prostate (if you are a man). You'll need to check with your doctor about this. Also dehydration could do it.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/82481/nephrytis"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Cause for my illness","post_content":"I am a retired firefighter. Shortly after I retired I developed kidney disease. I am on dialysis now. I have not been given a reason for my disease. I was wondering if it could be related to my occupation.","like_count":"0","tags":["Kidney Failure"]},"responses":[{"author":"khicks1269","resp_time":"over 1 year ago","resp_title":"RE: Cause for my illness","resp_content":"Didn't your Nephrologist do a biopsy?\n"},{"author":"mrscora01","resp_time":"over 1 year ago","resp_title":"RE: Cause for my illness","resp_content":"Maybe. But then again, maybe not. There are a lot of kidney diseases (some only recently discovered) that don't have a known cause. Kidney disease is a fairly new area of study and they still don't know more than they do know.\n\nSorry, but for many of us, it's simply treat the symptoms you can in the ways that you can. And in a huge percentage of cases, finally getting to need dialysis is the end result.\n\nDo you have a potential donor and are you investigating kidney transplant? Believe me, it's way better than dialysis with a much longer life expectancy. I was on hemo for a year, tried PD, know people on home hemo, and am now 16 years post transplant. Feel free to ask me any questions.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/81527/cause-for-my-illness"},{"post":{"author":"foxxm","post_time":"over 1 year ago","post_title":"UTI with kidney infection with Proteinuria","post_content":"greetings,\n\nI'm a 40 something usually very healthy person, exercises regularly. 6 weeks ago I noticed some swelling on my leg, bruising, that seemed to go away after a while. Over the period of the next few weeks I got more swelling with some side pain. For 3-4 weeks I was going from Dr. to Dr. focusing on my leg swelling which nobody seemed to be able to figure out.\n\nAfter x-rays, multiple blood tests, etc. etc. cancer was seemingly ruled out. I took a break from one week with continual leg swelling and some back pain which I falsely attributed to exercise and yoga. I did notice very frequent urination during this time.\n\nI eventually went back to the Dr and I suggested a urine test because my original blood work had a high white blood count. Well, long story short, it seems that I might have had a low grade bladder infection for a year that eventually went into my kidneys causing edema of my right leg. I finished my course of antibiotics but because of the very late diagnosis which for the most part I arrived at on my own I fear I have now permanently damaged my kidneys. For 4 weeks I was walking around with an undiagnosed kidney infection. Now I have Proteinuria (foamy urine). My Creatinine levels were very high but still barely in range. My EGFR was above 60 which indicates relatively good filtration ability.\n\nMy question is, is the proteinuria common for a period of time after a pretty bad UTI and kidney infection? Does it go away? I am done with my antibiotics. Should I get more prescribed. I feel the majority of the symptoms have subsided with some minor swelling in my legs still. I frequently urinate with a lot of foam. How long should I wait before I begin to really worry?? any suggestions will be appreciated. Thank you","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/79537/uti-with-kidney-infection-with-proteinuria"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"grateful","post_content":"God is be really good to me in my life, before people said there is no cure for Herpes, but today many people have now believe that there is a cure FOR HERPES can be cured through Africans root and herbs, our great doctors have finally found the cure of Herpes, many have get cured with the help of a great spell caster known as Dr.usman he's the one of the great spell herbal doctor in Africa and he has the cure on this disease H.P.V/TYPE 4 TYPE 1 TYPE 8 AND TYPE 10. TYPE 913, human papilomavirus, genital warts, herpes, syphilis, cancer, hepatitis a b and c. high blood pressures, body disease, diabetics, epilepsy, HIV aids, pregnancy,ALS and parkinsons disease many difference kinds of diseases, last month he share is Herbal medicine in some medical hospital and now he is well recognize as one of the best spell caster in Africa, you don't have to be sad any more or share your tears any more on this disease when the cure have already be found. in 2009 the total number of people living with H.P.V was 13.8 million but today the total number is now 2.0 million, if you want to get in touch with him in private contact him on his whatsapp No.+2348064080208,or Email:dr.usmanspellcaster@gmail.com","like_count":"0","tags":["Kidney Stones","Dialysis","Kidney Cyst","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/79070/grateful"},{"post":{"author":"whitecloud1","post_time":"over 1 year ago","post_title":"In stage 3a kidney disease, on diuretics and diabetic","post_content":"I am in stage 3a kidney failure and diabetic, on diuretics. What can I expect next?","like_count":"0","tags":["Kidney Failure"]},"responses":[{"author":"mhilde2000","resp_time":"over 1 year ago","resp_title":"RE: In stage 3a kidney disease, on diuretics and diabetic","resp_content":"Are you a type 1 or type 2 diabetic? At stage 3A. You can do lots to manage it. So what are you doing to make sure it does not go to 3B and 4 etc? Are you working on managing your blood sugars for your diabetes because if they are managed. That in turn will most likely have a huge influence on what your blood and urine results are for your kidney function tests. Eating a good diet, as in a healthy balanced diet, that to me means low carb, medium fats, a bit higher protein. Low sodium, becareful of what you actually drink and how much. And you can stop your kidney disease from getting any worse.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/62993/in-stage-3a-kidney-disease-on-diuretics-and-diabetic"},{"post":{"author":"nevrgivup","post_time":"over 2 years ago","post_title":"Credible methods to help move stuck kidney stones","post_content":"I have a 4 mm stone stuck at the top of the ureter. My next MD appointment is in 3 weeks. In the interim I wish to do all I can to possibly get the KS unstuck.\nSo, I drink a lot of water each day. I see many articles and utube videos making claims for the effectiveness of drinking a daily mixture of fresh lemon juice mixed with olive oil, or combinations of herbs. etc.\nMost of these information sources come from outside of recognized professional settings.\nMy question is - are there any methods beyond hydration that have some possible effectiveness.\n\nJM\nBoston, MA","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"kindeystone101","resp_time":"over 2 years ago","resp_title":"RE: Credible methods to help move stuck kidney stones","resp_content":"Hey hopefully since it has been two weeks since you posted you will get this. My husband and I both suffer from kidney stones. He is the only one that has ever been to a kidney dr though, he started having them at 16 and he is 40 now and just passed his 136th one. I on the other hand have only had mine 3 yrs now and have only passed 4 and I still have a 6mm in my left kidney. My husband went through 3 different kidney drs over the years each trying something new that the others hadn't, depending on your type of kidney stone is going to be your result. But his are calcium oxalate kidney stones, meaning not only does it form from calcium but also the oxalates in food he eats/drinks. I have tried him on a few things myself and some have worked better then others. 1. Lemon juice and olive oil is suppose to break down the kidney stone while coating it with the oil, he didn't see much results from this bc you would need to drink it at least 2-3 times a day and no ones stomach can handle that. So we moved on, lemonade with very little sugar does work, but again you can only drink so much a day before you have acid reflux issues. So the next thing we tried and I did see a big difference in the timing of the kidney stones passing was brags grape vinegar or whitehouse grape vinegar- it's a apple cider vinegar but the grape helps it go down not so harsh on the stomach. I normally find the brags at foodlion or Walmart and the White House I found on amazon. Anything to keep my husband from having to go through another surgery to break it down. Me on the other hand don't drink water at all, taste like I'm drinking straight bleach and I've been through all the steps of water and even boiled bottled water of many kinds trying to get the taste away, even flavored it and it didn't help, the best thing I've found yet for water is a shaklee water pitcher that you pour regular tap water and it comes out with no chemicals. It's pricey though, like 60-80$ for the pitcher and 1 filter and then the refill filters are $20 each. But you get 80 gallons out of it. Which I bought gallon water pitchers from Walmart to store the water in. You can find the pitcher at shaklee.com or just google shaklee water pitcher. If you would like to try that. The other thing is food, with the oxlate stones you have to change your diet, my husband doesn't eat any collard greens or turnips, cabbage is a big no no, no salt or pepper, but we do slide a little on the salt intake from noon to a half a daily value. I have to watch what I cook and what spices I use. So hopefully all this will help you. And good luck. Do try the grape vinegar!!\n"},{"author":"nevrgivup","resp_time":"over 2 years ago","resp_title":"Wow! Thank you so much.","resp_content":"Very helpful\n"},{"author":"ksptabs","resp_time":"over 2 years ago","resp_title":"RE: Credible methods to help move stuck kidney stones","resp_content":"I just posted this to another question on kidney stones. Their doctor said there wasn't anything major in their tests to figure out why they were getting stones.\n\n\"As someone who works with many kidney stone patients and urologists, I highly doubt that your urine didn't show anything. Nearly all stone patients have acidic urine. It's ripe to form calcium crystals which then stick to oxalates and form stones. I'm just assuming you have calcium oxalate stones because those account for 80% of all cases. Just reducing the foods you intake with high oxalates is only part of the issue (if you want that list just email me at info@ksptabs.com). You need to get your urine more basic. You can buy urine test strips off of Amazon for $12. The ones I use at home are the exact manufacturer as those used in the urology lab they charge a fortune for. There's some recommended steps for that too so email me for tips.\n\nThere are different things you can take to help with your acidic urine. You'll also need to take citrate that is bound to potassium and magnesium. They help bind to oxalates instead of the calcium. You then need to be hydrating to flush these out. I was just like you and was super frustrated. I passed some, did the shockwave treatment, and the laser. Stints are the worst! My urologist created these tabs that affect the urine and I haven't had a stone in four years. I'm not trying to sell you on these, but it just makes it easier for daily consumption. You can take Citrate, potassium, magnesium, and B6 on their own but just make sure you take the right amounts. Just know that their IS something you can do about this. If your doctor won't suggest anything then get a new doctor! If you start making daily changes you will see a difference.\"\n"},{"author":"jan_s","resp_time":"over 1 year ago","resp_title":"RE: Credible methods to help move stuck kidney stones","resp_content":"Hope you're ok, OP.\nWhen my husband had a similar problem, our doctor recommended us to check the quality of our drinking water. We found out that there was too much calcium. So be careful of what are you drinking, we ended up choosing a proper water filter.\nhttps://www.aquapurefilters.com/contaminants/115/calcium.html\nhttps://wisepick.org/best-countertop-water-filter/\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/38358/credible-methods-to-help-move-stuck-kidney-stones"},{"post":{"author":"udubb2012","post_time":"over 1 year ago","post_title":"Best Medication for Kidney Stones","post_content":"I have had frequent kidney stones over the past 4 years. With the first stone, the ER doctor prescribed percocet and Flomax, which seemed to work well. With subsequent kidney stones I visited my primary care physician and / or urologist for medication. It seems I was never prescribed the same thing twice. My question is, what is the best medication to take when passing a kidney stone?\n\nI have the following prescriptions at home from previous kidney stones or other procedures. Please let me know if any of these would be good to take. I am trying to avoid another useless visit to the urologist.\n\nLortab 5mg\nFlexeril\nTordol\nFlomax\nNaproxen 500mg\n\nThanks for any recommendations.","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/64563/best-medication-for-kidney-stones"},{"post":{"author":"alifetime1","post_time":"over 1 year ago","post_title":"My 3rd transplant","post_content":"I was born with a congenital kidney deffect that caused reflux neuropathy. I had reconstructive surgery in 1963 at NIH in bethesda, Maryland to repair the damage done by severe infections since birth. They now do this in utero! So I kept my native kidneys untill 1987 when my sister donated her kidney in my first living related kidney transplant.\nThat kidney failed in 1999 when my secord sister donated her kidney that I currently have today. 18 years later I am now loosing this kidney. I am preparing to go on the cadaver list and looking at transplant centers where I live in Washington, DC. NIH told my parents I wouldn't live to be 13. I'm 59! I had hoped by now they will have cloned kidneys. Unfortunately I am preparing for dialysis! I have lots of experience being a kidney disease patient! So please share your stories with me and tell me yours!","like_count":"0","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/63680/my-3rd-transplant"},{"post":{"author":"monique49","post_time":"over 1 year ago","post_title":"Kidney issues.","post_content":"Retaining water in legs and ankles. Was at one time having cheat pains and heart palpitations. Blood work 2 months ago. Glucose was kinda high. All blood work pertaining to kidneys were normal. This was june.. There is a growth on both kidneys. Told there were no changes months back. Now i am retaining water and urinating less. I do take hydrochlorothiaze and lisonipril. Thyroid is enlarged but was told thyroid test like tfree were finally stable.. Blood pressure high at times and low at times. Normal as well. I get dizzy at times. Upon standing or moving my head quickly.. I am nervous and afraid could someone give me some feedback.. Thanks.","like_count":"0","tags":[]},"responses":[{"author":"mochacurls","resp_time":"over 1 year ago","resp_title":"RE: Kidney issues.","resp_content":"Please see a kidney doctor or specialist. My family has a history of kidney failure. God Bless You.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/61839/kidney-issues"},{"post":{"author":"htrd123","post_time":"over 1 year ago","post_title":"From gross Hematuria to cystoscope to wtf?","post_content":"Ok, so gross Hematuria.... only once. No pain, no problems. Went to doctors, sent me to urologist. Booked me in for cystoscopy under a general as I had hypospadias when I was younger...... anyway.Had ct scan.... never heard back from anyone about ct scan? (Assuming was clear!)On the morning of surgery (Wednesday) the surgeon said a lump on kidney was found on ct. they will see what the lump is via the camera...when I woke I was told, the tubes from kidney to bladder was too small and they have put a stent in....Wtf?... why wasn't I informed about the ct? I didn't have any pains or discomfort before operation. Now it's just horrible I don't want to go to toilet. The pain is unreal.... after the burning,when urinating. Then comes an intense pain up your back. Almost like pulling a muscle or trapped nerve. It has eased up a little. My urine is red then brown then normal. I get spasms, Odd feeling around my chest.... and I was feeling normal Tuesday. I can't do all the normal things I did. Worried about going back to work. Was intending to go back to work Friday. But got the hassle of having to take holiday so I get paid. And the more exercise I do, the more I will bleed....? Why the hell did I bother going for op. I was fine before.Why so much lack of communication with me?... I now have to have chest ct scan?... and go though all the pain again when I heal.I just want to know what's happening?Is this lump likely to be a stone? Why would he say lump, not stone?Would a stone look completely different to a tumour/lump on ct scans?I need more information before I lose the plot. Can anyone tell me what it's likely to be?","like_count":"1","tags":["Kidney Stones","Kidney Cyst","Kidney Failure","Kidney Disease"]},"responses":[{"author":"htrd123","resp_time":"over 1 year ago","resp_title":"RE: From gross Hematuria to cystoscope to wtf?","resp_content":"Turns out it's cancer... I have staging at the end of the week and will have to have kidney removed.\n"},{"author":"auroraskyak","resp_time":"over 1 year ago","resp_title":"RE: From gross Hematuria to cystoscope to wtf?","resp_content":"Sorry to hear that. If I HAD to choose to have a cancer thought it would be kidney. Usually it stays confined to the one kidney and most of the time can be completely removed surgically and sometimes may need targeted radiation, no chemotherapy. Often the tumor can be removed with just a partial nephrectomy, and you can preserve much of your kidney function. If you do end up having the whole kidney removed be proactive in maintaining your remaining kidney at it's highest function by consulting with a nephrologist. Proper diet and exercise will be your best preventative medicine, as well as good follow up with a BMP at least ones a year. Take care and hope you come out with the best possible scenario.\n1\n"},{"author":"htrd123","resp_time":"over 1 year ago","resp_title":"RE: From gross Hematuria to cystoscope to wtf?","resp_content":"Thanks dude. I’m having kidney out just over a week. I researched into everything. And tbh I’m not too worried. It’s stage 2 but only in kidney. So they can take it. But any longer with this stent in me and I’ll go crazy. More excited on getting that out! Worst thing I’ve experienced.\nBut with the cancer, I feel very positive about it now. I even watched the operation. (Was amazing)\nBut just another bump in the road can’t wait to get back to work.\nAnxiety of not know the staging was bit up and down but was massive weight off my shoulders when I found out it hasn’t spread.\n\nGood luck y’all\nMuch love\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/56990/from-gross-hematuria-to-cystoscope-to-wtf"},{"post":{"author":"ginamarie1212","post_time":"over 1 year ago","post_title":"Stomach pain, kidney stones??","post_content":"Hi! So, every once and a while it is completely random I will get this pain in my stomach. It is to the right of my belly button right outside of where my abs would end. So the Middle section of the right side of my stomach. The pain is very random, I will notice a weird tight feeling where it is and then if I even go to scratch my stomach or something I will feel like I am getting stabbed with a knife in that spot. I do feel a little bump when I push around which does hurt alot and then after I find the little bump the pain increases size and will persistently hurt for about an hour or so. This is totally random and it has been coming and going for the past 6 months. Any idea what this is or if it might be something my body is doing after eating certain foods? or cyst?","like_count":"0","tags":["Kidney Stones","Kidney Cyst","Kidney Failure","Kidney Disease"]},"responses":[{"author":"auroraskyak","resp_time":"over 1 year ago","resp_title":"RE: Stomach pain, kidney stones??","resp_content":"I'm not a doctor but am in the medical field. I can tell you It's definitely not your kidneys, those are located in the retroperitoneum, anatomically located on your back side, often referred to as your flank. Most likely if it comes and goes it's a gas bubble in your intestine. Often when people are constipated or gassy it can present it self in odd type of stomach pains that do not feel like gas or constipation. But your intestines are so long that they take up most of your abdominal cavity and the pain can feel like it's something else.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/54638/stomach-pain-kidney-stones"},{"post":{"author":"919florida","post_time":"over 1 year ago","post_title":"cystoscopy post op - blood in urine","post_content":"I was hoping someone could help. Yesterday I had a cystoscopy at the hospital. When I was released they told me to expect light pink blood in the urine for 3 to 5 days. Today I am noticing considerdable more blood and its dark pink to light red. Which is concerning me since they said only light pink is to be expected. I called my doctor today and he never returned my call and then I called the doctor on duty number for concerns and they also have not answered me. I really don't want to go to the emergency room but nervous to leave this go all weekend. Any advice or do you think it would be ok to leave go?\n\nThanks for your time","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 1 year ago","resp_title":"RE: cystoscopy post op - blood in urine","resp_content":"They did tell you to expect some blood for 3 - 5 days. Remember, that it doesn't take much blood at all (less than a small eye dropper) to show up in urine. So even if it's a bit darker, as long as you are not getting big red clumps, you don't have much to worry about. You can start worrying when the 5 days are past and if yoiu are still bleeding. Then you can worry.\n\nI had a pancreas transplant attached to my bladder, so in the beginning I had a lot of blood and that's what the doc told me.\n2\n"},{"author":"919florida","resp_time":"over 1 year ago","resp_title":"Thank you. Hopefully all will be ok. The nurse is the one who kept saying it should be very faint so since it's been darker that is what concerned me.","resp_content":"Reply\nhtrd123\nover 1 year ago\nmrscora01: pain went away and was peeing normal ish. But after walking the dog I've since been bleeding and maybe 2/3 times in a day it'll be painful. I heard you will bleed the more exercise you do but the clumps/clots is that not normal then? I getting an infection?\n"},{"author":"htrd123","resp_time":"over 1 year ago","resp_title":"RE: cystoscopy post op - blood in urine","resp_content":"Yeah mate I was in pain for 5 days and bleeding didn't stop till 6th day. My doctors have been ridiculous with communication. And I had post a day later telling me my ct scan was the day before. My experience has been a bit joke! But the pain discomfort and bleeding will ease or stop.... good luck ;)\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/56871/cystoscopy-post-op---blood-in-urine"},{"post":{"author":"samheart","post_time":"over 1 year ago","post_title":"Kidney stones","post_content":"Hey everyone! I went to the emergency room and found out I have kidney stones and they gave me medicine. How many days should I wait until I go back if it keeps hurting?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/56025/kidney-stones"},{"post":{"author":"chela123","post_time":"over 1 year ago","post_title":"Ureteral duplication","post_content":"I have two ureters on one kidney and has caused recurrent utis and now blood I’m my urine often.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/56000/ureteral-duplication"},{"post":{"author":"boswani","post_time":"over 1 year ago","post_title":"Kidney Cysts","post_content":"I was told I have a Cyst on each kidney. I am diabetic too and take Janumet 2times a day. What are kidney Cysts and can it cause a problem.?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/55771/kidney-cysts"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Bun/Creatinine ratio high","post_content":"So I understand that this often indicates a kidney problem but my bun/creatinine ratio came back at 40 when the normal range is 6-22 and my creatinine came back .48 when Normal is .50-1. Which I know the creatinine isn’t horribly abnormal but paired with bun/creatinine ratio doesn’t seem good. So my question is how bad is a 40? Should I be worried? I have an appointment in a few days but I’m curious about it now","like_count":"3","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/54722/bun-creatinine-ratio-high"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Random, Sudden Onset, Extreme Fatigue and General Weakness","post_content":"Hello, all.\n\nI wasn't quite sure where to put this, so kidney disorders it is! I am an eighteen-year old female. For last few months (perhaps four?), I've been experiencing some really weird symptoms and we're not quite sure why. Every couple of days, I have spells of sudden onset, extreme fatigue and exhaustion, accompanied with generalized weakness, some dizziness, a headache, and general malaise. The episodes do not seem to be triggered by anything specific and happen almost any time of day, though more often in the afternoons and evenings. They seem to be unrelated to my blood glucose, as I've taken readings during those times and they're normal. They also seem to be unrelated to the amount of sleep I get and my sleep patterns. I have no history of major illness, excluding polycystic ovary syndrome. The only medication I am on is hormonal birth control to control symptoms of PCOS. I have fairly recently had a number of blood tests done, and my TSH and CBC results came back normal. I also had a complete metabolic panel, and everything there was normal, with creatinine and BUN reading low. I have no history of anemia, except where readings are a little low immediately following a blood donation. I always recover within about a week or so, and don't experience any symptoms from that. (I have not had ferritin checked, and I perhaps should.) My eating habits vary a little, but I make sure I drink enough water throughout the day and always eat fresh fruits and vegetables, so I don't think my diet is contributing much, if at all.\n\nThis is all all a little worrisome, because I've never experienced anything before. It's a little scary to go from feeling entirely fine to being overcome with sudden exhaustion, weakness, and a headache in the matter of a few minutes. My doctor doesn't seem to see an issue, but I'm strongly considering seeing someone else. Any help is appreciated.","like_count":"0","tags":[]},"responses":[{"author":"madi29","resp_time":"over 1 year ago","resp_title":"RE: Random, Sudden Onset, Extreme Fatigue and General Weakness","resp_content":"You may want to consult with your doctor at the possibility of the hormones in your birth control pills triggering symptoms of lupus. There has been controversy for years if there is any link between lupus and BCPs. I don't know if you are maybe on a higher dose of hormones for the PCOS which may make a difference too.\n\nMaybe there are other factors. Have you used tanning beds? Or spent time in the sun, maybe a winter vacation? Did you have a fever or illness before these episodes started? These are known lupus triggers. I would think about your environmental factors four to six months ago that would trigger this sudden onset of symptoms.\n\nResearch lupus symptoms. You may recognize other signs or symptoms.\n\nAsk your doctor for an ANA blood test. If it's positive, that doesn't necessarily mean you have lupus, but if it's negative, it's almost certain that you don't. There are other blood and urine tests too but I would first focus on the ANA. If your primary doctor doesn't give you answers, see a rheumatologist.\n\nI hope I'm not scaring you. I don't know if you have lupus but I think it's possible and you should be evaluated. Good luck. I hope you find your answers soon.\n"},{"author":"finkle51","resp_time":"over 1 year ago","resp_title":"madi29:","resp_content":"Reply\nfinkle51\nover 1 year ago\nfinkle51: Anonymous You may want to have your blood tested for Hep C . You have all the symptoms. Good luck.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/47751/random-sudden-onset-extreme-fatigue-and-general-weakness"},{"post":{"author":"thabull","post_time":"over 1 year ago","post_title":"7mm stone lodged in","post_content":"71 yr old. I had bladder removed in 2008. I have a 7mm stone.In my ureter , apx 1 inch from ileium conduit. I have a tube in my kidney to prevent urine blockage.\n90% of urine is passing by the stone, as less than an ounce per day passes through my kidney tube, that was inserted 15 days ago. Is eswl (sonic blasting) an option? if so what type is recomended.\nEntry from the conduit is near impossible. Other option is surgery through kidney to gain access to the stone, which is what my Dr. recommends.\n\nI had 7-8 pain level May 2nd, from 10am till 1 PM when the stone evidentally moved,and after 1:30 that day I have had 0 Pain, other than when they inserted the drainage tube at 7 PM that day. Was in hospital 40 hrs.\nI have ALS for 15 years. Still walk with a walker.\nSpeech is difficult to understand.\nBreathing is apx 70%. Oxygen level daytime is 96+ nightime 88-94\nBladder removed 2008.\nOnly HB medication taken daily, average 90/140 with daily Diovan medication. Pulse 74 bpm resting.\nMy urilogist stated, sconic wave to burst was not possible, as he would not be able to pin-point the stone location , and that other organs might be damaged. After researching on the internet I am questioning his comment.\nI have a pix of stone in xray, that is too large 2.1 mb to download here. if anyone could assist me in a 2nd opinion.\nThanks so much! email....... ivey1414@aol.com","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/53358/7mm-stone-lodged-in"},{"post":{"author":"***","post_time":"over 2 years ago","post_title":"Kidney Cyst at 26? (former alchool abuser)","post_content":"Hello guys,\n\nI'm 26 years old. Pretty healthy but not terribly healthy (cholesterol 188, blood pressure 120/80, 5' 10' 220) I know I need to lose weight and I am working on it. For six years, I was a daily alcohol abuser. I drank around 6-10 beers every other day and sometimes daily. Recently, I quit and had some tests done to ensure I am healthy. My bloodwork and liver enzymes all came as normal (surprisingly). I had an EKG done to test for damage which was normal. However, I had an abdominal ultrasound done to check my organs to make sure they were ok. Surprisingly, my Liver is OK and I don't even have fatty liver after 5+ years of alcohol abuse. Everything was OK except apparently I have a cyst on my right kidney (singular cyst). I am only 26 years old. I am alarmed since it seems only people 50+ get them. I used to smoke synthetic marijuana (I smoke marijuana generally but haven't in almost a year) and I know it can damage kidneys so I kind of blame that. I want to know though, at 26 with a kidney cyst, can I still live a long healthy life? It is not a tumor or maligant, just a kidney cyst. My doctor didn't seem too concerned just told me to get an ultrasound every 6-12 months to make sure everything is OK. Please let me know what your opinion on this is as I am very worried I may get Kidney cancer later on in life now. Is Kidney cysts at a young age curable? Are they common at all? Most importantly, can I still live a normal, healthy long life and raise a family without dying early? Thank You I appreciate it.","like_count":"0","tags":["Kidney Cyst","Kidney Disease"]},"responses":[{"author":"jeraldinc","resp_time":"over 1 year ago","resp_title":"RE: Kidney Cyst at 26? (former alchool abuser)","resp_content":"i have the same thing but mine cause alot of pain and i bleed when i pee\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/31456/kidney-cyst-at-26-former-alchool-abuser"},{"post":{"author":"jeraldinc","post_time":"over 1 year ago","post_title":"kidney cysts","post_content":"i was in the er and was diagnosed with kidney cysts and it hurts really bad i kept on going to the er because i cant control the pain over this past weekend i peed blood should i be concerned has anybody had this i dont get my insurance until july 1 i feel discriminated because i dont have my insurance yet im in so much pain everyday help please","like_count":"0","tags":["Kidney Cyst"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/53232/kidney-cysts"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"High heart rate","post_content":"Hi. I've noticed my resting heart rate has gone up the past three weeks from a 55 to almost 75 bpm. When I walk it goes up to a 100 and when i went for a walk earlier today it hit 140. I wasn't going fast and normally i have no problem, but found myself almost out of breath. I'm 19 and weigh 54 kg and would consider myself in an alright shape.\nThree weeks ago i spent the night in the hospital because of something with my kidneys. The doctors weren't sure what it was, but say i was dehydrated and that that is why i was in so much pain. They also suggested kidney stones.\nNow I feel fine, just out of breath when I walk and I can sort of feel my lower back, but that could also just be me being paranoid.\nI read that a high heart could be connected with kidney disease.\nShould I go to the doctor or am I just overthinking?","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/53016/high-heart-rate"},{"post":{"author":"tileman6979","post_time":"over 1 year ago","post_title":"Kidney stone","post_content":"I had a ct scan that revealed two stones 1mm and 4 mm one in each kidney the pain has been almost constant since the hospital meds wore off the pain meds prescribed have little to no effect will the pain subside or should I return to the er","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"sandman3511","resp_time":"over 1 year ago","resp_title":"RE: Kidney stone","resp_content":"tileman:\n\nlast September i wound up with severe pain which, upon visiting the hospital, turned out to be a 5 mm kidney stone in my left kidney. Pain meds helped and they gave me flowmax to help pass the stone. i went online and found an all herbal tablet on Amazon called Stone breaker aka-chanca piedra. i took two a day til the bottle finished. within a week of starting the regimen the pain subsided. two weeks later i began to experience the sensation of a hair being pulled through my penis when i urinated. this occurred occasionally and was never painful. last month i had my quarterly follow up with my VA doctor. he ordered x-rays and lo and behold, no more kidney stone!\nthe pill supplement is all natural and inexpensive. I am not plugging the pill nor am I a representative of amazon. i stand to gain nothing from giving you this information. i am only stating that it works and the hundreds of positive review on the supplement state the same. its worth a try to get rid of the pain. good luck!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/51351/kidney-stone"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Affects of kidney removal and body temperature","post_content":"I was always a warm person but after my kidney was removed I was cold and I had to eat something to get warm. My doctors have told me they have no idea on what is causing this.","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 1 year ago","resp_title":"RE: Affects of kidney removal and body temperature","resp_content":"Docs don't know much about kidney issues and temperature. But virtually every kidney patient will tell you that they are freezing all the time. Since it doesn't affect any treatments, docs don't really care.\n\nInterestingly enough, there is something now called SPOR research (Strategic Patient Oriented Research). And the researchers are now starting to study things that the patients want to know about. So I know that here in Canada there is some (probably the first) research into why we are always cold.\n\nI was cold for 20 years before my kidneys failed and for many years after my transplant. I only warmed up after I hit menopause.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/52070/affects-of-kidney-removal-and-body-temperature"},{"post":{"author":"deb200059","post_time":"over 1 year ago","post_title":"Getting a colonoscopy with CKD","post_content":"I have been suffering with ckd for 10 yrs. 10 years ago I had a colonoscopy and shortly after the procedure I started bleeding from my kidneys. After my follow with the Gastro Dr. everything was fine. So when I started bleeding from kidney I didn’t think the procedure was the factor since I was bleeding from the kidneys.At the time I was seeing a rheumatologist for problems that I had been experiencing for a few years. I made an appt to see her but as I got near the appt they cancelled me and now the appt is pushed back a month. By the time I finally was sent to the right Dr. Now 3 months have passed. I was diagnosed with stage 3 kidney disease. 4 yrs into ckd my kidney I was stage 5 and after having several biopsies they couldn’t come up with my cause. After going to Mayos my kidney is back to stage 3. So my Dr. Of 10 yrs. said he still thought my ckd is caused by an autoimmune disease. I accepted it. Now as a procrastinator and waited 10 yrs. my colonoscopy is scheduled in 2 weeks. After talking to my Gastro Dr. He said I could have had kidney trauma from the prep for the procedure. I had the pills and I understand with research into the matter these could have been a cause. My caring Dr. Of 10 yrs.( and he has done a wonderful job) doesn’t think this was ever a factor and completely dismisses my concern. Now I’m nervous that I may not make the right decision based on my gut feeling. The first 4 yrs. of ckd I felt like I had the flu everyday. I don’t know if I can go back to that feeling again. I know the Prep has improved but I still see there are risks. Thank youDeb","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/51365/getting-a-colonoscopy-with-ckd"},{"post":{"author":"always29","post_time":"over 1 year ago","post_title":"Re: IgA nephropathy and head colds.","post_content":"I have IgA nephropathy. It has caused me little trouble except for a little invisible blood in the urine. I rarely have head colds but I have one now. What kind of cold meds can I take or use safely? I see my Nephrologist in 5 days but in the meantime, I feel awful. This is my 3rd day with symptoms. Thanks for the experienced advice.","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 1 year ago","resp_title":"RE: Re: IgA nephropathy and head colds.","resp_content":"Nothing with ibuprofen!!!! I know there's advil cold and sinus and that is definitely off the list. It's been a long time since I needed any, but I used to take Nyquil at night so I could sleep,and then just be miserable during the day. Steam inhalation also helps clear sinuses and I used to put a few drops of lavender oil and eucalyptus in the hot water (don't get any of the steam in your eyes). Both are also antibacterial/antiviral so can help with the cold.\n\nAspirin is also not good for kidneys, but most of us are ok with a little bit of tylenol/acetaminophen (cleared by the liver).\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/50675/re-iga-nephropathy-and-head-colds"},{"post":{"author":"10171017","post_time":"over 1 year ago","post_title":"Kidney health function questions","post_content":"I started noticing dull pain sensation in left kidney every time after drinking alcohol starting 3 years ago. It was directly correlated to drinking alcohol as the symptoms were not present otherwise. Drinking has in my opinion been done in moderation however for the past 2-3 years I have stopped drinking altogether. There were however maybe 2 or 3 occasions when I was younger in which I drank to the point where I may have done some long term damage. Recently, slight twinges and pain sensations in both kidneys have come about recently even after not drinking alcohol. Questions are below:\n\nI was not aware of kidney pain being related to alcohol, is this common?\nIs it possible for 2 or 3 heavy drinking events to cause long term damage to kidneys or would it have to be an accumulation of heavy drinking over time?\nWhat are the gold standard tests/exams to check for kidney function?\nHow are kidney donors tested to confirm they have healthy kidneys for transplants?\nWhat are some tips to promote healthy kidney function?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/50568/kidney-health-function-questions"},{"post":{"author":"cjohnson2001","post_time":"over 2 years ago","post_title":"UTI?","post_content":"I am a 16 year old female and on February 24th I woke up and peed and felt like I was on fire. On February 28th I finally went to the urgent Care and he gave me Bactrim. He also gave me a blue pill that was supposed to help with the burning. I took everything like I was supposed to and the blue pill stopped working two days in. I had been taking Azo for the burning and I felt okay. By the time I finished the antibiotics I quit the Azo to see if they worked. They did not and I did not know what to do. I started the Azo again and days later I made an appointment with my primary care doctor. She told me I still had a horrible UTI and put me on Nitrofurantoin. 2 days later she called with my Urine Culture results and also put me on another antibiotic called Flagyl. She also gave me medicine for a yeast infection. I took the antibiotics and everything like I was supposed too and she scheduled me a follow up appointment for 10 days later. Even after the antibiotics I was still burning (not as bad but it was uncomfortable) I told her this and she said I didn't have a UTI so she put in a referral for a Urologist but we all know it takes forever to get an appointment with a specialist. I don't know what to do. The burning has become intense again and Azo is barely working anymore. I've only slept 6 hours the past 2-3 days because of the pain. I'm exhausted and crying because it is so bad. Should I call the Urologist and ask what to do? Or go to the doctor/urgent care/ ER again even though I'm trying to get an appointment with a specialist? I need help.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: UTI?","resp_content":"What happened? Are you ok?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/47295/uti"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"passing a stone? or worse?","post_content":"i've started to see blood in my urine. i know it's kidney stones (one 4mm stone) because i have had two separate hospital visits in the last few months. the visible blood in the urine had gone away (the doctors told me there would still be a microscopic amount), but now has shown up again. i went to the doctor last week because it felt like i needed to pee a lot but very little was coming out. they told me that i was retaining 30ml which is apparently normal. some of the sensation of needing to pee really bad had passed but now is back with visible blood. my question is: should i expect to pass my stone today or do you think that there may be something else going on?","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/50314/passing-a-stone-or-worse"},{"post":{"author":"serbian","post_time":"over 2 years ago","post_title":"Should my catheter come out?","post_content":"Need thoughts please.\n\n20 yr old male. Egfr is 11%. Crea ~ 390.\n\n2 fistula in l and r arms failed. Going to try for a AV graft.\n\nRight now I have a central venous cath from short stint on dialysis [acute failure] but now loss is chronic.\n\nDoc wants me to have cath out cause of chances of infection etc but I will need one again to be put in if graft doesn’t work.\n\nDoc hasn’t talked about needing dialysis soon but those numbers don’t make me feel secure. Should I have the cath removed? What about those numbers and dialysis?\n\nIs it bad to have these numbers and not have a working access?\n\nI know that a new cath can be shoved in quickly btw...\n\nHelp? Opinions?","like_count":"1","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Should my catheter come out?","resp_content":"First off, keep in mind that every person is different. Usually at your level of creatinine (maybe a bit less) they start teaching you about options so that you can have things put into place before you need it. But you never know.\n\nIn my case, I had the teaching sessions at a crea level of about 350. And I went on dialysis roughly 10 years later at a level of about 900 or so. But I'm both tough and weird.\n\nSome people at your levels feel awful and are begging their docs to start dialysis. So take a good hard look at what is going on. How is your fluid build up? If it's bad, that can be dangerous (especially if the fluid starts sitting on your lungs), so you might want to start dialysis sooner. Is your K (potassium) very high? Another reason to start as high K can also be very dangerous. How is your energy level? As good as always or are you cutting back more than you like? Once again, starting dialysis may help you feel a bit better.\n\nA word of warning, don't leave it too long the way I did. I had to have an emergency access put in and it wasn't a lot of fun.\n\nI personally would leave the cath in for a bit and have blood work drawn a couple of times and see how things are going. Be careful though. Your doc is correct that an infection could also be very dangerous - no showers!!!! If things stay very stable I personally would probably have it taken out (also a small risk there) and enjoy my long hot showers again. But that's me. Have a serious chat with your nephrologist and put him on the spot and ask him/her what s/he would do. That may help you a bit as well.\n"},{"author":"pleasant115","resp_time":"over 1 year ago","resp_title":"RE: Should my catheter come out?","resp_content":"Five years after I was diagnosed with chronic failure, my kidneys failed abruptly and completely. To enable dialysis, I had an operation on my arm to connect a vein and artery. I also had a catheter put in my chest so I could immediately begin dialysis. After three weeks, I developed an serious infection (MERSA) and was immediately put in intensive care for a month, during which time I was on the verge of death. There is a high probability of serious infection when you have a catheter in place, Get such an infection and you may not need to worry about dialysis because you may be dead.\n15 months after the MERSA infection, I had to have an aortic valve replacement due to damage done by the infection. I survived that, too. The following year I was healthy enough to go on a transplant list and within months was lucky to be offered a kidney from a cocaine overdose victim. I took the offer and am now eight years older with a perfectly functioning kidney.\nMy advice: Listen to your doctor, and do what is necessary to live.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/32690/should-my-catheter-come-out"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Frequent urination, pain, no answers","post_content":"So I had to get a ct done tonight because I have had back pain that started yesterday right under my right rib in my back, and they thought kidney stone. I had a bunch of little things in the pee filter cup they gave me to use yesterday, all day today, and my urine was light brown at one point. Today it started burning when i peed which wasn't happening yesterday, 3 different times and hurt for 10 minutes after I peed, like burning on my pelvic bone and down below. Have had nausea, threw up Wednesday.\n\nSo I showed the er dr the pics I took, INCLUDING this blob of random yellow stuff that came out\n\nHe said he could see the sediments in it, and the yellow stuff he had no clue about.. And his diagnoses was a sore/ pulled back muscle.......\n\nDid a ct, blood test, pee test, all looked normal...so all the burning pain with peeing, sedimemts with pee in the filter cup, light brown pee, blob of yellow stuff, nausea, back pain, abdominal cramps, equals a pulled muscle.....\n\nTried to post pictures and apparently files are too large, no clue why.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/49816/frequent-urination-pain-no-answers"},{"post":{"author":"worried198676","post_time":"over 1 year ago","post_title":"Creatnine and BUN Levels","post_content":"Hello!\n\nOn April 10, my dad recently had a blood test done and his creatnine and BUN levels were slightly elevated and a 2.20 and 32. His ratio is a 15. In September 2017 his creatnine was 1.39 and his BUN was 17 with a ratio of 12.\n\nHis primary care doctor is sending him to a Nephrologist.\n\nMy dad is almost 70 and has history of high blood pressure and heart attack in 2007.\n\nWhat does his recent test levels mean?","like_count":"0","tags":["Kidney Stones","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/49777/creatnine-and-bun-levels"},{"post":{"author":"dwight01","post_time":"over 1 year ago","post_title":"Creatine levels","post_content":"Had a baseline level 6 months ago at 1.5. Just had another kidney stone and upon entering the hospital was tested at 2.5. Passed the stone and 2 hours later creatine tested at 2.0. Eight days later blood test at 1.7. Is this rate of decline ok?\nAlso last test was 2 hours after strenuous exercise and high protein lunch and 7 hours after 30 protein gram breakfast . Can this skew my results? Doctor wants to wait 30 days for anothet test and on an afternoon after lunch and exercise, is this correct?","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"dwight01","resp_time":"over 1 year ago","resp_title":"RE: Creatine levels","resp_content":"Ps- i am a little over 66 and lift weights 7 days a week.\n"},{"author":"mrscora01","resp_time":"over 1 year ago","resp_title":"Ultimately, the biggest thing to affect your creatinine is how well hydrated you are before the test. In future, if you can plan it out, always try to drink the same amount (non-caffeinated beverages) on the day before the test. This will keep things as consistent as possible. The level of exercise or protein consumption doesn't make that big a difference.","resp_content":"\nAs for the rate of decrease, that too doesn't really matter how fast it drops. If it drops quickly, it just means that your kidneys have recovered quickly.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/48921/creatine-levels"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"CAN I TAKE AN IMMUNE BOOSTER AFTER MY TRANSPLANTED KIDNEY FAILS?","post_content":"When you receive a transplanted kidney, you are supposed to take an anti rejection drugs which suppresses your immune system.\nNow my question is, when your transplanted kidney fails totally and it has been confirmed that nothing can be done about it, can you take immune boosters to at least boost your immune system?","like_count":"1","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: CAN I TAKE AN IMMUNE BOOSTER AFTER MY TRANSPLANTED KIDNEY FAILS?","resp_content":"Wait, so your transplanted kidney has failed?\n"},{"author":"meanangel","resp_time":"over 2 years ago","resp_title":"Anonymous: yes and I am now back on dialysis","resp_content":"1\nReply\nmrscora01\nover 2 years ago\nWhile in theory there is no problem, always be careful when adding supplements when you are on dialysis. You don't know what the fillers are, and you may end up with a build up of something that can hurt you because the dialysis treatment may not be able to filter it out. Check with your dialysis team.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/47847/can-i-take-an-immune-booster-after-my-transplanted-kidney-fails"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Burning when urination","post_content":"Will kidney stones only burn the last inch section of your penis when peeing?","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/46674/burning-when-urination"},{"post":{"author":"wvpoemlady","post_time":"over 2 years ago","post_title":"CT Scan showed a 2 mm calculus in the urinary bladder","post_content":"I have no pain. I've had a touch of blood in my urine for 40 years, at least.\n\nI got a stomach virus about a month ago. I vomited very hard and a lot. Later the same evening, I had a slight cramping and had blood showing on toilet paper. I thought it was from the violent pressure on my abdomen.\nIt became less in a day or two and nothing since.\n\nMy PC checked my urine. It showed a little blood & was cloudy. She set me up with a Urologist. He ordered a CT Scan w/contrast of my abdomen and (bladder and kidneys.)\n\nMy question is ... should I have a Cystoscopy if CT Scan showed a 2 mm calculus in the urinary bladder? I really DON'T want to have that done unless necessary! Can anyone help me figure this out?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/46655/ct-scan-showed-a-2-mm-calculus-in-the-urinary-bladder"},{"post":{"author":"trbn01","post_time":"over 2 years ago","post_title":"Discolored urine","post_content":"Sometimes as son as I am done urinating I have a orangish discharge. Im not sure what this is, has anybody seen this before?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/46492/discolored-urine"},{"post":{"author":"charliej2018","post_time":"over 2 years ago","post_title":"Kidney stones again?","post_content":"In May 2016 I went to the hospital with severe pain to discover I had kidney stones. The drip I was on was enough to flush them out. I’ve been experiencing very mild aches every now and then (which I was told was normal), only lasts a few minutes so never worried. I have a good diet and exercise regularly but within the last couple of months the aches have grown stronger and remained for a lot longer. Not sure whether that’s a sign that they’re coming back or I may have other issues with my kidney. Hoping it’s just nothing.\n\nThanks for any answers :)","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/45791/kidney-stones-again"},{"post":{"author":"patient17","post_time":"over 2 years ago","post_title":"Kidney Dysplasia","post_content":"Hi my 3 year old daughter was born with Kidney Dysplasia. She is currently on a waitlist for a kidney transplant. She has not started dialysis and I'm not sure if I should have her begin that while she is waiting for an organ match.","like_count":"0","tags":["Kidney Stones","Dialysis","Kidney Cyst","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/45353/kidney-dysplasia"},{"post":{"author":"stslt301","post_time":"over 2 years ago","post_title":"Weird pain with kidney stones....","post_content":"A year and a half ago I woke up in the middle of the night with awful flank pain. I went to the ER and based on traces of blood in my urine, frequent urge to urinate and pain, they diagnosed me with a kidney stone. Fast forward to a few weeks ago. I started having a dull ache in my side, same side as last time. I assumed I pulled a muscle but the pain just would not go away. A few weeks after the ache started, I noticed that whenever I urinated it did not burn/minimal urgency, but rather felt like cramping in my lower abdomen. It would subside shortly after urinating. I went to a urologist who took urine and said no UTI/no blood. Sent me for CT scan and said I do have a small stone near the bottom of my right kidney ( he scanned my whole abdomen and pelvis to rule out ovarian cysts, fibroids, etc. and all was clean). My question is why did I feel cramping upon urinating when the stone has not descended? Is it possible I had passed another small stone so that's why? I swear I feel pain when the stone moves within my kidney. Could this happen?? Thanks!","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/45010/weird-pain-with-kidney-stones"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"feeling sick all the time","post_content":"I almost never do things like this. I respect my doctors and other medical professionals immensely, but I am genuinely desperate. In October (about 5 months ago) I visited my PCP after feeling sickly for weeks on end. I had been having low-grade fevers on a daily basis, joint pain and general aches, and fatigue so bad I would sleep for 16 hours. My blood work came back with normal CBC, but positive for mono. I was given prednisone (which did nothing) and told I would feel better in a week or two. 5 months later, my symptoms have only gotten worse. With my fevers come a bright red butterfly shaped rash across my face, and I am often too sick to get out of bed. I visited the doctor once again, who agreed that the fevers were not likely caused by the mono I had five months ago. She thought there was a chance of an autoimmune condition, so tested my ANA, CRP, CBC, ESR, and for lyme (for good measure). Yet, every single test came back within the normal range. I had been treated for kidney pain recently as well, but all that showed up in my urine was a little protein and white blood cells (but not an amount too excessive). With having tested negative for lupus, lyme, and any sort of infection, I do not know what to think. My fevers have not subsided, and the rash on my face shows up a few times a week at least (it's not itchy, just hot). I also continuously break out in hives, despite having had allergy testing (not sure if this is related). If I don't have an autoimmune condition, lyme, mono, or any infection, why on earth am I feeling so sick and what can I do to feel better? I feel like I have tried everything, and I eat and exercise well. Even pain meds do a poor job of relieving my symptoms. If anyone has any ideas on what I can do to feel better or what the issue is, it would be greatly appreciated.","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/44074/feeling-sick-all-the-time"},{"post":{"author":"lindskay0","post_time":"over 2 years ago","post_title":"Bladder ct results","post_content":"My husband had a bladder ct a few days ago for blood in the urine. The dr called the next day to say the results were ok. But we got the ct scan ourselves and I am confused about something. The radiologist says “Nodular indentation soft tissue seen at the base of the bladder adjacent to the superior margin of the prostate gland” what does that mean? He has a cystoscope scheduled in two weeks. What could it be? The bleeding is only occasionally and only at the end of the episode of urinating and it’s bright red. Help!","like_count":"0","tags":[]},"responses":[{"author":"pshirrell","resp_time":"over 2 years ago","resp_title":"RE: Bladder ct results","resp_content":"No red wine #1 , does he have pain ?\n"},{"author":"lindskay0","resp_time":"over 2 years ago","resp_title":"No he doesn’t","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/42303/bladder-ct-results"},{"post":{"author":"peter7890","post_time":"over 2 years ago","post_title":"Does anybody ever get Replies here ?","post_content":"I see that No One in this forum ever gets replies ? is there something wrong with this forum ? or is it DEAD ????","like_count":"0","tags":[]},"responses":[{"author":"dmart18","resp_time":"over 2 years ago","resp_title":"RE: Does anybody ever get Replies here ?","resp_content":"Yeah, it's dead here.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/42318/does-anybody-ever-get-replies-here"},{"post":{"author":"victoria595","post_time":"over 2 years ago","post_title":"Need help interpreting EBV viral antibodies results","post_content":"I was diagnosed with thyroid cancer August 22, 2017 and after doing research decided to ask for an Epstein Barr Virus test. The primary care physician would only tell me I was swimming in the virus antibodies so I must have had a recent occurance. I am sure I have had it a while and am on a diet to cure it because I believe it is responsible for my cancer. Now I would like someone to tell me exactly what the EBV Vrial (VCA) of","like_count":"0","tags":[]},"responses":[{"author":"azsunbum","resp_time":"over 2 years ago","resp_title":"RE: Need help interpreting EBV viral antibodies results","resp_content":"Hello Victoria, I've just been recently ( 2 days ago ) diagnosed with EBV (via blood test) My titers which should be with a range of 0-5 came back in the 500+ range. ( I'm scheduled for a Thyroid ultra sound This coming Thursday. The doctor suspects that I probably have several nodules on my Thyroid?? He seemed pretty confidant? I'd never heard of the virus! I am a 58 year old women. (some history) I had a complete hysterectomy at an early age of 23 due to Endometriosis as well as in the body cavity as well.. So after he had advised of this new Virus I have, he Immediately placed me on the drug (Valaciclovir 500.mg 2 tabs 3 times a day for 7 days ( that's 6,000 mg a day!! Then adjust the med to (1) 500mg tab every day there after. He stated it would me months? He insisted that I take this particular Med?\n( My Primary care Doctor!) I've had most of the EBV symptoms for quiet sometime now. In addition, many times I feel like there is a golf ball in my throat. Will see how the ultra sound turns out.\nThe explanation that my doctor gave to me is that this is a contagious virus when it's in a high peak time. I guess that means a flare up? He compare it to Mononucleosis, The Herpies virus (cold sores etc) HE ALSO STATED LIKE MOST OF THE VIRUSES I MENTIONED THERE ARE PEOPLE WHO ARE JUST CARRIERS WITH NO SYMTOM.? Web MD has a great explanation on this sight. It's spread from person to person by body fluids, blood and poss sexual contact. ( I have had the same partner form several years, but I am sending him in to be tested.\n\nI'm very curious to know how you were diagnosed with your Thyroid cancer and what they have done. All of this is very strange at this point, but like you I feel I have had this for sometime now! I hope your feeling better soon.\nwarm regards\nK.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/29749/need-help-interpreting-ebv-viral-antibodies-results"},{"post":{"author":"cuteoldlady","post_time":"over 2 years ago","post_title":"Kidney Failure questions","post_content":"I was diagnosed in 2012 with Stage 4 (severe) kidney failure and through good diet, exercise and a lot of luck I am still at the same stage (even a little higher GFR). I signed up for the transplant list in 2013 and honestly did not think it would ever happen. Lo and behold I was called to say there was a slight possibility there would be a donor match (providing a pancreas and kidney combination was not going to work for the donor ahead of me). I hit the hospital, was preliminarily prepared when it turned out my cardiologist had not reported to the transplant people I had been put on Warfarin. Thank God I had my medicine list.\nQuestion: This definitely prepared me for the possibility it might happen again and I have no arrangements or income for any kind of stay to keep\nthrice weekly visits to the transplant clinic. Have Medicaid but can't get any answers. My support system became non-existent (divorce and death) so I am alone. Any ideas?","like_count":"0","tags":["Kidney Failure"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/42614/kidney-failure-questions"},{"post":{"author":"3psarf","post_time":"over 2 years ago","post_title":"What is this on my X-Ray?","post_content":"Hey guys, I went for a hip x-Ray and there is this dark C shaped structure in the upper left quadrant. Is this part of the kidney or am I completely out of place here?\nCompletely confused.\nThanks in advance if anyone has any idea of what it might be.","like_count":"1","tags":[]},"responses":[{"author":"3psarf","resp_time":"over 2 years ago","resp_title":"RE: What is this on my X-Ray?","resp_content":"Well, it is upper left quadrant, I guess :) but my upper left side.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/42302/what-is-this-on-my-x-ray"},{"post":{"author":"scbain315","post_time":"over 2 years ago","post_title":"keeping my kidney healthy","post_content":"in November 2014, my right kidney was surgically removed in order to rid my body of cancer, in so doing, leaving my with one good kidney. I have arthritis and take Tylenol, daily.\nmy g.p. has suggested that I no longer take nsaids, so I haven't had naproxen or ibuprofen since the surgery.\nmy question, are there any other otc's that I should avoid, to help keep my kidney healthy.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/42197/keeping-my-kidney-healthy"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Chronic kidney stones","post_content":"I was first diagnosed with a kidney stone when I was 22. I am not 47. I believe I had them as a child but was never diagnosed.\nI have had countless lithtripsies, cystoscopies, uretoroscopies, etc., and passed thousands of stones. My latest ct urogram shows large stones in both kidneys, the largest are 12mm and 10mm, and many smaller stones, which I pass frequently. I had a ct done in July and the same stones were half the size they are now. I have pain constantly from passing the little stones, and I’m am worn out with it. I’ve had a 24 urine study done, blood work, and my doctor said nothing stood out in those tests. I get frequent UTI’s and have blood in my urine. I had an appointment with my urologist last week. He said he’d order a repeat ct in 6 months and would see me back in a year. I asked lots of questions about what else could be done to see why I make kidney stones, and if he was going to do anything about the large stones I have because obviously I’m not going to pass those, and I figure that’s what is causing my UTI’s. He just brushed me off. I can’t live like this anymore and am desperate for help. Opinions? TIA","like_count":"1","tags":["Kidney Stones"]},"responses":[{"author":"ksptabs","resp_time":"over 2 years ago","resp_title":"RE: Chronic kidney stones","resp_content":"As someone who works with many kidney stone patients and urologists, I highly doubt that your urine didn't show anything. Nearly all stone patients have acidic urine. It's ripe to form calcium crystals which then stick to oxalates and form stones. I'm just assuming you have calcium oxalate stones because those account for 80% of all cases. Just reducing the foods you intake with high oxalates is only part of the issue (if you want that list just email me at info@ksptabs.com). You need to get your urine more basic. You can buy urine test strips off of Amazon for $12. The ones I use at home are the exact manufacturer as those used in the urology lab they charge a fortune for. There's some recommended steps for that too so email me for tips.\n\nThere are different things you can take to help with your acidic urine. You'll also need to take citrate that is bound to potassium and magnesium. They help bind to oxalates instead of the calcium. You then need to be hydrating to flush these out. I was just like you and was super frustrated. I passed some, did the shockwave treatment, and the laser. Stints are the worst! My urologist created these tabs that affect the urine and I haven't had a stone in four years. I'm not trying to sell you on these, but it just makes it easier for daily consumption. You can take Citrate, potassium, magnesium, and B6 on their own but just make sure you take the right amounts. Just know that their IS something you can do about this. If your doctor won't suggest anything then get a new doctor! If you start making daily changes you will see a difference.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/42002/chronic-kidney-stones"},{"post":{"author":"peter7890","post_time":"over 2 years ago","post_title":"2nd Kidney Stone Within 4 Years","post_content":"I was in hospital for 4 days with 2nd Kidney stone within 4 years apart.\nDoes this mean I have Kidney disease ? The Doctors decided not to operate I dont know why. They said they want to wait until it comes out by itself. I get an Ultrasound scan done. But I now worry I may be getting Poly cystic Kidney Disease.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/41880/2nd-kidney-stone-within-4-years"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Kidney infection that might be impacting my liver?","post_content":"I have had a uti that has gone to my kidneys my left one for sure i had no typical signs of a uti. i was treated with a 7 day anti bitotic for it. i thought it went away but continued to have pain in my lower back, abdomen area. I noticed blood in my urine recently i went to the doctors they ran urine dipstick test, cbc, cmp, and sent off a culture. I had low grade fevers and very bad pain in my left side. My dipstick urine test showed traces of everything ketones, blood, leukocytes, nitrite, bilirubin. My bilirubin is what is concerning me my range amount was 4.0 with moderate tracing. I also have this white patch on my face that has appeared in the last two months and has gotten bigger. Im not sure this is just a uti anymore. should i be pushing for a closer look into my kidney and liver?","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/40293/kidney-infection-that-might-be-impacting-my-liver"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"How is kidney stone stent removed","post_content":"Hello, I am a male and have kidney stone and went to the hospital to have a stent placed in . There is two type of stent a large one and a small one. The first time I went they placed a large one. Had it in for 2 weeks, then I came back to the hospital to have the sent removed and to have a shock wave to break down the kidney stones.\n\nOnce they removed the big stent and did the shock wave, they then placed a small stent. My next visit is not in the hospital but in the doctors office. How will he remove this stent?\n\nI searched up on the internet and found a stent with a string image. The thing is there is no string hanging anywhere on me. So I want to know since we are not going to be in the hospital how will it be removed in his office.","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/40019/how-is-kidney-stone-stent-removed"},{"post":{"author":"wireddave","post_time":"over 2 years ago","post_title":"Guide wire left in me after Varicocele surgery - help!","post_content":"First, is this normal? After years of pain, assumed to be my lower back, I went to the ortho walk in. The xrays show a wire from my kidney to groin. Now broken into pieces with the ends curling up. VERY CONCERNED. Is this like a normal practice to leave this behind. Maybe it dissolves? Surgery was 17 years ago.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/40011/guide-wire-left-in-me-after-varicocele-surgery---help"},{"post":{"author":"sixwardtony","post_time":"over 2 years ago","post_title":"Kidney stones","post_content":"I was I was diagnosed with kidney stones a year ago my symptoms subsided(ed along with back pain )and I assumed they were gone however they have returned it's been a year should I be worried?","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"kindeystone101","resp_time":"over 2 years ago","resp_title":"RE: Kidney stones","resp_content":"My husband got kidney stones at 16, he is now 40. He just passed his 136th kidney stone. He has calcium oxalate stones. Been through the surgeries and 3 kidney drs over the years, which each dr tried everything the one before hadn't, and they all ended up saying sorry there is nothing else we can do for you. So now it's up to me his wife to figure it out. I too have kidney stones but have only had them 3 yrs and have passed 4. Still have a 6mm stuck in my left kidney. Something that has worked for him that I have had him try was brags grape vinegar or whitehouse grape vinegar, it's an apple cider vinegar but the grape helps it go down. I normally find the brags vinegar at Walmart, or foodlion. And the whitehouse grape on amazon. I have to watch what I cook and spices I use. I have to watch the salt intake of my husband and myself. No collard greens or turnip greens and cabbage is a big no no, but who can resist my homemade egg rolls lol. So hopefully this will help you. Good luck oh and drink a lot of water. And stay away from dark sodas coke, Dr Pepper etc.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/38185/kidney-stones"},{"post":{"author":"angie51361","post_time":"over 2 years ago","post_title":"Hi I have fourth stage kidney failure and just had blood work done.","post_content":"In the blood work I noticed that the white blood count UA was high. The number was 6 and the range that they had was 0 - 2. Should I be worried?","like_count":"0","tags":["Kidney Failure"]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Hi I have fourth stage kidney failure and just had blood work done.","resp_content":"I'd offer to help, but I'm not familiar with 'white blood count UA'. I know what white blood cells are, but the UA doesn't make a lot of sense to me. Could you elaborate a bit please? How is your creatinine? your electrolytes? your hemoglobin? Did the doc say it was stage 4?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/39887/hi-i-have-fourth-stage-kidney-failure-and-just-had-blood-work-done"},{"post":{"author":"bloodyleech","post_time":"over 2 years ago","post_title":"28 years old I am scared to death","post_content":"For the past month I've been having lower back flank pain.\nThat only goes away with Tylenol but increases when I eat or drink water/liquid/alcohol\n\nI have no\n*blood in my urine*\n\nBut I have experience\n\nA Metal taste in my mouth\n\nvery tired for a while\n\nHad a few fevers\n\nHad pain down to my groin area and testicles.\n\nHad diaherria for a full month\n\nAnd low flank pain for a month as well.\n\n\nI rushed to the emergency room 3 times but they always say I'm OK.... AND MY BLOOD looks normal. And I have no insurance; one last point; During my last visit the doctor performed an x-ray on me and said that my kidneys looked inflamed on the xrays.\n\nHe IV some type water/anti bloating liquid into me and the pain disappear about 80% the pain disappeared as soon as the IV WAS injected.\n\nI think I either have a kidney infection or became dehydrated from working so many hours at work.\n\nJust recently after 1 month of constant pain; the pain went away but I'm getting itchy ... Ughhhhh I'm.so frustrated.","like_count":"0","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/39518/28-years-old-i-am-scared-to-death"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Is this normal or healthy for patients taking prednisone?","post_content":"My father (40 years old) had swelling in his legs and the doctor said it was something that his kidneys were passing through his urine that was causing his legs to retain water. So about a year ago they perscribed him a bunch of meds to help him get back to normal. Well one of those is prednisone and he has been taking it daily and has gained quite a bit of weight in his belly, neck and face region. Is this normal or should he go see a doctor at Mayo Clinic in Rochester since we only live a couple hours away. And should he not be on it everyday for a year?","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Is this normal or healthy for patients taking prednisone?","resp_content":"It's normal. Prednisone has a tendency to puff up. If he has kidney disease, I'd avoid it like the plague.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/12783/is-this-normal-or-healthy-for-patients-taking-prednisone"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"urine smell","post_content":"there’s a distinct ammonia smell when i pee. i’ve been tested and i don’t have a uti or any std’s. i’m 30 now, but have had a bad kidney infection when i was really young, like 6. my gynecologist told me nothing was wrong but do i go see my regular doctor or a urologist or just chug all the water? according to the internet, i think i have a bladder or kidney stone but also people think i’m crazy. anyone else experience this?","like_count":"0","tags":["Kidney Stones","Dialysis","Kidney Cyst","Kidney Failure","Kidney Disease"]},"responses":[{"author":"dspizzirro","resp_time":"over 2 years ago","resp_title":"RE: urine smell","resp_content":"Go to the Doctor first! Do not play games with your health. What are you thinking!\n1\n"},{"author":"hessie28","resp_time":"over 2 years ago","resp_title":"RE: urine smell","resp_content":"Sounds like dehydration and you probably have to drink a lot more water. Urine should be clear. Should not be an odor. That’s what they told me with all my kidney stones. If you had a stone, you would know it. The pain from a stone is unbearable. Worse then Labor. You can go to Walgreens and buy UTI strips over the counter and test for infection. Or just go to your regular Dr. Let them do a test. If you do have something bad, it can turn into a severe Kidney issue. I did a search and it said dehydration, could be too much protein intake. Suppose t drink eight, 8 oz glasses of water per day. Urinate when needed. Don’t hold it. Make sure everything clean down there.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: urine smell","resp_content":"It's bad form to try to get a diagnosis in a health forum. As the previous person said, get to a doctor.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/31296/urine-smell"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Lifelong chronic symptoms rapidly reduced after taking potassium. Unknown cause. Would appreciate any theories or ideas!","post_content":"I’m very interested in your theories for my undiagnosed condition.\n\nI’m a 30 year old male that has suffered from a long list of chronic severe symptoms for most of my life. Dozens of specialists consultations and different tests and treatments have yielded no results.\n\nRecently, I tried a potassium gluconate supplement. I experienced rapid and dramatic reduction in all of my symptoms. This effect has been repeatable for 2 months. If I stop the supplementation, the symptoms return within a day.\n\nSevere, chronic symptoms improved:\n\n• Asthma and respiratory issues.\n• Nasal congestion.\n• Constipation.\n• Headaches.\n• Muscle cramping, weakness and pain.\n• Insomnia.\n• Palpitations.\n\nI’ve also suffered from unexplained osteoporosis since my twenties.\n\nIt would be life-changing to finally know what has caused me so much suffering throughout my life. This potassium effect is my first piece of evidence that might help me solve the mystery. I would appreciate any opinions and theories!\n\nI’m booked to see an endocrinologist. Suggestions of other recommended specialists are welcome. I’m taking 400mg to 800mg of potassium gluconate per day. I understand that this is within a safe dosage range. Previous years pathology show low but not out-of-range serum potassium levels.\n\nThanks! :)","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Lifelong chronic symptoms rapidly reduced after taking potassium. Unknown cause. Would appreciate any theories or ideas!","resp_content":"I'm sorry but this really doesn't sound like a kidney issue. If you suspect you are kidneys are a problem, you need to have some lab work and get a GFR number. If it's below 60, the potassium is doing great harm to your kidneys. It's great that it's helping reduce your other symptoms.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/31304/lifelong-chronic-symptoms-rapidly-reduced-after-taking-potassium-unknown-cause-would-appreciate-any-theories-or-ideas"},{"post":{"author":"worriedwashingtonwife","post_time":"over 2 years ago","post_title":"Im worried about my husband.","post_content":"My husband doesn't have any medical and I'm worried about him. He takes no medication and doesn't drink nor do drugs of any kinds and his kidney areas are hurting him and this morning his pee was orange in color does anyone have any ideas at all what it could be.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Im worried about my husband.","resp_content":"If nothing else, he should get some lab work done. If you suspect it's his kidneys, look for the GFR results. If the number is 60 or greater there is nothing to worry about. At this point I would recommend he drink plenty of water. I know it's a difficult decision when you don't have insurance, but if there is something serious it needs to be checked out. There's always the possibility of going to an emergency room where they cannot refuse treatment if you are unable to pay.\n\nHopefully, since I'm replying to this two months after you posted that you have gotten a diagnosis and solution to the problem.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/33222/im-worried-about-my-husband"},{"post":{"author":"imrutwo1","post_time":"over 2 years ago","post_title":"sudden lower back weakness without pain","post_content":"Have been having weakness in lower back enough to force a sit down, last under 5 minutes?","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: sudden lower back weakness without pain","resp_content":"I hope by now this is either cleared up or that you have seen a doctor. It doesn't sound like anything related to kidneys.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/34150/sudden-lower-back-weakness-without-pain"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"UTI OR BLADDER CANCER?","post_content":"I went to the Er yesterday I was diagnosed with a uti I have blood in my urine doctor prescribed cipro about an hour ago the blood is gone. It still hurts to urinate, but should I be worried about bladder cancer. I'm surprised the bleeding stopped that quick. I am 25 years old. They did not rule out kidney stones all they did was a quick urinary analysis. I also saw blood clots in my urine.","like_count":"0","tags":[]},"responses":[{"author":"Constance1110","resp_time":"over 2 years ago","resp_title":"RE: UTI OR BLADDER CANCER?","resp_content":"I would follow up with your regular doctor. Do you have a history of kidney stones?\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: UTI OR BLADDER CANCER?","resp_content":"After an ER visit, you should always follow up with your primary care physician. By the time I'm responding to this you should be feeling much better. I'm one of those people who tend to get a UTI every now and then. Your symptoms in the emergency room presented as a UTI. That's why all they did was the urine dip. After they do the initial urinalysis they always send the urine to the lab to check for bacteria and other things. If there was anything serious, they would have notified you. Of course, I'm not a doctor but I do hope I was right about this and nothing more serious developed.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/36455/uti-or-bladder-cancer"},{"post":{"author":"brunonator","post_time":"over 2 years ago","post_title":"Kidney disease or hyperparathyroidism?","post_content":"I'm trying to figure out what is wrong with me, it has been a journey for me to try and rule so many different things out. I constantly feel really cruddy, everything hurts.\n\nI'm 25 Male, 340lbs. history of high cholesterol/triglycerides and high blood pressure.\n\nI have what I describe as visible calcifications in my dip joints from trauma. I have ruled out gout(low uric acid levels), osteoarthritis(herberden nodes), arthritis(13 Rheumatoid factor). There is no visible sign of herberden nodes under x-ray examination.\n\nMy main hunch is that it is pseudogout being caused by elevated pth levels despite being normocalcemic.\n\nI've been tested twice for pth levels along with calcium\n\n1st Test-\nPTH 71pg/mL (14-64 range)\nCalcium 9.4 mg/dL(8.6-10.3 mg/dL range)\nVitamin D - 25ng/mL (30-100 range)\n\nThe endo requested I go on vitamin D because she believes it is secondary hyperparathyroidism. After 3 months of 50k IU of vitamin D2\n\nThe vitamin D supplementation gave me extreme and constant trips to the bathroom, 5-8 bowel movements daily.\n\n2nd Test-\nPTH 81\nCalcium 9.4\nVitamin D- 27\n\n\nI also have several other calcium results that range from 9.4-10.1 . Bowel movements normalized after she requested I go on 2000 IU of D3, which I instead opted to buy cod liver oil of 400IU of D3.\n\nI suspect that the reaction to high vitamin D dosages indicates fat soluble vitamins malabsorbtion. One of the possible causes was gallbladder disease.\n\nI have not passed any kidney stones or anything, but after going to the ER with pain in my stomach, I insisted that they check my gallbladder(ultrasound) after reading possible causes of vitamin D malabsorbtion. Indeed I was found to have a fatty liver (Hepatic steatosis)along with multiple gallstones(cholelithasis).\n\nAlso something no one mentioned to me was that my kidney walls were thickened.\n\nThe right kidney measures 11.8 x 5.2 x 6.0 cm\n\nthe average size of an adult human kidney is about 10 to 13 cm (4 to 5 inches) long, approximately 5 to 7.5 cm (2 to 3 inches) wide and about 2 to 2.5 cm (1 inch) thick.\n\nMy main suspicion is that there must be stones in my urinary system also or nephrotic syndrome, high blood pressure, high triglycerides\n\nI have to meet with a surgeon soon to discuss treatment of my gallbladder, they will probably insist on taking it out.\nHowever, I feel that there is another condition causing the stones(hyperparathyroidism) and would probably seek treatment with ursodeoxycholic acid.","like_count":"0","tags":["Kidney Stones","Kidney Disease"]},"responses":[{"author":"brunonator","resp_time":"over 2 years ago","resp_title":"RE: Kidney disease or hyperparathyroidism?","resp_content":"I forgot to mention that i had the tissue transglutaminase blood work done and it showed as negative, so the malabsorbtion cannot be due to celiac disease, perhaps crohns?\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Kidney disease or hyperparathyroidism?","resp_content":"Stop guessing and ruminating over your numbers. The hyperparathyroidism could possibly be treated with calcitriol, which is mainly used for chronic kidney disease. You didn't mention whether you've had upper and lower G.I. testing. That might be a place to start. If I were you I would get one doctor to coordinate your treatment and compile all of the information from your specialists. It seems like one hand doesn't know what the other hand is doing. As a result, you seem to be left to your own devices to speculate on what the problem might be. Best of luck.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Kidney disease or hyperparathyroidism?","resp_content":"If you really want to know if it's chronic kidney disease, the only lab test number that really matters is your eGFR. if it's below 50, I would get advice from a nephrologist. You can Google the different stages and what the numbers represent.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/36626/kidney-disease-or-hyperparathyroidism"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Kidney pain and rash","post_content":"About a week and a half to two weeks ago I started having pain in my right kidney, and a few days later a rash appeared. The kidney pain went away, but yesterday it came back and seems to be getting worse. The rash doesn't appear to have changed any yet. If the rash is rubbed over it feels as if that part of my body was set on fire. The rash is on the right side of my stomach and there are some places on the right side of my back. The places on my back look more like bites than a rash.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Kidney pain and rash","resp_content":"This doesn't sound like it's related to kidneys at all. What it does sound like is shingles. You need to get to a doctor ASAP.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/36710/kidney-pain-and-rash"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Urgent Incontinence","post_content":"I am a 20 year-old male, but I have not suffered prostate cancer, stroke, diabetes or any of the other common reasons I've found that tend to cause the urgency incontinence. I experience leakage multiple times daily, and get very immediate and sudden urges to urinate, which I am at times unable to control. If I drink alcohol at night, I can almost expect to wake up soaked the next morning. I didn't stop wetting the bed until I was about 14, but over the past year or so, my incontinence has increased such that I may be wetting the bed once or twice a week (but then I might go a month without doing so).\n\nOther information that may be entirely irrelevant, but might also not: I suffer from premature ejaculation. Also, especially if I am wearing pants with a tight wasitline, if I get physically aroused and do not ejaculate I can get slight swelling on my pelvis and testicles, combined with a quite intense dull pain.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Urgent Incontinence","resp_content":"Note: I realize this isn't really a kidney thing, but it seems like the nearest closest category (or does this maybe belong in neurological?\n\nAlso I forgot to mention that whenever I pee will stop the flow and (slowly) count to 10 before continuing. I also do kegels but not regularly nor in any regimented way.\n\nAlso, day-time incontinence stopped being very common when I was around 8 or 9, but never really went away. As I mentioned before, it is more common now.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Urgent Incontinence","resp_content":"Sorry, but this isn't even close to being a kidney thing. It sounds a little bit more bladder related or something else completely. If you haven't gone to a doctor, don't try to be stoic or get your answers from posting questions like this in a forum. You need to get to a doctor.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/37974/urgent-incontinence"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Lisinopril and Lutera","post_content":"Hi, I am a 20 year old female with a quick question about Lutera birth control pills. 10 years ago, I was diagnosed with a kidney condition and resulting borderline high blood pressure from it. After several surgeries to repair my kidneys and being on Lisinopril (10 mg) once a day for my hypertension, my kidneys function normally and my blood pressure stays around 105/68 at most times. I have talked to my kidney doctor regarding my beginning to take Lutera as a birth control method, and she said she sees no restrictions regarding combo BC pills and my hypertension, since it's been well controlled for 10 years. My OB/GYN agreed that I should have no issues, but did mention an increase for strokes and heart attack for this medication with patients that have HBP. I trust both of them but I'm still a bit worried, can you give me some advice? If this helps, I am a 20 year old healthy female, 4'10\", 105 lbs, and I eat a very healthy diet and exercise 6x a week.","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"madchickenwoman","resp_time":"over 2 years ago","resp_title":"RE: Lisinopril and Lutera","resp_content":"Your doctors sound spot on with their recommendations. I would trust them completely at this point.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/38074/lisinopril-and-lutera"},{"post":{"author":"ge20712","post_time":"over 2 years ago","post_title":"ULTRASOUND OF TRANSPLANTED KIDNEY","post_content":"A few weeks ago I had an ultrasound (routine by orders of my kidney doctor). of my transplanted kidney that I have had for 11 years now. The report came back and it stated that it maybe helpful if I had a ct scan of my pelvis. My question is that what is the purpose of taking a ct scan of pelvis after ultrasound has been performed on kidney? What could it be that they are possible ruling out or looking for?","like_count":"0","tags":["Kidney Stones","Kidney Cyst","Kidney Disease"]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: ULTRASOUND OF TRANSPLANTED KIDNEY","resp_content":"You need to ask your doctor why. It could be anything and everything\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/38072/ultrasound-of-transplanted-kidney"},{"post":{"author":"savanna15","post_time":"over 2 years ago","post_title":"Kidney Reflux","post_content":"I was born with Kidney Reflux and for the people who don't know what that is it's where the flap on the kidneys doesn't close. My kidneys hurt everyday and the doctors had to do surgery when I was a little girl and it still hurts after almost 16 years","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/37367/kidney-reflux"},{"post":{"author":"Constance1110","post_time":"over 2 years ago","post_title":"Kidney Disease due to Autoimmune RPGN","post_content":"3 years ago I was diagnosed with RPGN (Rapidly Progressive Glomerulonephritis)\nI went through almost 11 months of IV chemotherapy, I can't tell you how many steroids. Got a little better then went down hill again. Back on steroids then another solid month of weekly IV chemotherapy. I'm staying stable at stage 4 kidney failure right now. Has any one else experienced this kind of kidney disease/failure? I'd like to connect to ask questions.","like_count":"0","tags":["Kidney Stones","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/37289/kidney-disease-due-to-autoimmune-rpgn"},{"post":{"author":"gagirl0608","post_time":"over 2 years ago","post_title":"Blood in Urine - Teenage Boy","post_content":"So I am panicking at the moment. I took my teenage son for a normal checkup and they found moderate blood in his urine. No other symptoms. Nothing else abnormal about dipstick test. The dr. is ordering an ultrasound and a followup test in two weeks, but I am scared at the moment. He is otherwise healthy. He just finished taking Accutane (Claravis) for acne, but finished weeks ago and taking no other meds. What could this be??","like_count":"0","tags":[]},"responses":[{"author":"Constance1110","resp_time":"over 2 years ago","resp_title":"RE: Blood in Urine - Teenage Boy","resp_content":"Is he a heavy lifter/workout person? Does he take extra workout supplements?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/34872/blood-in-urine---teenage-boy"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Stag horn kidney stone","post_content":"Have a stag horn kidney stone. What are the treatment options available?","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/37009/stag-horn-kidney-stone"},{"post":{"author":"ahmed5960","post_time":"over 2 years ago","post_title":"Kidney donation","post_content":"I am 40 years male, i am a kidney donor for my father, my health is good, no hypertension or diabitic, my question : can i drink alcohol? And how many can i drink? Usually before donation i was drink 3 times every 4 month.\nThanks.","like_count":"0","tags":["Kidney Cyst","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/36733/kidney-donation"},{"post":{"author":"wfm49","post_time":"over 2 years ago","post_title":"Kidney removal and Hallucinations","post_content":"My 89 year old father just had a cancerous kidney removed. Thankfully, the cancer was contained in the kidney. He is having some hallucinations and confusion. I know that persons with a UTI can have such symptoms as well as persons suffering from kidney failure, so I am wondering if his body's adjustment to functioning with 1 kidney can have this affect?","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Kidney removal and Hallucinations","resp_content":"It could also be a side effect from the anaesthesia. How long ago was the surgery. It can sometimes take a couple of weeks for those very strong drugs to fully clear your system.\n\nCheck with the docs\n"},{"author":"wfm49","resp_time":"over 2 years ago","resp_title":"The surgery was 12/12. He was moved to a skilled nursing facility after his hospital stay. The hallucinations continue. We spoke to the doctor about it before he was moved, and she said that it happens when someone is hospitalized for a lengthy time because they lose track of the world going round. But this isn't just about losing track of time. He \"sees\" my Mom, who died 2 years ago. He becomes a child again, he goes golfing in Florida, etc. A wide variety of things and he says they are so very real. I live 400 miles away. The sibling who lives close by seems to know more than the doctors, so isn't willing to contact the doctor about the situation. He has medical POA, so I'm left with questions for which I can't get answers.","resp_content":"Reply\nmrscora01\nover 2 years ago\nWhat meds is he on? I have a lot of very clear hallucinations when I take an antifungal medication (anything from the troche lozenges a full blown pill like fluconazole). Sounds like a drug reaction.\nReply\nwfm49\nover 2 years ago\nNot sure what the names of them, but he only takes a BP med and one to lower cholesterol. He's in amazing health considering his age. The hallucinations basically started in the past 3 months, but have gotten worse since the surgery.\n"},{"author":"mrleebadger","resp_time":"over 2 years ago","resp_title":"RE: Kidney removal and Hallucinations","resp_content":"Hello yes the body has to adapt and has to have some time to adjust medications offen don't help unless its for the kidney itself because toxins get cleaned out through the liver and then out through the kidneys I have read that a tea or broth made from the silk found on a regular corn cob has a very good cleansing affect on the kidneys also lemon water please do some research on this I often go to the universities of natural medicine good luck best regards.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/35415/kidney-removal-and-hallucinations"},{"post":{"author":"niceguy610","post_time":"over 2 years ago","post_title":"Kidney failure survivor. Now I have pain in upper left thigh/lower abdomen area after drinking alcohol","post_content":"Hello,\n\nI am looking for advice. When I was about 20-years-old I had kidney failure due to a drug overdose. I got dialysis for about a week. I got very lucky and my kidneys came back and started working again. After that I quit drinking and drugs for about 10-years.\n\nAnyway fast forward I started drinking and using drugs again about 2-years ago. Stupid I know... Everything was fine at first but more recently I've been getting a weird pain in my upper left thigh/lower abdomen area after a night of heavy drinking and partying. It only happens after drinking/partying and it has been getting worse. Logically I'm thinking I need to quit drinking again. This time for good.\n\nMy question is (probably a dumb one) should I quit drinking for good or just do it on special occasions? Is there a chance I am developing kidney stones due to drinking?\n\nThank you all so much.","like_count":"0","tags":["Kidney Stones","Dialysis","Kidney Failure"]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Kidney failure survivor. Now I have pain in upper left thigh/lower abdomen area after drinking alcohol","resp_content":"Given that pain, it sounds more like liver problems to me, and not kidney. You really need to see a doctor. And quit the drugs and drinking.\n1\n"},{"author":"niceguy610","resp_time":"over 2 years ago","resp_title":"I will do both... Thank You.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/34878/kidney-failure-survivor-now-i-have-pain-in-upper-left-thigh-lower-abdomen-area-after-drinking-alcohol"},{"post":{"author":"qiennax","post_time":"over 2 years ago","post_title":"PCNL Experiences","post_content":"I am posting this because I don't think there is enough information available of what PCNL surgery is like. This is only my experience, I'm no professional, but I hope it helps to reassure and prepare others.\n\nI have Cystinuria, a genetic kidney disease where my kidneys produce too much cystine and my kidneys think sparkly yellow stones are a great idea. I had a mass in my left kidney that got blasted with lithotripsy when I was seven but we were only just told about cystinuria recently when we discovered stagnorn stones in both my kidneys. My kidney function is 78% in my right and 22% in my left, which added some risk to the situation.\n\nThey decided to clear my right kidney first, since that is the most important, and so one week ago I went into hospital for a right PCNL.\n\nWhen they set you up in theatre, you fall asleep on your back, but they roll you onto your side, once out, so they can access your kidney. A scope is put through your side into your kidney and a guide wire is threaded up through your urethra etc so they don't get lost. Various tools are put through the scope to break up and extract the stone fragments.\n\nWhen I woke up, the first thing I knew was that I needed to pass urine so badly it hurt. This, of course, wasn't the case. The uege to urinate is common, they had emptied my bladder and in my case my bladder and muscles were spasming. A day later the spasms meant I still couldn't pass urine and they put an indwelling catheter in to relieve the strain on my smaller left kidney. This pain was a 10 on the pain scale. Before your surgery, ask if you will need a catheter and ask if it can be inserted while you are under. My next one will be.\n\nI had two J stents inserted in the surgery. These are tubes that go from your kidneys to your bladder in your uretas. They allow urine to pass both ways, which meant until I got the catheter, my left kidney was sending waste to my bladder and then up to my right kidney.\n\nFinally, I had what is called a nethrostomy tube. It is a thin tube left in place of the scope to allow your kidney to be drained while you heal. It's a safety measyre in case your kidney clots up at the entrance to your stent.\n\nHere is where things went wrong for me. My nethrostomy tube somehow got dislodged from my kidney and got stuck in the surrounding fatty layer. This resulted in acute pain that would only subside with iv morphine. The nethrostomy site leaked every day and had to be redressed a lot.\n\nMost of the nurses hadn't really dealt with nethrostomy tubes, lor hadn't encountered my type. Some assumed I was exaggerating the pain. Some thought my tube was blocked with clots and then some of those people tried to flush it with saline. Flushing the tube can be risky, but seemed to give results so they kept doing it. Sometimes nothing would drain, I would be curled in the foetal position in bed unable to move or barely breath, and they would refuse iv morphine.\n\nThey will make you get up and walk around the next day. This is to prevent clots and pneumonia. They will also be rather obsessed with when you poop. I got constipated and didn't go for four days. The catheter made it harder for me, but that's all working fine now.\n\nThey made me wait days for a special xray scan with a contrast solution. This is a standard procedure after PCNL so they can track your kidney's drainage into your bladder to see if it is safe to remove the stents and nethrostomy tube. It's also to make sure your surgeon got all the stones.\n\nI was in so much pain, they had to slide me from my bed to the table under the enormous fancy machine. The staff wear lead vests and the room has to be kept cold for the machinery. When they injected the dye, that is when they realised the tube was dislodged.\n\nThis raised questions of how was my tube leaking/draining if it wasn't in my kidney. There were talks of sending me back into surgery days before Christmas, lucky for me the urology team decided to take the nethrostomy tube out.\n\nTaking the tube out is uncomfortable, but not as bad as you expect. When you're sent to your ward, after surgery, the orderlies bring a wrapped up plastic doohicky that can go down into the tube, 'unlock' it and pull it out. It's over quickly, especially if you're exhaling while the tube comes out. My pain instantly subsided when it came out. They observed me overnight, took out the catheter and discharged me lunchtime the next day.\n\nORDINARILY, upon a successful scan, they would remove your nethrostomy tube and stents all at once under a local anaesthetic. Because of my complications that were unnecessarily dragged out, I'll be getting a CT scan and then they'll be removed after Christmas.\n\nI hope this is helpful/insightful. I have to go back for my left kidney once I've recovered and hopefully I'll be able to add thoughts of a more standard experience then.","like_count":"1","tags":["Kidney Stones","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/34885/pcnl-experiences"},{"post":{"author":"almalibari","post_time":"over 2 years ago","post_title":"Artificial Kidney surgery","post_content":"Asking about prototype artificial kidney treatment , any surgery implemented or still under researches ?","like_count":"0","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/34645/artificial-kidney-surgery"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Ecoli bacterial infection","post_content":"I had a EBI about 6 yrs ago that caused an abscess on my kidney or the abcsess caused the infection they didnt know. It was less than a week from killing in just 2 weeks. Am i more accessable to getting another infection since i had one before.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Ecoli bacterial infection","resp_content":"I don't think you're any more likely to get it again than anyone else. I found this online that has some info about things that can up your risk http://www.mayoclinic.org/diseases-conditions/e-coli/basics/risk-factors/con-20032105\n"},{"author":"sandythompson","resp_time":"over 2 years ago","resp_title":"As the above poster said, I don't think you're at any more risk of catching the same infection twice.","resp_content":"\nOne thing to be mindful of is your immune system might not have fully-recovered. This would make you more at risk for other viruses and bacterial infections apart from E Coli.\n\nIf you are specifically worried about E Coli, a good thing to do is clean your washing machine! I know, sounds silly, but a scientific report found that 1 in 10 washing machines had traces of E Coli (and other bacterial pathogens).\n\nSource: https://helpwiththewashing.co.uk/blog/clean-washing-machine/\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/7694/ecoli-bacterial-infection"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Solitary kidney: transplant possible?","post_content":"My friend has a solitary kidney since birth.\nIs it possible for him to get a kidney transplant should his solitary kidney ever fail (given he meets all other criteria)? We haven't found any conclusive information and two of his doctors have said contradictory things.\n\nThank you so much for taking the time to answer.","like_count":"0","tags":["Kidney Failure"]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Solitary kidney: transplant possible?","resp_content":"Is his kidney failing? Why do you think he would need a kidney transplant?\n\nthe bottom line is that kidney failure will affect both kidneys, so losing both, or only losing the single kidney you were born with is the same thing. It's a fairly long process to get all the testing done to qualify for a transplant, but as long as you meet the criteria, there should be no problem.\n\nKeep in mind that there are many, many people who live their entire lives with only one kidney and never need a transplant. In fact, I've heard numerous stories of someone wanting to donate to a friend or family and finding out that they only have one and can't donate.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/33260/solitary-kidney-transplant-possible"},{"post":{"author":"henrisennui","post_time":"over 2 years ago","post_title":"Third Stage Kidney Disease","post_content":"I was diagnosed in 08/2017 with Third Stage Kidney Disease whilst I was hospitalized for two weeks. I collapsed in my Suite and the VA authorized an ambulance to the closest hospital which happened to be a civilian one. They said that I was dehydrated to the point of death. I want to know what encompasses the Third Stage Kidney Disease diagnosis. Tang-Q wery munch! Henry Rex Bils","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/32630/third-stage-kidney-disease"},{"post":{"author":"iilindiangirl","post_time":"over 2 years ago","post_title":"Ive been haveing diluted ua's i dont do drugs i dont drink alcohol been sober since August 11 2016 n since then ive been finding out im n bad shape my levels r below 20 i know its my kidneys something r medicine i take kapra lisnopril flomax rantidine","post_content":"Why is my ua diluted","like_count":"0","tags":["Kidney Stones","Kidney Failure"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/31907/ive-been-haveing-diluted-ua-s-i-dont-do-drugs-i-dont-drink-alcohol-been-sober-since-august-11-2016-n-since-then-ive-been-finding-out-im-n-bad-shape-my-levels-r-below-20-i-know-its-my-kidneys-something-r-medicine-i-take-kapra-"},{"post":{"author":"jaypaul207","post_time":"over 2 years ago","post_title":"Peeing blood","post_content":"Hello\n\nMy name is JP and I am 21 years old and I have been peeing blood irregulary. This began 6 months ago and I peed blood about once a week for a month. After that, it disappeared until this week. I don't have any pain while peeing. I also recently noticed red flakes in my pee. I took an urinalysis and they ruled out infection and stds.\n\nUnfortunately I do not have insurance and the exams will cost me around a grand. I'm in college and do not have the funds.\n\nI know I will need to conduct the exams eventually but I was hoping to get some opinions on what is occurring.\n\nThanks for the help.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/31163/peeing-blood"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Lifelong chronic symptoms rapidly resolved after taking potassium. Unknown cause. Appreciate any theories or ideas.","post_content":"I’m very interested in your theories for my undiagnosed condition.\n\nI’m a 30 year old male that has suffered from a long list of chronic severe symptoms for most of my life. Dozens of specialists consultations and different tests and treatments have yielded no results.\n\nRecently, I tried a potassium gluconate supplement. I experienced rapid and dramatic reduction in all of my symptoms. This effect has been repeatable for 5 weeks. If I stop the supplementation, the symptoms return within a day.\n\nSevere, chronic symptoms improved:\n\n• Asthma and respiratory issues.\n• Nasal congestion.\n• Constipation.\n• Headaches.\n• Muscle cramping, weakness and pain.\n• Insomnia.\n• Palpitations.\n\nI’ve also suffered from unexplained osteoporosis since my twenties.\n\nIt would be life-changing to finally know what has caused me so much suffering throughout my life. This potassium effect is my first piece of evidence that might help me solve the mystery. I would appreciate any opinions and theories!\n\nI’m booked to see an endocrinologist. Suggestions of other recommended specialists are welcome. I’m taking 400mg to 800mg of potassium gluconate per day. I understand that this is within a safe dosage range. Previous years pathology show low but not out-of-range serum potassium levels.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/30693/lifelong-chronic-symptoms-rapidly-resolved-after-taking-potassium-unknown-cause-appreciate-any-theories-or-ideas"},{"post":{"author":"onyxmailbox","post_time":"over 2 years ago","post_title":"Plausible Injuries for Story","post_content":"Hi! I don't quite have a question that relates to me, but I am writing a story where a character is in a car crash of great severity (they are a pedestrian). I need my main character to donate something to save them, but I can't find something to match what I need. I suppose what I'm asking, do you have any injury reccomendations that fit these requirements, or would a kidney transplant be appropriate in this situation? Thanks for any answers to help out a struggling writer!!!","like_count":"0","tags":["Kidney Failure"]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Plausible Injuries for Story","resp_content":"Sorry, but kidney transplant and kidney failure is not a good plot device if you want something dramatic - I'm a writer too as well as a long term kidney patient. Kidney disease is long, slow and torturous. And dialysis can easily keep you alive for years on end. So a traumatic injury to the kidneys would simply mean swiftly being put on dialysis (insert small catheter, hook up to machine, no big deal to anyone but you).\n\nLiver might be more of an idea as there is no such thing as dialysis for liver patients. And families can donate half a liver, but work up takes some time, so it's not something you can do in a hurry. So that would be out too if catastrophic injury was involved.\n\nWhy not do something more common like having family donate blood to help support their loved ones who have been in the accident? Lots of folks don't think of this.\n\nKeep up the writing and researching\n"},{"author":"ckd5caregiver","resp_time":"over 2 years ago","resp_title":"RE: Plausible Injuries for Story","resp_content":"Google \"lung transplant denied Utah \" and you'll find a story about a young man in need of a transplant due to an infection that might offer inspiration. I agree that CKD isn't an interesting story line unless you make it a young person and somehow dramatic such as they are a brilliant scientist on the cusp of curing cancer but that's probably been done a few times over. CKD in need of a transplant is, of course, life threatening but also quite common and kidneys are the easiest organ to come by. I would go with heart or lungs. You could write a fascinating tale of fecal transplant I suppose and then no one has to die.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"With Selena Gomez in the news talking about her recent kidney transplant -- might be something to write about.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/19496/plausible-injuries-for-story"},{"post":{"author":"itucker1025","post_time":"over 2 years ago","post_title":"Back Pain","post_content":"Hello, I'm not really sure what is happening so I thought i'd ask.\nThis morning around 5:30 am I woke up to pretty sever back pain, just below my ribs on both sides. It woke me up and I was unable to get the pain to a tolerable level until I took a warm bath. I have also been very nauseous and dizzy. This morning after my second bath around 8 i threw up a few times. I think i might be dehydrated because I didn't drink much water yesterday and my urine was pretty yellow this morning. Its now been almost 12 hours and my pain has went from a 9.5 maybe even 10, to about a 5. I have lots of water and fluids, is there anything else I should do because i'm not sure ill be able to fall asleep tonight if its still this bad.","like_count":"0","tags":[]},"responses":[{"author":"ckd5caregiver","resp_time":"over 2 years ago","resp_title":"RE: Back Pain","resp_content":"Pain level 1o is you're unable to carry on a conversation and you're writhing in pain. If you were laying on your bed writhing in pain and unable to even carry on a conversation, which is a level 10, I would seek immediate medical attention. If you can walk into the ER without assistance, you're not in level 1o pain. Low back pain can be caused by many things. If you suspect a kidney infection, only a healthcare provider can diagnose that. That brings us back to go to the doctor. I hope you're feeling much better by now and all is well with your health.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/29906/back-pain"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Had a kidney stone removed need help asap","post_content":"I had a kidney stone removed about 2 days ago. It was 5mm they didn’t blast it they removed it whole. Ever since waking up from surgery I have been in some intense pain. Blood in pee, INTENSE pain when urinating. Bloated and pain in abdomen. The meds they gave hydro/ace 5-325mg have not worked at all. So my question is, is there anything at all that can help my pain? Should I use heat or cold to help with pain? I noticed a hot bath is the only thing that work. But I read that heat can open on wounds and cause more bleeding but cold doesn’t help with my pain? Please if anyone know what to do it would be greatly appreciated! Thank you","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"ckd5caregiver","resp_time":"over 2 years ago","resp_title":"RE: Had a kidney stone removed need help asap","resp_content":"Hopefully by now you have already seen a physician. After a ureteroscopy to remove a stone I had severe pain, pain with urinating and bloating. I called the hospital and they said severe pain was normal. I waited until I could no longer stand and had urine dribbling at all times. I had to call an ambulance. At the ER they found my bladder was close to rupturing due to severe urine retention. My bladder was so damaged because of how long I waited in excruciating pain that it took 2 weeks before I regained the ability to urinate on my own. I had to have an indwelling catheter and ended up with a severe infection. Hopefully you were only experiencing post op pain but I wanted to offer you this cautionary tale to seek medical care if the pain seems disproportionate to the procedure.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/29826/had-a-kidney-stone-removed-need-help-asap"},{"post":{"author":"dlowen53","post_time":"over 2 years ago","post_title":"Dialysis, creatinine levels, and their relation to short-term memory loss","post_content":"The last couple of months, I've been having bouts of short-term memory loss; more commonly referred to as \"brain farts\". I put my cell phone down and forget where it is. I go into my room to do something and I can't remember what it was. I dial a phone number that I've known for years and I end up having to look it up. That kind of thing. I told my social worker who represents 180 dialysis patients about this. I simply mentioned it in passing and she matter-of-factly said that dialysis can sometimes cause short-term memory loss. I did some research online regarding the possible connection, but I could not find anything definitive on the subject other than a \"side bar\" indicating the increase of creatinine levels can cause that if the dialysis is not as efficient as it should be. Two grafts have failed 3 days after they were created. I'm still using ports on the right side of my chest. I'm running at about 75% efficiency on the machine for 4 hours M/W/F. Is this a conceivable situation? Thank you","like_count":"1","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Dialysis, creatinine levels, and their relation to short-term memory loss","resp_content":"Here's the bottom line. You've got a lot of crap (besides just the creatinine) floating around in your bloodstream. And this will clog things up, including your brain function. Hemo dialysis through a port (depending on how well your port works) will give you at the very most, maybe 7 or 8 % of normal kidney function. Maybe 10%? Enough to keep you alive but that's about it. If any other organ were operating at only 10% (heart, lungs, liver, stomach) you wouldn't be able to think well either.\n\nAre you listed for transplant? I can't recommend it enough. Granted, the first year after transplant can be tough and you can get prograf-brain, but you will still be functioning a lot better than on dialysis. To say nothing of the much longer life expectancy.\n\nNot thinking that clearly or as well as you normally do is perfectly normal. The rest of your body has gotten used to not feeling well,. But your brain will protest a bit more.\n"},{"author":"dlowen53","resp_time":"over 2 years ago","resp_title":"\"Not thinking that clearly or as well as you normally do is perfectly normal. The rest of your body has gotten used to not feeling well,. But your brain will protest a bit more.\"","resp_content":"\nAbsolutely right. My body has convinced me that I'm doing great. I'm a hospital outpatient. I walk into dialysis, I walk out. I go in, sleep for 4 hours, and leave feeling alright. I'm in the stages of getting the forms filled out for a transplant. I am aware it's a better alternative. Just like anything else worth having, one has to jump through hoops to get it. Thanks for the reply. This means more to me than you know. Prograf-brain .... is that like \"chemo brain\"?\n1\nReply\nmrscora01\nover 2 years ago\nYup. Chemo-brain, pregnancy-brain, prednisone-fog. All the same thing for chemicals interfering with your poor old brain. All these things will fade.\n\nHow long have you been on dialysis? I found that my health was very slowly improving while on dialysis. That was due to a tremendous amount of effort on my part, and probably would not have continued. But I did get used to it and even went for a week to DisneyWorld after almost a year on hemo (shortly before my transplant\nReply\ndlowen53\nover 2 years ago\nTomorrow will be my 292nd treatment. I have known patients that are going on their 10th year of dialysis. They say average life expectancy after start of dialysis is 5-6 years at my age. I am 64. Can't see that happening to me, though. Just something I know, I guess. Anyway, I understand transplant waiting lists are a couple years once the ball gets rolling. I watch a lot of You Tube vids about kidney transplants. Next Thursday, I have an appointment with a hematologist. The following Tuesday, I have a follow-up appt. with my vascular surgeon. Have a failed graft in my upper left arm and another failed graft in the upper left wall of my chest. Got a thrill from each one after they were created, but it lasted about 4 days. Hearing it through my stethoscope, the blood flowing through the new graft sounded like a factory in full operation. Then, 4 days later, it was as quiet as Lansing, Michigan after they filed bankruptcy. The vascular surgeon has suggested that if the hematologist indicates I have a coagulation problem, he will do another graft in the upper left arm \"going in the other direction\", as he put it. Then he'll prescribe blood thinners. I get enough broken blood vessels as it is. Sometimes I look like a leper. My concern is that if I cut myself shaving, it'll probably be written down in the EMT's log as a self-sacrifice.\nReply\nmrscora01\nover 2 years ago\nI've never bought that \"5 - 6 year life expectancy\". I suspect that it's been confused with \"4 - 5 year wait for transplant\". Additionally, since a large percentage of dialysis patients are quite a bit older, that 5 - 6 years doesn't really apply to everyone. Maybe a specific demographic (females with heart disease over the age of 78......etc) you can make that prediction. But the truth is that averages don't ever predict any one patient. Each person needs to be looked at individually. If you want to know more about transplant and get some advice, visit TransplantFriends. Lots of transplant people there of all organ types and all ages.\n\nhttp://transplantfriends.com/\nReply\ndlowen53\nover 2 years ago\nThank you for the site. I have it bookmarked so I can go back to it frequently.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/28020/dialysis-creatinine-levels-and-their-relation-to-short-term-memory-loss"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Urination Troubles!?","post_content":"Hi. So lately I’ve been having pain when urinating. Whenever I do urinate, extreme pressure is felt on my bladder and it hurts. I have to go pee a lot, but when I go, almost nothing comes out. Lately it’s been worse. While I pee, a sharp pain is felt. And when I wipe, I can see pale pink on the toilet paper. Blood, I’m assuming. Along with that, I see a fleshcoloured, black and red thing, almost like skin on the paper. After I pee, I get occasional sharp pains that go for fifteen minutes after urinating, along with just discomfort the whole time. I don’t know what to do, and I have NO idea what’s wrong with me. Help!?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/28126/urination-troubles"},{"post":{"author":"omghotdog","post_time":"over 2 years ago","post_title":"Never need to urinate.","post_content":"Hi All.\n\nFor the last month or so I have almost not at all felt the need to Urinate and when I do it is a very weak stream and doesn't last for very long at all. On average drink about 3 litres of water a day. I haven't noticed any weight gain at all. It's really starting to make me worried. Other symptoms I have been feeling are dry eyes and mouth however they could be completely unrelated.\n\nCan anyone give me advice on what it could be or what I should do?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/26071/never-need-to-urinate"},{"post":{"author":"jesuslovesjanet","post_time":"over 2 years ago","post_title":"Question about low creatinine blood test level","post_content":"What does a low creatinine urine level mean please?","like_count":"2","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Question about low creatinine blood test level","resp_content":"It doesn't indicate much unless it's accompanied by appropriate blood work. What are the serum (blood) levels of creatinine and electrolytes?\n2\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/24736/question-about-low-creatinine-blood-test-level"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"P","post_content":"When I urinate it's slow stream afterwards there is a burning sensation and blood with some tissue sometimes I can't control my urine flow","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/24550/p"},{"post":{"author":"velacius","post_time":"over 2 years ago","post_title":"Brown Urine and Red Tissue substance","post_content":"I'm not sure if this is the appropriate forum to ask my question since it was the closest thing I could find for my problem. It all started about 2 days ago when I was hauling in a lot of heavy items at work. I was forced to use a lot of my physical strength in order to finish my tasks. Afterwards, I went to the restroom and found out that I had brown urine. I didn't really take heed of the situation at that time. Next day, I had to do the same heavy tasks and that's when I started to feel a slight discomfort in my hypogastric region.\n\nThe day after that, I took the whole day to rest my body. As I was resting my body, I drank a lot of water. I found the color of my urine sometimes clear, light brown, and brown. Near the end of the day, I found small red tissue-like substance in my urine, which has led me to submitting this question: What exactly is my condition? It doesn't seem like disease. And how serious is my condition? Will further days of rest fix this?","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Brown Urine and Red Tissue substance","resp_content":"Seek qualified medical help. Either see your doctor or go to a walk-in or a hospital. But do it right away. This does not sound normal\n"},{"author":"mjm1281","resp_time":"over 2 years ago","resp_title":"RE: Brown Urine and Red Tissue substance","resp_content":"Sounds like you had a kidney stone blocking one of your kidneys (hence the old/brown urine) and the bits could be pieces of dried blood from it scraping things up.\n\nI would definitely see a doctor ASAP and get a CT scan. Don't want to scare you, but if a stone blocks a kidney for more than a few days it can cause permanent damage which is potentially life threatening. If you see about it right away though a stone is painful but usually something not too terrible.\n"},{"author":"runrosie","resp_time":"over 2 years ago","resp_title":"RE: Brown Urine and Red Tissue substance","resp_content":"I would see a doctor as soon as possible. This happened to my mom and she was diagnosed with bladder cancer.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/11990/brown-urine-and-red-tissue-substance"},{"post":{"author":"rpinter1001","post_time":"over 2 years ago","post_title":"UTI trouble","post_content":"Hello, I'm a 20 year old female with what is seemingly reoccurring UTI problems. More like my UTI won't go away.\nI've been to three doctors and each time I tested positive for a UTI. I've been given three different types of antibiotics (all different and don't remember which kinds, sorry. ) and without a doubt, my UTI came back.\nI've taken an at home test and I'll test positive for WBC but not nitrite.\nI seem to have this problem the most when I hold in my pee for less than even a minute. As soon as I have to pee and I hold it, I get a burning sensation. I feel like my bladder struggles to let the pee out and while I'm peeing it burns.\nThere is a constant mild burn through out the day but nothing too intense.\nI am sexually active. With the same partner over a year now. He experiences no symptoms what so ever.\nI do NOT experience any itchiness, abnormal discharge, smells or anything of those sorts. Only the burning.\nI'd like to know if any other ladies have these issues or any possibility of what could be up.\nIs it a super UTI (lol) thanks in advance.","like_count":"0","tags":[]},"responses":[{"author":"beckischrader","resp_time":"over 2 years ago","resp_title":"RE: UTI trouble","resp_content":"Has any urologist checked to see if you have interstitial cystitis? That's what I have and our symptoms match. They can diagnose through a cystoscopy. Easy test, just not very comfortable.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/21412/uti-trouble"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Pain in kidney stones","post_content":"Suffering from severe kidney stones pain since two years though taken treatment.","like_count":"0","tags":[]},"responses":[{"author":"krishnama","resp_time":"over 2 years ago","resp_title":"RE: Pain in kidney stones","resp_content":"Yes I too have same problem\n"},{"author":"krishnama","resp_time":"over 2 years ago","resp_title":"RE: Pain in kidney stones","resp_content":"Change the treatment\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/23798/pain-in-kidney-stones"},{"post":{"author":"dirk05280","post_time":"over 2 years ago","post_title":"Kidney Stone Help","post_content":"I have had over 65 kidney stones now, and have found out they drastically decrease when I stop drinking coffee and black tea. My Urologist told me all fluids count. However; I tried going without coffee multiple times, and each time the frequency of kidney stones decreased. Has anyone else tried this with success, and how do you stay awake during the day?\nAlso; I do have a hard time balancing eating well, and staying away from dark leafy greens. I love spinach, kale and spring salad mixes, but supposed to avoid/reduce dark leafy greens, chocolate and nuts. What are some alternatives?\nThanks","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"suchetayadav","resp_time":"over 2 years ago","resp_title":"RE: Kidney Stone Help","resp_content":"These are some of the measures you can take to decrease stone formation\n1. Increase your fluid intake to atleast 2.5 lt/day.\n2. Restrict dietary salt intake\n3. Animal protein ingestion increases formation of kidney stone. have a moderate protein diet(0.8-1 g/kg/day).\n4. Don't restrict calcium intake. Have age appropriate calcium intake.\n5. Get a stone analysis/24 hour urine biochemistry for calcium, uric acid, oxallate, citrate, sodium, phosphorous, creatinine. This will help you in planning your diet according to the type of stones.\n\nDr SY\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/22770/kidney-stone-help"},{"post":{"author":"johjohjus","post_time":"over 2 years ago","post_title":"Sudden blood in urine","post_content":"Im 67. When 31 one morning i had massive blood in urine. Went to urologist who scoped me and said it was probably a kidney stone. I havent had any trouble until this week. Again i had massive blood in urine. No urethra pain. I have been having pain under my ribs on my back on the right side for about three months. I went a couple days no problem. Then i passed more blood and a clot. It has been two days and nothing. Is this typical of kidney stones? Will this heal on its own?","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"dirk05280","resp_time":"over 2 years ago","resp_title":"RE: Sudden blood in urine","resp_content":"I don't know if it is typical; but several of my kidney stones passed within a week of the initial symptoms, while other times the back pain persisted for four months. In my case; I think the pains starts and stops (increases/subsides) as the kidney stone moves or stops moving through urethra. I try to drink plenty of water, and stay away from carbonated beverages.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/19537/sudden-blood-in-urine"},{"post":{"author":"dumpsterdiva","post_time":"over 2 years ago","post_title":"Recent diagnosis","post_content":"Recently diagnosed with small stones. I'm tough, I can handle a lot of pain but this is crazy. I'm really empathetic with those of you who are suffering with the pain you describe. I'm calling my Dr''s office as soon as i reply. You must advocate for yourselves; call- don't let them give you appts 6 weeks away, demand to speak to advice nurses, call bookeeping & say \"hey, what do i do about billing when i go into E.R. for this\".\nThey don't want to pay -that will shake things up. Walk in and tell receptionist I'm sitting here until I'm seen today. Don't be intimidated, they are physicians, not Gods. Their job is to heal, our job is to make sure we do. Good luck.","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/22424/recent-diagnosis"},{"post":{"author":"clevelandmember69","post_time":"over 2 years ago","post_title":"CT of Kidney","post_content":"What does all this mean? Should I be worried and if so how serious is it?","like_count":"0","tags":["Kidney Stones","Kidney Cyst"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/22265/ct-of-kidney"},{"post":{"author":"christianscosby60","post_time":"over 2 years ago","post_title":"Kidney Stones","post_content":"I too have suffered with reoccurring kidney stones for over 20 year currently on my 4th stone which I've been passing for more than 7 years and the pain is beyond words. Tried everything possible. I know it must be some combination of things which causes them to keep coming back. Someone must know something I can do to help with this. Anyone with any suggestions, please.","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/21791/kidney-stones"},{"post":{"author":"mattnyc","post_time":"over 2 years ago","post_title":"Small Kidney lesions, what is the follow-up?","post_content":"During a CT scan with contrast, incidental kidney lesions were found (under 1cm). I am having a dull ache in my lower right abdomen which warranted the scan. Everything else seemed normal. I have a colonoscopy scheduled in a month. RE: kidney lesions, what is the appropriate follow up for them? I don't think it was indicated whether these were solid or cyst (maybe you can't tell at that size?). When is a biopsy recommended, or another CT scan down the line to see if they've grown? I am a 45 year old male. Thanks, Matt","like_count":"0","tags":["Kidney Cyst"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/20927/small-kidney-lesions-what-is-the-follow-up"},{"post":{"author":"blstrkjj","post_time":"over 2 years ago","post_title":"Urocit k 15 Meq","post_content":"I am taking the above medicine for bladder stones. My doctor says there are certain foods I should avoid while using it but I can’t find any info on it. Do you have any list that lists these foods.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/20544/urocit-k-15-meq"},{"post":{"author":"snehaone","post_time":"over 2 years ago","post_title":"Fiesta post","post_content":"Girar post destila","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"snehaone","resp_time":"over 2 years ago","resp_title":"RE: Fiesta post","resp_content":"Agree\n"},{"author":"snehaone","resp_time":"over 2 years ago","resp_title":"RE: Fiesta post","resp_content":"Well\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/20338/fiesta-post"},{"post":{"author":"nc_mattd","post_time":"over 2 years ago","post_title":"Kidney Stone help","post_content":"I have had Kidney Stones for 10+ years. My stone type is Calcium-Oxalate. I tried every diet, tried drinking water, lemonade, everything else they suggested, they still come back. Every time I went to the urologist they always told me that while the kidney stones are inside my Kidney that they won't cause pain. Most of the time they would still write me a prescription for Norco and send me on my way. I'd keep telling them that the Norco wasn't really helping that basically I would have to take so much of it I was in la la land and didn't care about the pain anymore but it wasn't stopping the pain most of the time.\n\nAbout 3 years ago my stones were so bad they had to go in and remove them via surgery, lithotripsy wasn't working on them. They came back and last year they had to do lithotripsy again. Now, I've been having back trouble for 6+ months not sleeping well and I went to the Urologist and I have a 12mm stone in each kidney. He told me that they were not blocking my ureter that it couldn't be the source of my back pain plus I had a stone in my other kidney but it doesn't hurt on that side. He diagnosed me with something Sponge Kidney. He sent me home with an appointment in six months to check them again and hopefully by then I could get insurance and they could do the surgery. The medicine they have been trying to put me on costs over 100 dollars a month which I cannot afford. He gave me no advice as to what to do even though I told him it was so bad I was being forced to self-medicate with alcohol just so I could get some rest. I went to my regular doctor and they checked that it wasn't muscular or skeletal problems causing my pain and to go back to him for a reevaluation. She wrote me a prescription for Meloxicam 15mgs once a day which helps to a small degree she told me it helps make it manageable, well it's manageable about every other day as long as I don't do anything at all strenuous. The last time I tried Norco for this pain about a couple months ago it did NOTHING for the pain. It still put me into la la land, so it's not a tolerance problem, but the pain was so bad even that wasn't enough.\n\nI live with my mother whom I try to take care of and she makes barely too much money to qualify for any kind of help with insurance for me. It was going to cost us over $13,000 after the deductible before they would pay anything if I got insurance. That's almost a 1/5th of her yearly income. Most of the money she brings in goes out in bills from when my father was still alive. I am pretty certain that I will be turned down at the free clinic because of the household income and the same for the charity group, I am in my mid 30's and even though this condition is extremely disabling I'm almost positive I wouldn't qualify for disability. I don't care for the check I just need medical help.\n\nSo here's my questions, is it ABOSOLUTELY impossible for your kidneys to hurt even if they stone is just sitting inside, and what advice can you guys give about finding help with my medical bills.","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/19274/kidney-stone-help"},{"post":{"author":"southernmom410","post_time":"over 2 years ago","post_title":"Kidney Stone Question","post_content":"A little back story -\nI have a 9 yr history of kidney stones. My first 2 (8 & 9 yrs ago)had to be surgically removed and ever since then I have passed each one on my own, although it normally takes me several weeks typically.\n\nAbout 2.5 weeks ago I started having really bad pain on my back/side, nausea, urinary urgency, along with a few other of my classic kidney stone symptoms. I have been drinking like crazy since then and taking Flomax 1x day. The pain only lasted 2 days and then it went to my normal being \"crampy\" on my side here and there like I usually have. The urinary urgency has not left. At times it's really bad and other times it's not. I have had a pinching pain down there a few times which with previous kidney stones for me meant it dropped into my bladder and my symptoms were then all gone.\n\nMy situation and question is this. I do not have health insurance right now and cannot afford to go to the urologist for self pay ($600 min). If the urinary urgency is so bad at times and I've had that pinching pain a few times, doesn't it sound like the stone is right there at the bladder drop and just stuck and not dropping? I know if it had dropped into the bladder and just hasn't passed then my symptoms would all be gone so I know that's not it. Is it possible that the stone has made it all the way through the ureter but is too big to drop into the bladder? (I think not if it made its way through the ureter.)\n\nThank you so much for any input or suggestions!","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/13682/kidney-stone-question"},{"post":{"author":"sandivy","post_time":"over 2 years ago","post_title":"ALBUMIN/CREATININE URINE RATIO RESULTS","post_content":"Im really worry im diabetic since 1995 a chronic diabetes. My primary doctor send me to do some labs the results in this one are:\nCreatinine Ur 137.5 mg/dl\nMicroalbumin U Random 7.1ug/dl\nMicroalbumin/ Creatinine Ratio 5.2 mg/g\n\nSomebody help what this lab mean?\n\nThe two first result said standard range not established. I eill appreciate your help thanks!!","like_count":"0","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/13040/albumin-creatinine-urine-ratio-results"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Welcome to the Kidney Disorders Message Board","post_content":"We are so excited to be able to share our new boards with you!\n\nJust a few housekeeping things to go over before you get started:\n\n- Bookmark this page so you can easily find us any time\n\n- Make sure you check back frequently as conversations are always being added and expanded\n\n- Head on over to your Message Board profile (just click on your account avatar in the top right corner of the page) to update your personal story and add your photo\n\n- Don’t see what you’re looking for? Look through the tags at the top of the page to customize your view to only see posts that interest you\n\n- When creating a post, choose a tag to add that most clicks with you. Using tags is encouraged but not required.\n\n- Like what you see? Or need help? Send us an email at CommunityManagement@webmd.net","like_count":"0","tags":["Kidney Stones","Dialysis","Kidney Cyst","Kidney Failure","Kidney Disease"]},"responses":[{"author":"WebMD Riley","resp_time":"over 3 years ago","resp_title":"RE: Welcome","resp_content":"\nHi WebMD Addie This is a great post!\n\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Welcome to the Kidney Disorders Message Board","resp_content":"Can I swim with kidney stone stent placed\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/25/welcome-to-the-kidney-disorders-message-board"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Can my hyperuricemia in CKD be treated? How?","post_content":"Hello,\n\nA nephrologist's answer would be much appreciated.\nSince high urate speeds up the progressive dropping of GFR, should my high (559 umol/L) p-urate be lowered? Can it be lowered? How? Should my primary care physician refer me to a nephrologist?\nThank you in advance for your help!","like_count":"0","tags":["Dialysis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/11553/can-my-hyperuricemia-in-ckd-be-treated-how"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"UTI symptoms for the past three weeks...","post_content":"So I have had UTI symptoms for the last three weeks. Prior to this past Sunday symptoms included: lower back pain (throbbing), lower abdominal pain, diarrhea, incontinence, fatigue and vaginal burning. I have been prescribed three medications over the past two weeks. I went to a convenience care on Sunday and they stated that I did not have a UTI, but prescribed me two medications, in which tomorrow is my final day. I continue to have lower back pain, fatigue, vaginal and inner thigh burning. The care center called today and stated that my culture came back negative. I’m stressed to the max, and I have no idea what to do about this pain. I’m pretty sure the nurses on Sunday thought I was mental given I was so adamant about my vaginal/ inner thigh burning and back pain. Has anyone had similar experiences? Anyone have any suggestions? Could these symptoms possibly be stress induced??","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/11469/uti-symptoms-for-the-past-three-weeks"},{"post":{"author":"wmlauraliz","post_time":"over 2 years ago","post_title":"Kidney infection or UTI?","post_content":"I was just diagnosed with my fourth UTI in two months. This pain is very different and in my back as well. The urinalysis came back with renal epitheal cells and casts, two things that have never shown up before. Do those things indicate kidney infection? My CT was normal.\n\nI'm afraid if it's not diagnosed as a kidney infection, I'm just going to go round and round with this UTI, like I have been for 2 months. Help","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Kidney infection or UTI?","resp_content":"Your doctor really should be the one to tell you if these results mean a kidney infection or not. Are you on antibiotics for the UTI? I hope you're feeling better now.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/8752/kidney-infection-or-uti"},{"post":{"author":"tvstarr","post_time":"over 2 years ago","post_title":"toxic sweat","post_content":"i have been having toxic sweat from food and water where i have to change the bed sheets daily and wash them and wipe down the bed and i can't even sit down anywhere or wear clothing that long without having to change it. i don't know whether its some really bad additive in the water or liver problems and i have also been really tired. what might this be?","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: toxic sweat","resp_content":"I'd go to the doctor to get it checked out. Hope you're doing better!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/10223/toxic-sweat"},{"post":{"author":"greg4608","post_time":"over 2 years ago","post_title":"Diabetic kidney failure","post_content":"I am 62 years old I was born with diabetes diagnosed at 18 months I currently have kidney failure and trying to get a kidney pancreas transplant but the problem I'm running across as I need dental work done can use local anesthetic my blood pressure skyrockets does anybody ever have this problem on what I can use to have my teeth worked on","like_count":"0","tags":["Kidney Failure","Kidney Disease"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Diabetic kidney failure","resp_content":"Have you talked with your nephrologist? Or do you have a cardiologist? They might have some suggestions on how to handle your reaction to local anesthetic. Dental health is so important, so I would definitely try to get this squared away so that you can have your teeth worked on.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/10492/diabetic-kidney-failure"},{"post":{"author":"fujiapple7","post_time":"over 2 years ago","post_title":"I urinated a lot of blood. I'm 23/female, I'm really scared?","post_content":"My name is Sam. I'm a 23 year old female. I am an alcoholic and a vegetarian. I have recently lost quite a bit of weight. I stand at 5'5\" weighing in around 113-116 lbs. Tonight I got off of work very late, went to use the restroom, and found a lot of blood coming out as I was urinating.\n\nI have no pain or discomfort. I am definitely positive I am malnourished. Last night I believe I had a very, very mild migraine (I'm not sure if that is a symptom of anything besides my stress and how strained my body is) The second one in my life, first one was many years ago. I tend to binge drink weekly and a lot of times end up vomiting. I almost had to be hospitalized for alcohol poisoning a couple weeks back.\n\nI am really scared my life style has caught up with me. I'm afraid my alcoholism which suppresses my appetite, along with how little I have been eating for months now, is catching up with me. I'm terrified I have something more serious than just a UTI. I went to the bathroom minutes later and a little bit of urine came out but it was normal.. Any thoughts are appreciated.. Like I said, no physical pain or discomfort. No body aches or anything besides that horrible head ache the night before.","like_count":"0","tags":["Kidney Failure","Kidney Disease"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: I urinated a lot of blood. I'm 23/female, I'm really scared?","resp_content":"You urinated a lot of blood and you're not at the hospital? Please go to the doctor immediately or go to your local ER.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: I urinated a lot of blood. I'm 23/female, I'm really scared?","resp_content":"How are you doing? Any chance it was your period starting? I hope you found out what was going on and got the appropriate treatment!\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: I urinated a lot of blood. I'm 23/female, I'm really scared?","resp_content":"You probably have an untreated UTI. go to the hospital immediately.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/8936/i-urinated-a-lot-of-blood-i-m-23-female-i-m-really-scared"},{"post":{"author":"alltheissues","post_time":"over 2 years ago","post_title":"Possible Kidney Disease?","post_content":"So I went for a physical about a month ago and my blood work came back that my creatinine levels were a 1.22 which is only slightly over the highest normal level. My kidney function was only about 65%. I was sent to a Nephrologist who, after asking a ton of questions, assumes that my levels may have only been high because I had to fast for 12 hours prior to going in for blood work. He sent me to a radiologist to do an ultrasound just to be on the safe side. The Radiologist informed me that my renal cortex is only about half the width it should be and that there are fatty tissues in my kidneys but my blood flow is good with no obstructions. I am a 32 year old female. I do not have diabetes, I have not had kidney diseases in the past, I have never had an over abundance of UTIs (actually I can only think of one time ever), I am not overweight, I do not take (nor have I ever taken) NSAIDS on a regular basis. Does anyone have any thoughts as to what might be going on? I have had 1 surgery per year since 2013 and I am trying to avoid having any more if I can help it. Any insight is appreciated.","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"codfish17","resp_time":"over 2 years ago","resp_title":"RE: Possible Kidney Disease?","resp_content":"These are questions for a nephrologist, not the general public. You should be monitored by a nephrologist for a year or more, doing blood tests to check the Renal Panel (creatinine, BUN, etc.) every 4 months. Kidney function (capacity) should be tested with a 24 hour urine collection. The nephrologist should be your coach. If not, find another, perhaps at a teaching hospital associated with a good university.\n"},{"author":"alltheissues","resp_time":"over 2 years ago","resp_title":"I was scheduled to see a nephrologist but it was a month wait. I was in search of others who maybe had experienced something similar. After all the surgeries I have had, I think I was being paranoid that one more thing was happening. Thanks for your response.","resp_content":""},{"author":"sia69","resp_time":"over 2 years ago","resp_title":"RE: Possible Kidney Disease?","resp_content":"I was told that I have CKD about 4 years ago due to low GFR on my blood tests. Other doctors say I am dehydrated, and if I would drink water more that my numbers would come back up. I have not followed up. I am due for blood work this week to see how my numbers are. I have trouble drinking a lot of water. I know I drink ton of coffee, and it dehydrates me. I am Diabetic, but never thirsty like most diabetics. I also had my Parathyroid checked, and the doctor thinks my kidney issue is from the Parathyroid. ITs just a simple blood test to check if you are normal range. My PTH and my Phosphorous level is off.\n"},{"author":"alltheissues","resp_time":"over 2 years ago","resp_title":"I was told to drink more water to improve what my blood tests had shown. I hate drinking water because it makes me feel bloated but in an attempt to reverse a possible serious condition, I forced myself to. My creatinine level went from 1.22 to 1.08 in 2 months and all I changed was drinking water. I only drank 32oz a day and I did it in small intervals (4oz at a time) it was easier for me that way.","resp_content":"Reply\nsia69\nover 2 years ago\nI am actually trying to drink a lot of water today and tomorrow, because my blood work is being done on Tues. morning. You have to wonder sometimes about diagnosis, but they did say I have kidney disease. If you get copies of your blood work, I would be interested in your GFR. That is great that your levels are getting better. My GFR which is done routinely now in blood work is 40, and I should be over 60. My husband drinks water and sugarfree Ice Tea constantly, and his GFR is up over 70, and his Cholesterol etc. has been so good. I am like you with the water, but we have to try if it works. Have a Nice Day.\nSue\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/8981/possible-kidney-disease"},{"post":{"author":"greg4608","post_time":"over 2 years ago","post_title":"Diabetic kidney disease","post_content":"I'm 62 I was born with diabetes diagnosed at 18 months I currently have kidney failure and trying to give a kidney pancreas transplant the problem I'm running into is I need my teeth fixed can't use normal local anesthetic my blood pressure skyrockets does anybody ever heard of anything like this and what to use","like_count":"0","tags":["Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/10491/diabetic-kidney-disease"},{"post":{"author":"whitmon1900","post_time":"over 2 years ago","post_title":"Pain/blood in urine","post_content":"For a few days now, I have been having pain near the tip of my penis when urinating. It feels like a kidney stone is stuck at the tip of my penis, but not passing completely. For 2 days there was no visible blood, but since yesterday it is clearly visible. Note, I have had many kidney stones. 30+. I did not feel the stone move from the kidney to bladder. But I don't always feel it move. The only thing I can think of is a UTI if it isn't a stone. Btw I have no insurance at the moment, or I would just go to the doctor. I don't want to be one of those people that abuse the ER. But if it is an infection, I need antibiotics","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Pain/blood in urine","resp_content":"Are you still having this problem? If so I would get it checked out. You definitely don't want it to turn into something more serious.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/9560/pain-blood-in-urine"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"frequent urination with blood in urine","post_content":"I was having frequent urination with UTI like symptoms. Went to Doc,\nthey found blood in urine.\n\nLater met the urologist and had CT scan. It showed 4mm stone in\nleft kidney plus few other small stones. No back pain. The frequent\nurination symptom has been going on for a month and half. Sometimes\nI feel burning when urination.\n\nUrologist thinks the frequent urination is due to kidney stone. The burning is due to passing small stones. How long will this continue?\nHow to confirm the symptoms are due to kidney stone and not\nanything else? The CT scan also showed mild inguinal hernia with fat.\nI don't see or feel any bulge /protrusion in the groin area.\n\nHow to take care of the kidney stones?","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/9230/frequent-urination-with-blood-in-urine"},{"post":{"author":"hue_men8sure","post_time":"over 2 years ago","post_title":"Wish I could say I never wanted to poop so bad, but there's been some times....this is a Serious Case though so if you don't mind please, pulling up a stool :) But really, something is wrong that I am unsure about and could use some advice... Thank","post_content":"Going to be as straight forward as possible...\n\nBurned when I peed, rash on hands, and had discharge for 2 days.\n\nTested positive for chlamydia on 2nd day and immediately took Azithromycin on the 3rd day. Negative for HIV & Syphilis, need to test for gonorrhea.\n\nTook 500mg 2 days in a row and then 250 for the last day, urination burn went away along with discharge after first dose but the rash on hands is still there. Stopped taking medication because of the symptoms I was experiencing:\n\nAbdominal pain, back pain, nervousness, sleeplessness, fatigue, chest tightening, vomiting sensation (but didn't), back pain, muscle cramps, chills, a higher heart rate, shortness of breath...\n\nMost symptoms faded now (3 days since off azithromycin), but still tight feeling where heart is though heart rate is fine, upper left back and left arm feel weak, and kidney-side portion of my abdomen is discomforted and hurts when I push into my kidney.\n\nI pee 2-3 times/day and it's a fair amount, but not as much as typical (by a longshot). Feel like I need to poop, but only get out a tiny bit once in the morning and once at night. Heart Rate returned to normal\n\nFeel okay but sluggish in the mornings, better but uncomfortable during the day, and the worst at night.\n\nConcerned because don't want to ignore underlying symptoms of a bigger problem, but not sure if impatient for azithromycin to wear off and underestimating recovery time.\n\nThank You for your time, concern, and valued input.\n\nSincere Regards","like_count":"2","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/9073/wish-i-could-say-i-never-wanted-to-poop-so-bad-but-there-s-been-some-times-this-is-a-serious-case-though-so-if-you-don-t-mind-please-pulling-up-a-stool-but-really-something-is-wrong-that-i-am-unsure-about-and-could-use-some-a"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"is it possible to have nephrotic syndroms symptoms but not have it?","post_content":"My 27 yr daughter has been showing every single symptom of nephrotic sympton ever since she had lithium poisoning at age 10 from a bad doctor.\n\nshes got all the hallmark symptoms minus the heart issues.\nswollen feet and ankles, eyelids,face, bad water retention, inability to lose weight regardless of dieting or exercise, bubbles in urine etc.\n\nwere trying to get her to a nephrologist but the primary wont send her there without testing for it first with urine sample and bloodwork.\nshe was tested and it came back negative.\n\nis it even possible to have all these nephrotic syndrom symptoms without having it? or did the lab mess up?\n\nwere at a loss of what to do.\nwere pretty sure she has it.","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: is it possible to have nephrotic syndroms symptoms but not have it?","resp_content":"I hope your primary MD did a 24 hour urine collection. That is the best way to study urine abnormalities. My husband developed 'Diabetes Insipidus' from using lithium along with kidney harming over-the-counter medicines like Advil (ibuprofen). His condition made him thirsty all the time so he drank a lot which caused his urine to be very diluted thus it took a 24 hour collection to show anything!\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"no they did not do a 24 hour urine test. had no idea they did that.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/7059/is-it-possible-to-have-nephrotic-syndroms-symptoms-but-not-have-it"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Im asking for a friend she was beat up and punched in the stomach and kidneys and she is in alot of kidney pain and is peeing blood what does she need to do need any suggestions on this matter","post_content":"Kidney issues","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 2 years ago","resp_title":"RE: Im asking for a friend she was beat up and punched in the stomach and kidneys and she is in alot of kidney pain and is peeing blood what does she need to do need any suggestions on this matter","resp_content":"She needs to go to the doctor or the ER.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/7315/im-asking-for-a-friend-she-was-beat-up-and-punched-in-the-stomach-and-kidneys-and-she-is-in-alot-of-kidney-pain-and-is-peeing-blood-what-does-she-need-to-do-need-any-suggestions-on-this-matter"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Kidney issues","post_content":"Im asking for a friend she was beat up and punched in the stomach and kidneys and she is in alot of kidney pain and is peeing blood need any suggestions on this matter","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/7314/kidney-issues"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Kidney Problems","post_content":"I have been referred to a specialist after a blood test. Diabetic for 27 years.\nMicroalbumin should, I believe, be within range between 0.00 and 30.00 mg/l. Mine is 457 ! I understand that this indicates a problem - can anyone advise how serious this might be on a scale of 0-10 please?","like_count":"0","tags":["Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/7127/kidney-problems"},{"post":{"author":"bradley123","post_time":"over 2 years ago","post_title":"HAPPY TO HAVE HIS HELP","post_content":"HAPPY TO HAVE HIS HELP AND SUPPORT AS TO WHEN I WAS A CHILD AND KIDNAPPED THEIR WAS NO MED SUPPORT AT ALL FOR US CHILDRED AND IT WAS VERY SCARY AS IN 76 I HAD ABCESS THAT ALMOST ENDED MY NOW LIFE AND THE PAIN ALL DUE TO NO SUPPORT OF THE THEN GOV. THANK BAROCCO YOUR MY HERO DANNY M RUTT","like_count":"0","tags":[]},"responses":[{"author":"bradley123","resp_time":"over 2 years ago","resp_title":"RE: HAPPY TO HAVE HIS HELP","resp_content":"DANNY MICHAEL RUTT\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/7086/happy-to-have-his-help"},{"post":{"author":"lilxkitten","post_time":"over 2 years ago","post_title":"Kidney Infection?","post_content":"So for the past week I had been having really bad pains in my lower back area. It got to the point that I was not able to move because it hurt so badly. I went to the doctor on 4/20/17 and the doctor said I may have a kidney infection so she prescribed me Cipro. The weird thing is my urine test came back negative and I also never had a fever. So I've been taking Cipro for 4 days now and yesterday, Sunday, I felt a lot better I had no pain in my back. But now today, Monday, I'm not feeling that great anymore. It seems like my kidneys are hurting again and so does my bladder and it also burns a bit to urinate. Not as bad as uti burning but it's noticeable. So I'm not really sure what to do. I just know my back is hurting again.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/7015/kidney-infection"},{"post":{"author":"cyndy24","post_time":"over 2 years ago","post_title":"Very swollen feet and ankles","post_content":"My boyfriend has had swollen feet and ankles for 2 months or more now. We went to the ER about a month ago because his calf was tight swollen and agry red. Also causing a lot of pain for him. They ran a few tests and did a sonogram to see if he had a blood clot. They found nothing and gave it a generic diagnosis of cellulitis. He went home wih a prescription for antibiotics. Some of the swelling, the redness, and the pain went away but his ankles remain extremely swollen. To the point that he has no ankles. But today the redness and pain have returned! What could be causing his symptoms? Could it be his kidneys?\nI realize he can't be diagnosed just by reading brief message about it but I would like some advice none-the-less.\nThank you","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Very swollen feet and ankles","resp_content":"He needs to see a doctor and get a complete physical. An ER is only going to treat the immediate most dangerous issues. It is not a place to get a dx on issues like this it is not a doctor's office. He could have a cardiac issue it could be his kidneys it could be both it could be an autonomic dysfunction it could be............... it could be.................... You get the idea go get him checked out. GOOD LUCK!!!!!!!!!!!!!!\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Very swollen feet and ankles","resp_content":"Been going on for 2 months why did he wait so long to get help? There are so many things that can cause this. Medications, illness, poor diet, excessive alcohol use\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/6885/very-swollen-feet-and-ankles"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Kidney disease and possibly previously suggested lupus diagnosis","post_content":"Hi I am 22 years old and I have kidney disease everything wrong with my right flank from stones to hydronephrosis and I also at times break out in a full body rash which includes a butterfly rash on my face I suffer seriously fatigue and depression I have been told to get checked out for possibly lupus which would probably end up being seen as lupus nephritis due to my previously diagnosed kidney disease but I am nervous and tho 2 doctors and a nurse have in passing suggested getting looked at for lupus. I break out when stressed as well and I have several other symptoms. What is your opinion ? Not that you can make a solid assumption from a message but I'm your professional opinion is that a possibility","like_count":"0","tags":["Kidney Stones","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/6675/kidney-disease-and-possibly-previously-suggested-lupus-diagnosis"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Lab results","post_content":"Explain the following lab results:\nHDL Chol: 37\nBlood sugar slightly elevated\nGlucose: 109\nMCH: 31.3\nMPV: 9.4\nAll other results were in the normal range!","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/6100/lab-results"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"What Do You Want to Know About Your Kidneys?","post_content":"Over the last few weeks we’ve given you information on what exactly your kidneys do, conditions that can affect your kidneys, how to spot those habits that could be harming your kidneys, and what you can do to keep your kidneys healthy.\n\nNow we want to know, what you would like to know about your kidneys? What questions do you wish you had the answers to?\n\nWant more great kidney info? Here’s a good place to start: http://wb.md/2mYW3Qd","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/5837/what-do-you-want-to-know-about-your-kidneys"},{"post":{"author":"ccall24","post_time":"over 3 years ago","post_title":"Concerns with pain and blood in urine","post_content":"I am a 44 year old women in good health. I exercise and eat healthy. I take vitamin D,B & allergy medication daily, no other medications. I do have a history of kidney stones and ovarian cysts. Twice now, once last July and again a couple of weeks ago, I have had terrible pain in my right side, back and a general feeling of being ill (lightheaded, nausea, etc.). Both times I had blood and protein in my urine as well as a slightly elevated white blood count and the Dr.'s immediately thought it was a kidney stone. However, both times the CT scan did not show a kidney stone and I was sent home to wait it out ( I missed 1 week of work this last episode). The pain does eventually go away and at a recent follow up with a Urologist, there was less blood and no more protein in my urine and the scan of my bladder came back healthy.\nI have no idea what is causing these episodes and would love to know if there is anything else that may cause these symptoms, other questions that I should be asking my provider, or if I should just not worry about it and hope it doesn't occur again. Any feedback would be greatly appreciated.","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"jnd0904","resp_time":"over 3 years ago","resp_title":"RE: Concerns with pain and blood in urine","resp_content":"Did you get any responses? I'm having this same issue. I'm 45 yr old Female with 5.4 yr Mirena in. I thought it might be the Mirena but I saw women keeping theirs for 6+ yrs. I have a low grade fever which makes me think it's viral. I'd be interested to compare notes. I don't want to go thru this again. I'm on day 4.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/3714/concerns-with-pain-and-blood-in-urine"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Constant Urination","post_content":"Hi,\n\nI have having Constant urination for almost 5 months now.\nAs soon as i drink water it comes out in 15 mins.\nWhat does this mean?\nI have checked for diabetics , but the test shown no sign of diabetics.\nPlease do reply.\n\nThanks.","like_count":"0","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/5524/constant-urination"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Conditions That Can Affect Your Kidneys","post_content":"Your kidneys have a lot of work to do...They remove waste and extra fluids from your body, keep your salt and potassium levels in check, and produce hormones that make red blood cells and help keep your blood pressure under control.\n\nBut as you may know, there are a number of health problems that can affect how well your kidneys work. See what they are, and how they can be treated, here: http://wb.md/2lEqwma","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/5506/conditions-that-can-affect-your-kidneys"},{"post":{"author":"joana39","post_time":"over 3 years ago","post_title":"kidneys, potassium citrate and osteoperosis","post_content":"i have kidney disease, had kidney stones a few years ago and the dr. put me on potassium citrate, 1080 mg, 3x a day..my tests vary from test to test but i had run out of the potassium citrate and for some reason my test improved..i just had a bone marrow test which showed i have osteoperosis and was wondering if the potassium citrate has anything to do with that, thats it depleting calcium..","like_count":"0","tags":["Kidney Stones","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/5282/kidneys-potassium-citrate-and-osteoperosis"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Surprising Things That Can Hurt Your Kidneys","post_content":"Could you be harming your kidneys without knowing it? For example, did you know that drinking two or more diet sodas a day could make you more likely to get kidney disease?\n\nSee what other things could be hurting your kidneys: http://wb.md/2mYPDAr\n\nWhich of these was most unexpected to you?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/5236/surprising-things-that-can-hurt-your-kidneys"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"It's World Kidney Day! Here's How to Keep Your Kidneys Healthy","post_content":"March 9th is World Kidney Day, and this year’s theme is ‘Healthy Lifestyle for Healthy Kidneys.’ Your kidneys work hard for you, day in and day out, so it’s important that you’re taking good care of them.\n\nFrom shaking the salt habit to making sure you’re getting just the right amount of water, here are eight healthy lifestyle guidelines that can make a big difference in your kidney health: http://wb.md/2kIBgjb\n\nHow many of these healthy habits are already a part of your routine?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4980/it-s-world-kidney-day-here-s-how-to-keep-your-kidneys-healthy"},{"post":{"author":"lmhollier","post_time":"over 3 years ago","post_title":"Ketosis & Rhabdo","post_content":"Not sure if this is the correct message board for this or not. I have a history of rhabdomyolysis (2 episodes, 10 months apart), cause unknown. I've recently started the keto diet and have been noticing a few changes (including intermittent pain on L side of lower back, oily film on water after BM). After doing a little research, I've seen mentions of ketosis and rhabdo together, but nothing really substantial. Can the keto diet cause another episode of rhabdo? Should I be worried? *not experiencing any symptoms similar to those I had while in rhabdo","like_count":"0","tags":["Kidney Failure"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4977/ketosis-rhabdo"},{"post":{"author":"naykidape","post_time":"over 3 years ago","post_title":"Doctor is recommending removal of my kidney","post_content":"And I want to get as many opinions as I can before committing to this.\n\nA solid, fibrosis mass showed up on a CT scan. I had the biopsy a cpl weeks ago, but my urologist had to send the samples out to another lab for more testing.\n\nAnyway, was looking for some feedback on the biopsy results so far.\n\nShould I type out the biopsy results or scan the paperwork?\n\nThanks in advance.","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4954/doctor-is-recommending-removal-of-my-kidney"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Kidney stones & infections","post_content":"When I go to the bathroom when I have a infection my hand tingle and hurt two dr has told me this has nothing to do with the infection but I know other ladies who complained\nWith this also","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"dorothylee1","resp_time":"over 3 years ago","resp_title":"RE: Kidney stones & infections","resp_content":"how can you find out if you have a kidney infection\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/3693/kidney-stones-infections"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"MIGHT ME A MEDICAL EMERGENCY!?!","post_content":"Female 18, no serious health issues except anemia been having some abnormal liver and kidney results but nothing diagnosed, Also undiagnosed gastro pain and unexplained 20 pound weight loss in two months (now 120). Since first week on feb 2017 started to feel on and off extreme needle pain on the bottom of both my feet, I thought it might be symptom of my undiagnosed celiac disease so I ignored it. On the night of feb 23 2017 , with minimal walking all day, absolute no injuries was studying in library when noticed all my toes were red, then my whole foot was red, then started turning purple, woke up to a deeper grey purple with still red, now really swollen and the color is traveling up my leg, occasional sharp pain, My hands are in pain the, palms turn red sometimes when i'm writing. Is this an emergency or should I try and let it pass? Any explanation or possible ideas for diagnosis?","like_count":"0","tags":["Kidney Failure","Kidney Disease"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: MIGHT ME A MEDICAL EMERGENCY!?!","resp_content":"I would go to the doctor ASAP to find out what's happening. This certainly doesn't sound normal to me.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4482/might-me-a-medical-emergency"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"How Well Do You Know Your Kidneys?","post_content":"In honor of National Kidney Month, we thought we’d challenge you to see how much you really know about these bean-shaped organs.\n\nTake this quiz and let us know how you do below: http://wb.md/2kRGCER\n\nDid anything surprise you?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4683/how-well-do-you-know-your-kidneys"},{"post":{"author":"mich041981","post_time":"over 3 years ago","post_title":"Please someone help me understand this lab test results!!!!!","post_content":"My doctor told me to do some lab test for my anual physical exam, almost everything was fine but my BUN/Creat Ratio was low\n\nTest Result Reference Units\nBUN 6, 6-20 mg/dL\nCreatinine 0.67, 0.60-1.10 mg/dL\nBUN/Creat Ratio 9.0, 10.0 - 28.0 mg/dL\n\nPlease I dont see my doctor till March, let me know if this is something bad????","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: Please someone help me understand this lab test results!!!!!","resp_content":"It's perfectly normal/healthy. You have very efficient kidneys. Relax. All your results are within normal limits.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4078/please-someone-help-me-understand-this-lab-test-results"},{"post":{"author":"bre71","post_time":"over 3 years ago","post_title":"UT scan","post_content":"My doctor sent me down to get a ct scan in 2/14/17, my scan showed 2 stones 3 mm and 5 mm.She gave me some meds. and said it will pass in 3 to 4 days. Nothing at all yet just a little pain and weak. How long does this take?","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4191/ut-scan"},{"post":{"author":"anonymouscm","post_time":"over 3 years ago","post_title":"Insects in my urine!","post_content":"The last few days I have noticed what appear to be very small bugs in the toilet after I pee. They look like gnats or baby flies. I have Googled like crazy, and have found no answers.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4172/insects-in-my-urine"},{"post":{"author":"janedoe17","post_time":"over 3 years ago","post_title":"Kidney stone urethral pain","post_content":"I just passed a stone, I caught it in a strainer and it was very tiny but spiky. A week before I passed this stone I thought I had a UTI, I've been on antibiotics but they haven't helped and my\nCulture came back negative. Since I passed the stone I am still having a constant dull burning sensation 24/7 and pressure in my bladder that makes me feel as though I have to urinate. Has anyone experienced this? Does anyone know what it is?","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4166/kidney-stone-urethral-pain"},{"post":{"author":"jesuscares4you","post_time":"over 3 years ago","post_title":"Pain and lab results! Help!","post_content":"I started having kidney pain when I was pregnant and it's been going on for 2 years now not relieving at all and I have protein and blood in my urine and my albumin is low and I have high urine bacteria my ESR is high my urine occult blood is high and my random protein / creatine is high my urine creatine is 92 my urine random total protein is 617 mg my urine red blood count is 6 by urine white blood count is 2 but my GFR is normal if anyone has had results like this and know what they have can you please I give me some hints and I know that you all are not doctors but I just want to know what your opinions are I have a kidney biopsy scheduled for Tuesday morning so I'll be getting those results soon after that just want to little piece of mine I wonder if it could be chronic kidney disease my mom has lupus so it could possibly be lupus but I just don't know so if you have any advice please leave it below thank you so much God bless","like_count":"0","tags":["Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/4149/pain-and-lab-results-help"},{"post":{"author":"misschoochoo","post_time":"over 3 years ago","post_title":"Can hypoglycemia result after kidney removal?","post_content":"My brother recently underwent a nephrectomy (kidney removal) and now is having very low blood sugar readings in the mornings before breakfast, such as 46-55. He will be talking to his doctor about this, but I wondered if anyone in this forum had any experience with this situation. He takes medicines and insulin for his diabetes, and has always been able to keep his blood sugar regulated until now.","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: Can hypoglycemia result after kidney removal?","resp_content":"Yes, it can happen. It was explained to me by my nephrologist (not long before dialysis) that patients with kidney issues and damage get more \"life\" out of their insulin because the kidneys play a role in re-absorbing it. So if there is some kidney issues (less function) then there is less ability to take the existing insulin out of your system - so it lasts longer. We diabetic patients were told to note that we might need less insulin. Maybe this is what's happening.\n\nCora\n"},{"author":"misschoochoo","resp_time":"over 3 years ago","resp_title":"Thank you very much for the information, mrscora01. I'll let him know. Even after reducing his insulin, his blood sugar readings are in the low 50's, so he's going to reduce it further.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/3489/can-hypoglycemia-result-after-kidney-removal"},{"post":{"author":"sabrinahuffman","post_time":"over 3 years ago","post_title":"Help","post_content":"I went to the ER on Sunday with UTI symptoms and sharp pains in my kidney area. They ONLY did a urine culture and vaginal swabs. Yesterday evening late I am sure I passed a stone but about an hour later I started having severe pain even worse than when I was pregnant and had a 7mm stone stuck. I previously had Uric Acid stones. What are the chances that I have another stone too large to pass and should I go to a different ER since they refused to do any blood work or a CT scan. Also I don't have a spleen and have been told I have to be extremely cautious any time I get sick.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Help","resp_content":"Are you still in pain? I'd head to another doctor to get it checked out, especially since you have a history of stones.\n"},{"author":"jbrookeh","resp_time":"over 3 years ago","resp_title":"RE: Help","resp_content":"Go to the ER. Let them know you passed a stone but it feels like you have more stones. Make sure you're not covering up how much pain you're in and try not to play on your phone.\n\nif its the same ER, let them know you passed it after your last visit and this time you demand to be scanned since you feel they misdiangnosed you.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/1780/help"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Keep or Repeal Obamacare? Share Your Thoughts","post_content":"Currently about 20 million people get insurance through Obamacare, which guarantees coverage for services like preventive care but has been plagued with increases in premium costs. A recent WebMD survey found that most consumers wanted the law or parts of the law to remain, although not without changes.\n\nWe asked some people to share their views of the law and how any changes will affect them. Here's what they said: http://wb.md/2hVMZEL\n\nWhat are your thoughts?","like_count":"1","tags":[]},"responses":[{"author":"wepick","resp_time":"over 3 years ago","resp_title":"RE: Keep or Repeal Obamacare? Share Your Thoughts","resp_content":"Repeal. My insurance has been gutted by Obamacare.\n\nMy premiums are up, as is my deductible - to the extent that unless diagnosed with chronic or terminal illness, it's completely useless.\n\nThank God for ***, who was able to repair my torn rotator cuff and labrum without surgery using \"experimental\" PRP therapy. It costs me less than $2,500 total, including cost of X-rays and MRI. Insurance paid for none of it, and IMO slaps the label \"experimental\" on something like PRP Therapy so they can avoid paying for a treatment for which more than enough research/evidence exists to support the conclusion that it works in numerous applications.\n\nNone of that counted against my deductible, so I had to come out-of-pocket another $850 to have two pre-malignant polyps removed from my colon by ***, who is a wonderful doctor who saved my life.\n\nLove the two doctors. They put their time and work in to learn their trade and become good at what they do. They deserve to be paid an amount consistent with what they signed up for.\n\nMy gripe is with the insurance company for refusing to contribute a dime toward anything in the only year my entire life I've actually needed the insurance plan I've been paying into all this time.\n\nIf they won't pay for anything, I shouldn't be forced to buy their product, or face what I believe to be an unconstitutional fine should I decline to do so.\n3\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/2664/keep-or-repeal-obamacare-share-your-thoughts"},{"post":{"author":"wishnik1","post_time":"over 3 years ago","post_title":"Kidney surgery with a blood clot","post_content":"If a patient is having kidney surgery, can the doctor perform the surgery if the patient has a blood clot in their leg?","like_count":"0","tags":["Kidney Failure"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/3035/kidney-surgery-with-a-blood-clot"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Mass Removal from Kidney","post_content":"I have a small mass located in my kidney, and would like to explore less intrusive surgeries than suggested to me. Assuming that the mass is benign, are there any procedures available to me besides the standard incisive-type, major surgery?","like_count":"0","tags":["Kidney Cyst"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/3005/mass-removal-from-kidney"},{"post":{"author":"riya1983","post_time":"over 3 years ago","post_title":"High Creatinine Level of 1.4 (in case of Diabetic patient)","post_content":"Hi Sir/Madam,\n\nI need advice regarding my father's health. He is 66 years old and of Indian ethnicity.\nYesterday his blood creatinine level has been reported to be 1.4mg/dl. He is on medication for Diabetes, high blood pressure, high uric adic and blood thinning (for clot in a brain nerve).\n\nHis diabetes and BP are under control since more than one year. He had high Uric acid level (of 8.5) six months back but it is now under control (at 5.2). He has been adviced to take Zyloric to control Uric Acid.\n\nIs there anything to worry about for increased creatinine level of 1.4? Can anyone please recommend a good Nephrologist in Hyderabad we could consult with? Please advice.\n\nThanks in advance.\n\nRegards,\nRiya.","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/2991/high-creatinine-level-of-1-4-in-case-of-diabetic-patient"},{"post":{"author":"alanbreslow","post_time":"over 3 years ago","post_title":"I'm in Rockland County, NYS on Dialysis","post_content":"Anyone else in the Hudson Vally with Kidney Failure?","like_count":"0","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/2772/i-m-in-rockland-county-nys-on-dialysis"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"How well do you really know your kidneys?","post_content":"You're probably pretty familiar with your kidneys, but did you know these 5 amazing facts? http://wb.md/2hMOjd3","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/2601/how-well-do-you-really-know-your-kidneys"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Constant urination","post_content":"Repeated urination","like_count":"0","tags":["Kidney Failure"]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: Constant urination","resp_content":"More details. Please. This could be due to all sorts of different things.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/2230/constant-urination"},{"post":{"author":"slearp74","post_time":"over 3 years ago","post_title":"Lab results","post_content":"Creatine 2.6\nFree light chain kappa 13.40\nFree light chain lambda 7.94\n\nWhat does this mean?","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: Lab results","resp_content":"Well, for starters your creatinine is elevated, so there could be some kidney problems. The immunoglobulins (the kappa and lambda) are often a response to a variety of things (like Iga nephropathy, for example) so you will need to talk to your doctor and find out what s/he was looking for when ordering the free chain tests.\n\nSorry I can't be more help.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/1893/lab-results"},{"post":{"author":"jade1956","post_time":"over 3 years ago","post_title":"I wonder what my doctor is thinking","post_content":"Two summers ago, I dehydrated three times. I got everything that was going around that summer and my usual 125 weight went down to 87. The final ER discharge said, among other things, Acute chronic kidney failure, right. My numbers whack out from time to time, though BUN is always high. Sometimes so is creatinine serum and glomular filtration rate is low. My doctor says this isn't really evidence of kidney damage. I ask what it is evidence of, then. Recently, he learned that I had heat stroke at 5 (hospital for 6 weeks) and at 32 (hospital for a month [in the intervening years I think doctors learned that re-hydrating isn't enough; you have to reestablish electrolyte levels, too]) and so that means that of course I'm just dehydrating regularly and that's why the numbers go wonky.\n\nThe ER doctor who diagnosed the kidney damage is the Director of Emergency Medicine at our medical complex. He is a very highly respected member of the medical community and he personally designed a new ER that is never overcrowded and employs only ER trained doctors; not just every doctor who comes along. He has not, in his career, been found to have made a single mistake. Yes, I have a tremendous amount of respect for this man. And my doctor says his diagnosis is wrong; I have no kidney damage.\n\nSo why does my BUN always stay high, and why maybe twice a month, do the other two wonk out? Is it simply a sign that I'm not drinking enough? Or is it evidence of chronic kidney damage?","like_count":"0","tags":["Kidney Disease"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/1903/i-wonder-what-my-doctor-is-thinking"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Copper poisoning","post_content":"Last night at work we had a compressor go out which put copper into our water. I literally drank two pots of coffee throughout the night and today I don't feel very well and I can't get the taste of blood out of my mouth. What should I do? There wasn't an option for poisoning so I posted under kidneys.","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: Copper poisoning","resp_content":"Go see a doctor. Are you actually bleeding? Or do you just taste blood/copper? Either way - see a family doc or go to the emergency.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/1589/copper-poisoning"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"News Flash: Constipation and Kidney Disease May Be Linked","post_content":"A new study has found that people with constipation are more likely to develop kidney disease. The discovery suggests kidney problems might be prevented or treated by managing constipation.\n\nYou can read more about the study results here: http://wb.md/2ez59iV\n\nDo you have both kidney problems and constipation?\n\nSign in or sign up to share your thoughts.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/1464/news-flash-constipation-and-kidney-disease-may-be-linked"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Think you have a kidney stone? What to know:","post_content":"Kidney stones can range in size from a sugar crystal to a ping pong ball, and if you've ever had one, you know they can cause intense pain. Think you might have one? Here's what you should know about symptoms, home care, and when it may be time to see the doctor: http://wb.md/2g1dwDV\n\nHave you ever had a kidney stone? What was your experience?\n\nSign in or sign up to join the conversation.","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/1380/think-you-have-a-kidney-stone-what-to-know"},{"post":{"author":"pandabear90","post_time":"over 3 years ago","post_title":"Is barberry bark extract bad for kidney disease?","post_content":"I want to find a answer to that question\n\nIs Barberry Bark Extract bad to take if you have kidney disease?\n\nDoes anyone know?","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Is barberry bark extract bad for kidney disease?","resp_content":"This is a question best asked of your doctor. It's important to clear anything you are thinking about taking with a medical professional first. In the meantime, you might find this information on barberry helpful: http://wb.md/2e4Fxs1 It does say that it is used for kidney problems but that more evidence is needed to determine whether or not it is effective.\n"},{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: Is barberry bark extract bad for kidney disease?","resp_content":"In addition to checking with your doc, you need to think of something else as well. I'm all for supplements to help with your health, but nowadays, you often just don't know what you are getting. A study in Canada last year found that about 80% of supplements (advertised as plant extracts) studied contained DNA of 'other' things not appearing on the label. So the extract you want to take may be fine, but the other stuff that might be in there might not be. And many things that are advertised to 'help' with kidneys have been known to simply contain lasix (a very cheap drug) and that is the actual pharmaceutical effect that you are getting. So unless the doc thinks it's a good idea, I wouldn't do it.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/1147/is-barberry-bark-extract-bad-for-kidney-disease"},{"post":{"author":"jasaincc","post_time":"over 3 years ago","post_title":"Blood work results","post_content":"I am a 56 yr old male, adopted. Was told a year ago that my blood work showed a concern with my kidney function. This year I was told it was a little worse (Creatine, Serum 1.30). Was told that I have to change my diet and start taking Vitamin D. I am on 25mg (reduced from 50) of Metropolol and 25mg of Simstatin for cholestorol. Had 2 questions, 10 How scared should I be? 2) Is there a way to rejuvenate the kidneys? Any help would be appreciated.","like_count":"0","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: Blood work results","resp_content":"At this point, imho, you are still ok and will be ok for quite some time (keep in mind I'm not a doc). My creatinine was around 10 or 11 before I needed dialysis.\n\nSorry, but there are no ways to rejuvenate kidneys - contrary to what you see online and what people will try to sell you. In the meantime, cut back on sodium (and prepared foods), keep hydrated, and maybe cut back a bit on animal protein. And try to get exercise - that will always serve you well.\n\nKidney problems (especially early ones like yours) can often remain stable for decades. So check your blood pressure and make sure that is controlled as well as your blood sugar if you have diabetes. Talk with a nephrologist. At this point they will probably only see you about once per year.\n"},{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Blood work results","resp_content":"Just to add to what mrscora01 has said, here is an article that contains some general food guidelines for people with kidney problems and kidney disease that you may find helpful: http://wb.md/2dqr6Nu Did your doctor give you a specific meal plan or diet to follow? If so certainly follow that. Please let us know how you're doing!\n"},{"author":"billh99","resp_time":"over 3 years ago","resp_title":"RE: Blood work results","resp_content":"Depending on the version of the calculation that was used and depending on what other things the blood test showed you are just slightly into the reduced kidney function range.\n\nBTW atrovastatin seems to have a slight kidney production value. Talk to your doctor about switching you from simstatin to atrovastain.\n"},{"author":"billh99","resp_time":"over 3 years ago","resp_title":"RE: Blood work results","resp_content":"Depending on the version of the calculation that was used and depending on what other things the blood test showed you are just slightly into the reduced kidney function range.\n\nBTW atrovastatin seems to have a slight kidney production value. Talk to your doctor about switching you from simstatin to atrovastain.\n"},{"author":"billh99","resp_time":"over 3 years ago","resp_title":"I don't know why that posted twice. And \"production value\" should be protection value.","resp_content":"\nAlso if you are on a beta blocker for high blood pressure there are better classes of meds. And ACEinhibitor is suggested to be used for high blood pressure with kidney problems. But note that in some types it is not recommended.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/676/blood-work-results"},{"post":{"author":"zoxuul","post_time":"over 3 years ago","post_title":"Is my Kidney infected? Is it about to fail? or is it something else?","post_content":"So it started a month-ish ago, A pain lower left back side (more towards the spine), at first I thought it was just something from a bad sleeping posture and spending the last couple of years in my bed slouching while playing on my laptop for 6+ hours a day (since 2009 i believe).\n\nI used to sleep on 2 pillows, one was kind of thin and soft, the other was medium and not so soft, so I took out the latter and started sleeping on the thin soft one thinking it may fix my problem. It did, for a while, until this morning. I woke up with sharp stabbing like pain.\n\nIv had a history for kidney stones (left side), had to undergo urethroscopy twice in 2 years, last was in 2012.\n\nMy symptoms today:\n\n1. No pain standing up, but I can still feel like something's wrong and the pain is waiting to burst out.\n2. The pain only occurs when I try to sit down, If i want to not feel the pain i have to sit unrealistically straight.\n3. The pain also occurs (especially) when I bend my head forward and stretch my neck downwards (this pain is unbearable)\n4. When i sleep on my side I don't feel pain.\n5. When i sleep on my back I dont feel pain initially but after 2mins approx the pain starts again.\n6. The pain is completely gone when im lying down on the floor on my back.\n\nI know what kidney stone pain feels like, this isn't it. The pain only occurs when the above mentioned conditions are met.\n\nI havent noticed any foaming in my urine and The color depends on the amount of water i drink (from almost transparent to darkish brown).\n\nI've been standing on my feet for the past 3 hours to avoid the pain, Please help! I've got an appointment with a doc on sunday, but id feel relieved if I could get some answers before hand.\n\nSo is it my kidney? or a possible case of herniated disc?","like_count":"0","tags":["Kidney Stones","Kidney Disease"]},"responses":[{"author":"billh99","resp_time":"over 3 years ago","resp_title":"RE: Is my Kidney infected? Is it about to fail? or is it something else?","resp_content":"No one can diagnose you over the internet.\n\nThere are many different type of back pain causes beside herniated disc.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/960/is-my-kidney-infected-is-it-about-to-fail-or-is-it-something-else"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"22 years old, Chronic Kidney Disease Likelihood","post_content":"I am 22 years old female and have recently been experiencing symptoms of CKD. In the past, I was never really conscious of the amount of water I drank. I had started seeing light foam in my urine on and off a few months ago and I tried improving my habits and drinking more water. I have not been perfect at it but it was definitely better than before. The frothing disappeared but I then started getting lower back pain and tingling in my legs on and off. I was also diagnosed with first UTI this year and have been treated for it. I have been checked for diabetes and high blood pressure and everything was within normal ranges.\n\nLast week, I started seeing very frothy urine after a day of not draninking that much fluid. After drinking a significant amount of water I didn't see foam and it seemed normal. Yesterday after not drinking much fluid again, saw lots of foam in my urine which also calmed down a lot after drinking lots of water. I also have intermittent flank and groin pain with a migraine. Could this definitely be a sign of kidney disease, do I have kidney stones or are all my symptoms potentially unrelated? P.S my last urinalysis was one month ago and everything seemed normal","like_count":"0","tags":["Kidney Disease"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: 22 years old, Chronic Kidney Disease Likelihood","resp_content":"PPS. I do not smoke or drink and only take NSAIDs for period pain once a month.\n"},{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: 22 years old, Chronic Kidney Disease Likelihood","resp_content":"Here is some information about chronic kidney disease, including symptoms, what increases your risk, exams and tests your doctor may use to determine if you do have CKD and treatment options: http://wb.md/2dPJnYU\n\nDo you have a history of kidney problems? Have you spoken with your doctor about your concerns? If not, that is a great place to start as he/she will best know if testing is necessary based on your symptoms and any next steps that you should take.\n\nPlease let us know how you're doing!\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"Hello, thank you for replying. I went to the doctor a day after I posted on this site and she made me do another urinalysis. Everything was apparently within normal ranges except my bacterial count was a little high so she gave me some antibiotics to take for 3days. Got another urinalysis 4 days later and again she said the results were within normal ranges，no protein spillage however I did notice that my urine conductivity seemed to be continually lower than average (when I comapared the last urinalysis I had) and the specific gravity seemed to level of at 1.010. When I was tested for my UTI a couple months ago the specific gravity was 1.015 which is normal with appropriate fluid intake. I heard if your specific gravity levels off at 1.010 that your kidneys have failed or you just drank a lot of water. Considering the doctor did not find any protein in my urine how likely is it that I have kidney failure?","resp_content":"Reply\nAnonymous\nover 3 years ago\nAnd my specifc gravity seemed to level off at 1.010. I heard this could also indicate kidney failure or it could just be a high intake of fluid. If there is no protein spillage, then could it still be kidney failure?\nReply\nAnonymous\nover 3 years ago\nAnd my specifc gravity seemed to level off at 1.010. I heard this could also indicate kidney failure or it could just be a high intake of fluid. If there is no protein spillage, then could it still be kidney failure?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/820/22-years-old-chronic-kidney-disease-likelihood"},{"post":{"author":"jahs495","post_time":"over 3 years ago","post_title":"Stage four PKD disease","post_content":"I am in stage four for Poly-cystic Kidney disease. My Creatine is 1.8, age 74 my GFR is 24. So why would they tell to take insulin for my diabetes when I am in Kidney failure?","like_count":"1","tags":[]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: Stage four PKD disease","resp_content":"Were you on Metformin? It is cleared by the kidneys (and puts pressure on them) so typical when a diabetic is diagnosed with kidney problems (I hate the word 'failure' because it implies 'doesn't work at all any more' and you are far, far from that) they will switch you to insulin. It's standard protocol to help preserve your kidney function for as long as possible. They've probably also told you to stop NSAIDS (like advil and other ibuprofens) for the same reason.\n1\n"},{"author":"jahs495","resp_time":"over 3 years ago","resp_title":"with a gfr of 25? it has been down to 18, they told me i should be on dialysis, but i wont do that. the doctors told me i should be thinking about what i want to do. i wont do dialysis not at my age. thanks for the reply","resp_content":"1\nReply\nmrscora01\nover 3 years ago\nJahs, don't get too hyped up by the eGFR numbers. With a creatinine of only around 2, you still have quite a bit of kidney function. The \"e\" in eGFR stands for \"estimated\" and it's not that accurate. If you feel ok, and most other things are relatively normal (no dangerous potassium levels or fluid build ups), then you probably have quite a bit of time before dialysis might be necessary. To put your creatinine number in a bit of persepctive, mine was about 11.0 or 12.0 when I finally went on dialysis. And it took me about 20 years to get from a creatinine level of where you are at to my high level.\n\nSo don't discount anything. And don't get all wrapped up in the term 'failure'. As I've said, people think in terms of 'not working at all'. So if you have engine failure in your car, the car wont' work at all. But lots of docs use the words \"kidney failure\" when what they actually are talking about is \"kidney damage\". And that process can be drawn out for quite some time.\n\nI had a wonderful lady beside me on the dialysis unit. She was doing hemodialysis and was spending very enjoyable time with her family (many generations thereof). She was in her 90s. There is no reason you can't still have many, many wonderful years of life. And quite a few of those without dialysis. So don't freak out just yet - and now is not the time yet to make a final decision about dialysis. Get knowledgeable about your own condition first and keep track of how you feel. Take good care, and you can continue to have a good life.\n1\nReply\njahs495\nover 3 years ago\n11.0 wow I thought it could only go to 5.0? I think some of my drs are giving me the wrong info. i am seeing Nephurolgist i havent told you everything just the major stuff. i do have protein and blood in my urine, i do not feel well at all. he did give me something for my potassium and on a water retention pill. some days i am in horrible pain, they did a sonogram and my cysts are multiplying. dont know if this true but he said the pain is probably another cysts growing? all i know is i am tired and cant take much more of this. i have dark circles under my eyes and no energy. thanks for talking it helped. thank you.\n2\nReply\njahs495\nover 3 years ago\noh and i am on insulin. lantus. thanks\n1\n"},{"author":"jahs495","resp_time":"over 3 years ago","resp_title":"RE: Stage four PKD disease","resp_content":"thanks so much for the info.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/902/stage-four-pkd-disease"},{"post":{"author":"redac888","post_time":"over 3 years ago","post_title":"Left Renal Pelvis Fullness with no symptoms","post_content":"My ultra sound showed \"Left Renal Pelvis Fullness\" but I have no symptoms and all blood and urine tests are normal. What is the odd this can be serious if I choose to do nothing for now? What other tests can be done to keep this in check? What are possible procedures to drain the urine if necessary? I shy away from CT scans for radiation concern since I have had multiple CT's in other areas in the past.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/905/left-renal-pelvis-fullness-with-no-symptoms"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Kidney stone? A roller coaster ride could help","post_content":"If you've ever had one, you know passing a kidney stone is no walk in the park. But new research suggests that one method of relief for small stones might even be fun: a roller coaster ride to be exact.\n\nYou can read about it here: http://wb.md/2duUcPr\n\nWhat are your thoughts? I don't know about you, but I'm not sure an amusement park is where I want to be when I have a kidney stone.","like_count":"0","tags":["Kidney Stones"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/648/kidney-stone-a-roller-coaster-ride-could-help"},{"post":{"author":"rainag03","post_time":"over 3 years ago","post_title":"1st dialysis appointment","post_content":"My grandmother has her first dialysis appointment next tuesday. What can we expect? We have been on such a roller coaster ride with her health and I want to make sure that I am prepared going into this. She has been such an important part of my life and I want to make sure that I'm doing everything possible to make this as easy on her as it can be.","like_count":"1","tags":["Dialysis","Kidney Failure"]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: 1st dialysis appointment","resp_content":"Dialysis isn't always a lot of fun, but it's do-able. The best you can do is maybe go with your grandmother at first and simply hold her hand. Does she have a fistula or a catheter? And be patient. It can take a while to get her dialysis prescription right (speed/flow, how much to take off and how fast, etc). In the meantime, help her to learn the foods and fluids to avoid and how to take good care of herself. It can seem overwhelming, but most dialysis centers have excellent staff to help with that. Best of luck.\n"},{"author":"rainag03","resp_time":"over 3 years ago","resp_title":"Thank you so much for your advice! I am planning on taking her to her appointment later today and staying with her. I have done some research and listened to the doctors about what foods and drinks to avoid, but if you have any more thoughts on this subject I'd also appreciate it. Is there somewhere where I can get a dialysis diet print out? Will the doctor give this to us?","resp_content":"\nShe does have a fistula as we were told that this is the best option with the least risk for complication and she was a good candidate for the procedure.\nReply\nmrscora01\nover 3 years ago\nCheck out the DaVita site. They have great info and good recipes. Basically, exactly how much and of what she can eat will be based on her blood work and how well they can dialyse her. Try to keep \"healthy\" foods with lots of fiber (and potassium) to a minimum. And also be careful about not overloading with fluid. Anything liquid at room temp is considered a \"fluid\" - including things like icecream and jello. Normally not more than 1 liter per day plus whatever you are still voiding.\n1\nReply\nrainag03\nover 3 years ago\nThanks, I will definitely check that site out. And good to know that liquids are more than just drinks.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/410/1st-dialysis-appointment"},{"post":{"author":"mmurrell2016","post_time":"over 3 years ago","post_title":"Kidneys stones, w/ opioid dependency, please help questions and worries","post_content":"Today I went to have an ultrasound for kidney stones and it appears I have kidney stones in both kidneys. This not yet confirmed until goes to radiology I think she said, but I am almost certain I have them because of pain and my mother had them as well. The dr said theyre not very big, but was hesitant to give me any more information until confirmed results are in next Friday.\n\nI am extrelemely worried to the point where I cant sleep, I am probably worrying my parents to death, and I'm finding it very difficult to wait till Friday for answers. I am a male, 24 years old, and I have a narrow urethra so I am scared to death that is going to be bad.\n\nMy questions are:\n1. My doctor told my dad that they were \"minimal and able to use alpha blockers to dissolve them to dust\", but to be completely honest I feel like he is only making this up to make me feel better.\nIs this even possible to dissolve kidney stones with alphablockers, or any other medication for that matter, to the point where you can pass them painlessly?\n\n2. My second question/worry is that I have been opioid dependant and addicted to pain meds in the past, and have currently been on subxone for 3-4 years and am still taking it to this day, my tolerance is extremely high to opioids although my suboxone dose is now lower than thought possible, like .4mg a day, (I have tried to come off the suboxone several times but have not been able too because of pain I assumed was withdrawals, it makes me wonder if the pain that I attributed to suboxone withdrawal was really pain from the kidney stones this whole time, but I know nothing to prove this. )\n\nWhat are the options for pain medications for this? Is there alternatives to opioids? I do believe I could control myself, especially with my mothers help, if I had to do opiates, but I really am hoping there is a better way to relieve severe pain.\n\nAny insight into this would be so much appreciated as I am scared to death right now, I am sorry for being hysterical and hectic, I am really trying not to be.","like_count":"0","tags":["Kidney Stones"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Kidneys stones, w/ opioid dependency, please help questions and worries","resp_content":"Hi mmurrell2016 As you wait for your appointment Friday you may find it helpful to look through this slideshow about kidney stones: http://wb.md/2d73Sfa\n\nSlide 7 has information about alpha-blockers. It says that they relax the walls of the ureter -- this widens the passages so a stone can fit through more easily. It also has information about other possible treatment options that your doctor may discuss with you depending on the results of the tests that he did.\n\nYou might also want to look through the risk factors listed in the slideshow and discuss with your doctor if they apply to you and what you can do going forward to limit the chances that you will get kidney stones again.\n\nIt may also be a good idea to discuss your history of opioid dependency with your doctor to see if there are other things that he can prescribe or suggest to control the pain. Knowing that you have a history with opioids will help him better treat you.\n\nPlease let us know how you are doing!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/561/kidneys-stones-w-opioid-dependency-please-help-questions-and-worries"},{"post":{"author":"mistressdtrix","post_time":"over 3 years ago","post_title":"New to Kidney Failure? Ditto!","post_content":"Hi,\nI am new to kidney failure. I retired last year - signed up with a new medical provider with my health insurance - went to new doc for a check up and he found that I had high blood pressure and renal failure! I was immediately advised to go home, pack and bag and go to hospital emergency. I thought I was dreaming.\nI spent 5 days in the hospital with my journal trying to make peace with myself, my new lifestyle and my new diet - for life.\nThis is my first time reaching out in public for information from others who are going through with the same or any life-changing event.\nMy doc is currently keeping a close check on my blood levels, so no dialysis as yet, and I am on the kidney transplant list with UC Davis here in Northern California.\nLet me know your thoughts! Thank you.","like_count":"1","tags":["Dialysis","Kidney Failure","Kidney Disease"]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: New to Kidney Failure? Ditto!","resp_content":"Hi Trix. The first thing to realize is that when the docs use the word 'failure', it is relative. To us mere mortals, 'failure' means something has stopped working (like engine 'failure' means your car won't move). But in the renal world, 'failure' can mean anything from slight to more significant damage. It's all relative. My creatinine was at about 10 or 12 (in US numbers, over 900 in units used elsewhere) before I went on dialysis. Now, almost 14 years post transplant, my creatinine results are not 'normal', but reside in the 1.8 - 2.5 range. It's my fairly stable baseline, but some docs just looking at the labs would use the words 'kidney failure'.\n\nAs for dialysis, look hard at doing PD (peritoneal dialysis). It's not used as much in the US as it is in Canada (we invented it). It's often thought of as a third world solution, but it allows a lot more freedom in both diet and in demands on your time. It's easier on your body. All methods of dialysis have their own potential problems so you will have to decide which risks you want to take (they all have risks) and which modality suits your lifestyle best. I tried PD, but ended up doing hemo before my transplant.\n\nCora\n2\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: New to Kidney Failure? Ditto!","resp_content":"I am also new to this creatinine level now down to 2.5 has been there for 2 weeks I spent a month in the hospital creatinine level was 9.8 when admitted docs are saying that this can be controlled by diet. I so not understand. The diets say I should avoid potassium yet my potassium levels generally run around 2.5 thanks for any light on this\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/249/new-to-kidney-failure-ditto"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Introductions","post_content":"Hi All, How about we start things off by getting to know each other. (Only answer what you are comfortable with and of course feel free to add more).\n\n1. Name or the name you go by here\n2. What do you hope to get out of this message board?\n\nI’ll start things off. I’m Addie, and I am your WebMD moderator for this board. I’ve been working with the communities for some time now and am so excited to be able to share these new message boards with you all. I hope that we are able to build a real community here and that we can all come together to share experiences, information, and support. If you have any questions or concerns, please reach out. Can’t wait to “meet” all of you!","like_count":"5","tags":["Kidney Stones","Dialysis","Kidney Cyst","Kidney Failure","Kidney Disease"]},"responses":[{"author":"mrscora01","resp_time":"over 3 years ago","resp_title":"RE: Introductions","resp_content":"Hi Addie. Sorry, but I'm not that fond of the new format. Can't see much at a glance. Am happy about the 'more health conditions' down the side, but with this new format, there is only a tiny amount of info available per page about new posts.\n\nI have about 30 years of experience with diabetic nephropathy (am now almost 14 years post transplant) and have my Joslin medal (50 years of type 1 diabetes). Hopefully my experience will help some folks.\n\nCora\n"},{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"Hi mrscora01 Welcome! We are working on showing more posts right off the bat so that you can see more info at first glance. Hopefully that will solve some of the concerns you mention with the new format. We are excited that the posting glitches many were experiencing in the previous communities are now a thing of the past, and hope that you will stick with us as we grow this new board.","resp_content":"\nI am grateful to have someone with so much experience on the boards, and know that you will be able to contribute so much to those of us here. I hope that we are able to give as much back to you!\n\nHave you had a chance to check out our Diabetes board? https://messageboards.webmd.com/health-conditions/f/diabetes\n1\n"},{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Introductions","resp_content":"I'd like to introduce myself as well!\n\nI'm Morgan, and I am also a WebMD Community Moderator. Addie and I work very closely and love reading all of your discussions and replies.\n\nI hope to be of support to all of WebMD community members in the Kidney Disorders community. I've had many family members succumb to kidney related illnesses, and it's important to me that we all come together and share information!\n1\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"I have a Sister that is at stage 4 Kidney Cancer. Any help to deal with this and help my Sister through the treatment","resp_content":"Reply\nWebMD Addie\nover 3 years ago\nThis is a really great question and I encourage you to make it its own post so that others can see it and offer you the support and information that you need. Simply click on the blue \"Create a Post\" link at the top of this page and paste what you wrote here into the dialog box. You may also find it helpful to join our Cancer Board and interact with the members there as well as here: https://messageboards.webmd.com/health-conditions/f/cancer/\nReply\nWebMD Addie\nover 3 years ago\nHere is some information from one of our cancer bloggers that is for friends and family of those battling cancer and may help you offer the support that your sister needs right now: http://wb.md/2cMJJLM\n\nPlease keep us posted on how she is doing and any ways that we can be of support to you both!\n"},{"author":"pammie1955","resp_time":"over 3 years ago","resp_title":"RE: Introductions","resp_content":"I'm Pam and live in Wisconsin. I have several medical issuses and your board may help me to help me or get me into the right direction\n1\n"},{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"Welcome Pam! We are very happy that you have found us here :) If you have any questions or are looking for some information to help you get started, please let us know.","resp_content":"1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/121/introductions"},{"post":{"author":"stilbee","post_time":"over 3 years ago","post_title":"Kidney disease","post_content":"Does anyone have kidney disease after taking omeprazole? I do I was in tip top shape until the doctor gave me this medicine for heartburn and then didnt moniter it for 4 years, especially when i could of just taken tums. Im really angry about this, Doctor should of checked me every couple of months at least !","like_count":"0","tags":[]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Kidney disease","resp_content":"Hi there and thanks for posting,\n\nI suggest checking out omeprazole in WebMD's Drugs & Supplements center. There, you can read more about its uses, side effects, interactions, overdose information and precautions. Another really helpful tool is the user review section. WebMD has over 450 user reviews, which I highly suggest that you check out, because you might be able to find users who underwent a similar situation who found a solution.\n\nOmeprazole in WebMD's Drugs & Supplements Center -- http://wb.md/2bvsEZF\n\nUser Reviews of Omeprazole -- http://wb.md/2bxnTsp\n\nLet us know what you find! We're here for you ((hugs)).\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/kidney-disorders/68/kidney-disease"}]