[{"post":{"author":"kdhrc","post_time":"12 days ago","post_title":"Are you an African-American or Latino person living with lupus?","post_content":"Are you an African-American or Latino person living with lupus? We could use your help!\nThe American College of Rheumatology (ACR) @LupusInitiative received federal funds from the Centers for Disease Control and Prevention (CDC) to implement a national lupus awareness campaign.\nAs part of the campaign, the ACR and KDH Research & Communications (KDHRC) developed Materials to Increase Minority Involvement in Clinical Trials (MIMICT II). MIMICT II seeks to increase African-American and Latino patients involvement in lupus clinical trials and decrease patients’ barriers to learning about clinical trial opportunities. You can help us improve these materials and ensure that they are an effective way to bridge the gap between lupus patients and lupus clinical trials.\nWe need your feedback on videos for people living with lupus. These videos are part of a program to increase African-American and Latino patients involvement in lupus clinical trials and decrease patients’ barriers to learning about clinical trial opportunities.\nIf you’re interested in providing your feedback, you would complete an online/phone interview and may receive up to a $50 incentive for participation.\nLearn more about MIMICT II here: lupusinitiative.org/mimict-2\nTake the eligibility survey here: bit.ly/usabilityeligibility","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/113513/are-you-an-african-american-or-latino-person-living-with-lupus"},{"post":{"author":"tonysantana201","post_time":"1 month ago","post_title":"Lupus","post_content":"How does someone diagnosed with lupus lower there creatnine levels?","like_count":"0","tags":["Living & Managing","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/111645/lupus"},{"post":{"author":"ashbyrd4","post_time":"2 months ago","post_title":"lupus","post_content":"Has anyone ever been approved for a medical marijuana card for lupus?","like_count":"0","tags":[]},"responses":[{"author":"ElizabethF40","resp_time":"2 months ago","resp_title":"RE: lupus","resp_content":"Following....I thought about the other day\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/107434/lupus"},{"post":{"author":"sullyiv","post_time":"9 months ago","post_title":"False negative drug test by blood","post_content":"The night before I went to my neurologist appointment I had to go to the ER which they gave me an IV and pain meds along with a steroid. The next day I was drug tested by my blood and the results came back negative. I have no clue how all the meds I take for my condition didn’t show up. I take sleeping meds antidepressant, pain meds, anxiety meds, muscle relaxers and plaqunil from my rheumatologist. Please someone help me understand how nothing showed up. With all the drug laws out now they think I’m selling my drugs and not taking them. And cut me off, I have no ideal what to do. Thanks for reading.","like_count":"0","tags":[]},"responses":[{"author":"billistwood","resp_time":"5 months ago","resp_title":"RE: False negative drug test by blood","resp_content":"Well, buddy, didn't you make any detox shake will all these meds? I had such a situation, but it was after a lot of meds and I used them simultaneously. There may be also a chance that the pharmacist gave your detox pills instead of the pills you should get, I used ... detox pills and all the pills I took were taken out. I took this treatment after I used pills for headaches.\n"},{"author":"Anonymous","resp_time":"4 months ago","resp_title":"RE: False negative drug test by blood","resp_content":"Each blood test is taken for a very specific purpose or result, unless a test is requested for traces of a specific medical drug, it won't show in any other blood test?\n"},{"author":"adamwalker2019","resp_time":"3 months ago","resp_title":"RE: False negative drug test by blood","resp_content":"I am not an expert, but I think that they gave you a drug test with a low accuracy. I think that if you will take the drug test a few more times, it will show a positive result. Or maybe you should take another drug test which is more accurate. For example the saliva drug test from https://testcountry.com/pages/saliva-drug-test is very efficient and accurate as far as I know. I have some friends that were tested with this certain drug test, and it has always shown a positive result.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/94626/false-negative-drug-test-by-blood"},{"post":{"author":"taisha914","post_time":"8 months ago","post_title":"what should I do","post_content":"well i'm a 40 yr old just find out I have lupus I didn't know still don't know to much about it I have bad pains in my knees butterfly rash on my face that comes and goes away at times my hair had fallen out so far not doing too well with the change im not on any meds so far taking them so long for me to see lupus doctor I don't know what to do at this point","like_count":"0","tags":["Living & Managing","Symptoms"]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: what should I do","resp_content":"Had Lupus but thank God i contacted Dr Shebi Jr. I saw a post on the internet after i have seek healing for several years from different doctors in DC district. I sent the Doctor a request for help, just some few emails i followed his instruction and he sent me the medication after being paid. Now i am negative and i referred him to all my friend who had this same sickness and they are cured as well ,a trial will convince you. You can reach him via his email: dr.shebijr@gmail.com.....\n"},{"author":"rosiecont","resp_time":"5 months ago","resp_title":"RE: what should I do","resp_content":"Lupus is a clinically complex autoimmune disease that is a skin lesion mainly related to heredity. It is recommended to eat more foods rich in vitamins. Fruit is a good choice. What kind of fruit can be eaten by lupus patients , Apple, coconut, olive, ginkgo, pineapple, grape, orange, sweet orange, chestnut, peach, pomegranate are very good, Lupus patients can eat more.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/94922/what-should-i-do"},{"post":{"author":"Anonymous","post_time":"8 months ago","post_title":"Lupus?","post_content":"I'm a 36 yr old, Native American female. I've been experiencimg some strange things, especially in the past year. Symptoms include parts of my face going numb, eye twitches, fatigue, body pain (especially back and flank pain), weight loss (30 pounds in 4 months, swelling in my face and hands, mood swings, headaches, nausea, the list goes on. My symptoms come and go, generally though, I just feel SICK.\n\nI haven't had a rash exactly, but I do have redness on my cheeks and the bridge of my nose (not raised or itchy).\nMy grandmother had lupus, could I also have it?","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"6 months ago","resp_title":"RE: Lupus?","resp_content":"Possibly...but you can kill whatever it is you are experiencing now by contacting dr.shebijr@gmail.com for a cure on all that you are experiencing ok.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/96004/lupus"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Constant back and leg pain.","post_content":"I will not go into all the medications I take to curb my back and leg pain, let's just say there are several and one is morphine.\n\nI never was a fan of taking a lot of medications, but, if I want to do anything at all in life, I have no choice.\n\nI am a 57 YO male, I had back surgery in 2012, it was successful considering I could not walk, drive, or even pee.\n\nI have what is called failed back surgery. For me, it was a success.\n\nNevertheless, does anyone know if medical marijuana would get me off some of, or all of these medications?\nWould it help me sleep better as I wake up most of the time with spasms?\nCan I just ask my pain Dr if I could try it?\nWhat if he is not an advocate?\nI live in PA\n\nThank you!","like_count":"0","tags":["Living & Managing"]},"responses":[{"author":"gingermom22","resp_time":"over 1 year ago","resp_title":"RE: Constant back and leg pain.","resp_content":"I have experienced back pain for over 25 years. I've gone through epidurals, steroids shots and had the ends of my nerves burned off. Then I finally got back surgery to clean out my spine from stenosis. That worked for awhile but eventually the stenosis returned but with scar tissue. Then I proceeded to have a stimulator inserted in my left lower back. It works to a point, but does not relieve the sharp shooting pains down the legs nor the quick nerve pinches I get. I have spinal stenosis, osteoarthritis, disc damage, sciatica and scoliosis. Just recently went on the medication suboxone. It's a film that goes under your tongue to get into your blood system faster. It's short term buts works great. I then take a medical marijuana drops on my tongue and that works great long term. You can get medical marijuana in different ways, whatever suits you. The only drawback is it's not covered by insurance and can get expensive. I think it's well worth it. I'm starting to be able to get up and do stuff. I still take things slow, but now I can really enjoy them. Good luck to you and you find relief. Pain is misery\n\nGinger\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Constant back and leg pain.","resp_content":"You can ask you doctor is you can try it if it is legal in your state. CBD oil is something to talk with him about also. Don't use THC and drive until it is out of your system at level to avoid DUI. You doctor might prefer to prescribe a muscle relaxer in the evening that might relax your spasms and also help you sleep (Fexeril also anti-inflammation works great for me but there are others).\n"},{"author":"Anonymous","resp_time":"8 months ago","resp_title":"This is good advice, so you never risk a DUI happening in the first place. Any driving while high charge today will bring the same harsh penalties as a DUI, DWI offense involving alcohol as outlined by national DUI lawyers. https://dui.page.link/dui-lawyers-near-me","resp_content":"\nLuckily since the Marijuana laws are finally becoming modernized with allowing legalization for easing chronic medical conditions, getting pain relief with CBD oil is a more viable option today than it was even a few years ago. Just use caution before driving so you can avoid the DUI issue which is severe if arrested for making that mistake.\n"},{"author":"Anonymous","resp_time":"7 months ago","resp_title":"RE: Constant back and leg pain.","resp_content":"Medical marijuana Surterra soothe vape 1 to 1 CBD to THC for daytime and Surterra Relief oral oil for sleep has helped me to remove pain medications. It is an expensive process to find what works best for you. As we age, I find the THC does affect memory. Hope you find answers with your health.\n"},{"author":"earthangel48","resp_time":"6 months ago","resp_title":"RE: Constant back and leg pain.","resp_content":"I have had lupus since 2007 and I can't get a dr to send me to a specialist. I've been on pain medication and went to the dr and asked to be cut down some cause I thought I was on to much and didn't need that much and at the time my dr walked off the job and I ended up with a new dr and I can't get them to stop cutting me down and I'm suffering more than I ever have and I'm also suffering from new health problems and my quality of life has changed so much for the worst. I've become unable to do anything and I'm so afraid of what's happening to me. I got another dr and I keep getting the same treatment. Not one has sent my to a rheumatologist or cared about my health. I don't know what to do or where to go to get the care I need? Everything was so good before my original dr left and now I suffer from white coat syndrome, prediabetic. I never had high blood pressure in my life up until this. I just want my life back. I'm suffering from debilitating migraines again...I am so so lost and always sick and always suffering. I'm to ashamed to add what I cant do since this all happened but noone cares ....this fetynol that has come and created so many problems that dr.s aren't treating us the way they always did. I can't live like this...my laundry, cooking, everything I did, stopped and i just cant do it. I hurt so much and I've never shown any dishonesty in all these years and I'm paying the price for something i don't even know about..i pray to God someone will help cause i just lost the fight...\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/53490/constant-back-and-leg-pain"},{"post":{"author":"honeyowl","post_time":"9 months ago","post_title":"Negative ANA with Lupus symptoms","post_content":"Is it possible to have Lupus even with a negative ANA? I was recently ill with bronchitis (May 26, 2019). After two days on antibiotics I had what I presumed to be pink eye. After 5 days of antibiotic eye drops (started May 30, 2019), my eye was not as red, but it still looked bad. A week later I saw my optometrist whom immediately stated that she believed I had an autoimmune of some sort; possibly Lupus. My PCP ran ANA, Rheumatoid Factor, Uric Acid, C-Reactive Protein, Sed Rate, TSH, and CBC with Diff. All labs were in normal range with the exception of my C-Reactive Protein. CRP was 1.80 md/dL the range is","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/93718/negative-ana-with-lupus-symptoms"},{"post":{"author":"leighhunt56","post_time":"11 months ago","post_title":"New to lupus","post_content":"I recently found out I had lupus. My bloodwork also showed positive for rheumatoid arthritis and hyperthyroid..id had fibro for 20 years. Does anyone else have 4 or more auto immune diseases to live with. I thought fibro was tough. How do you deal with several?","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"liz4237","resp_time":"11 months ago","resp_title":"RE: New to lupus","resp_content":"My ex-SIL has RA and lupus. What helps her most is diet. A plant-based diet, specifically. I recommend watching Forks Over Knives and Heal on Netflix for information and inspiration. There are gobs of plant-based cookbooks in every cuisine, so once you’re past the first month it gets easier. Quitting dairy was a challenge for me, but there are so many substitutes available now, it’s not as hard as it once was. Cashew cheese was a pleasant surprise. You’ve been dealt a challenging path, but you can do it.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/90209/new-to-lupus"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Health insurance for rehab","post_content":"Hi!\nIt's hard for me to ask someone familiar about this. So I require outside help... I'm looking for drug rehab for my sister. She doesn't have any insurance because she didn't work for a long time. I found info about rehabs where you can have treatment without insurance ( https://addictionresource.com/drug-rehab/no-insurance) . Anybody heard about such centers before? What kind of documents do they need? And what living conditions do they propose?","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/87510/health-insurance-for-rehab"},{"post":{"author":"sandhya60","post_time":"over 1 year ago","post_title":"Did forced revaccination of MMR at 53 cause auto immune disorder?","post_content":"I was forced to re vaccinate (baby boomer) due to a shed antibody for MMR, I worked medical field, but after transferring they caught up to me and tested me. It was forced. I had nothing but problems after the forced re vaccination. They wanted to give me a booster, but told them to titer me to determine if the first Vaccine had taken. It had. I reported ill effects I seemed to have for at least a year, if not permanent after the vaccination.\nI then learned through multiple sources there is sometimes problems in revaccinating older adults with the mmr vaccine....anyone?","like_count":"0","tags":["Living & Managing","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/86409/did-forced-revaccination-of-mmr-at-53-cause-auto-immune-disorder"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"A page that keeps track of new treatment options for lupus","post_content":"Anyone else see this thread on reddit?\n\nFeb 11, 2019\nWeb page I made that tracks SLE / Lupus treatment-related news, research, clinical trials, and updates\"\n\nhttps://www.reddit.com/r/lupus/comments/apmrdm/web_page_i_made_that_tracks_sle_lupus/\n\nGood for seeing what's around the corner, in my opinion.\n\nLupus Treatment Report\nhttps://www.lupustreatmentreport.com\n\nWhere do you get your treatment updates and those of you who keep up... how do you keep up? Any other good sources/links?\n\nThanks","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/86277/a-page-that-keeps-track-of-new-treatment-options-for-lupus"},{"post":{"author":"jstryd","post_time":"over 1 year ago","post_title":"lupus and medical marijuana","post_content":"has anyone ever tried it for muscle and joint pain","like_count":"1","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: lupus and medical marijuana","resp_content":"yes and it helps with both. personally I use CBD but it is not quite as effective as mj\n"},{"author":"jstryd","resp_time":"over 1 year ago","resp_title":"RE: lupus and medical marijuana","resp_content":"I just use mj and it works well for me.. I haven’t tried cbd\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/79577/lupus-and-medical-marijuana"},{"post":{"author":"luppie59","post_time":"over 1 year ago","post_title":"Lupus Pain","post_content":"The past few days I've had so much pain from my flare that all I can think about is a CURE. Anyone have info on the best and latest?","like_count":"0","tags":["Symptoms","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/80821/lupus-pain"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Lupus joint pain","post_content":"Just wondering if anyone else has noticed the joint and muscle pain seems stronger in muscles and joints that we're previously injured.\nI have had severe joint pain in parts of my hands that were burnt approximately 20 years ago. Along with pain in several joints that have been sprained, or injured somehow in the past.\nThe joints on the opposite side of my body will also ache at times but no where near the same severity.\nI am new to this lupus thing and am still trying to understand my flare ups and symptoms.\nSometimes I am not sure what is caused by lupus and what isn't.","like_count":"1","tags":["Symptoms"]},"responses":[{"author":"luppie59","resp_time":"over 1 year ago","resp_title":"RE: Lupus joint pain","resp_content":"lupus has attacked many of my joints. What seems tow happen with me is that when in a flare it makes jts I've injured hurt many times worse but will also cause pain in random jts. Its pretty wicked that way\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/78299/lupus-joint-pain"},{"post":{"author":"trulov1115","post_time":"over 1 year ago","post_title":"Pseudogout","post_content":"I’m a 61 yr old women that has been experiencing Pseudogout since 2006. It started in my ankles, then my elbows . but I was not diagnose until 2014 when I was referred to a rheumatologist for lupus. I’m currently on hydroxychloroquine, methotrexate , folic acid and levothyroxine . My question is what do you do when you are experiencing an attack. Because at the moment I’m experiencing an attack in my knees more painful in my left side.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/79881/pseudogout"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Help for photosensitive lips","post_content":"Please can anyone help me. I need some tips for what to apply to my lips. I have been applying a 50+ lip balm but have ended up with blistered lips which then got infected. So painful. Am on anti biotics and they are clearing up - but I am scared to apply anything now. Was diagnosed with lupus in March and am on 400mg of plaquenil. Does anyone have any advice? I wear a hat when I'm out walking and don't walk during the hottest part of the day. I've considered a mask - Help","like_count":"0","tags":[]},"responses":[{"author":"madi29","resp_time":"over 1 year ago","resp_title":"RE: Help for photosensitive lips","resp_content":"If you are avoiding the hottest part of the day and wearing a hat when you are out, maybe your blistering is not from the sun. Are you having facial rashes or other sun-related issues despite these efforts as well? If not, I wouldn't think your lips would be the only thing still reacting to the sun. Do you have sicca (dry mouth, eyes)? Sicca is a common symptom of Lupus, may also be known as Secondary Sjogrens. Lip balms can contain ingredients that can actually be drying. I have tried many, ended up with cheilitis, and saw a dermatologist years ago who told me to only use petroleum jelly on my lips. I have no reactions and I'm good as long as I keep them lubed. You can get a 2.5 ounce tube which will last you much much longer than lip balm for much less money. I hope you find some relief. Best wishes.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/68788/help-for-photosensitive-lips"},{"post":{"author":"livingwithlupus395","post_time":"over 1 year ago","post_title":"Lupus and low Immunoglobulin A levels (IgA)","post_content":"I was diagnosed with SLE 6 years go and am 23 years old. I also have celiac disease. I recently found out that my IGA (Immunoglobulin A) levels were extremely low. I take 200 mg of Plaquenil 1 x per day and I was wondering if that might be the cause. Has anyone else experienced this? I tried looking online but results were slim. Thanks for your help!","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"madi29","resp_time":"over 1 year ago","resp_title":"RE: Lupus and low Immunoglobulin A levels (IgA)","resp_content":"I'm sorry for all you are going through at such a young age. Had your IGA level ever been checked prior to the extremely low level? If not, my thoughts on this is that you probably have had a low IGA level for a long time and you were either asymptomatic or no one linked your symptoms (recurrent infections, chronic diarrhea) to low IGA until after you were diagnosed with two autoimmune diseases, which can also be caused by a low IGA level. Plaquenil has been on the market for over 60 years. If it caused a low IGA level, that information would be available through the FDA. I didn't check the FDA but if you haven't found anything with a simple online search, I would doubt it's an issue. It's most likely that the low IGA preceeded your autoimmune diseases and Plaquenil use. Unfortunately, when you have one autoimmune disease, you are prone to get another. You may want to discuss your issue with your rheumatologist. Good luck to you.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/68874/lupus-and-low-immunoglobulin-a-levels-iga"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"41 years Lupus patient","post_content":"I was originally diagnosed with lupus in Oct. 1977 after it attacked both kidneys. Not until after I started dialysis did the disease go into remission.\nI have had 2 kidney transplants over the years and I'm still in remission. No pain, swollen knees, elbows etc.\nI am currently 61 years old now and on dialysis and doing great. Trying for another kidney transplant!","like_count":"0","tags":["Living & Managing","Diagnosis"]},"responses":[{"author":"allergiestest1","resp_time":"over 1 year ago","resp_title":"RE: 41 years Lupus patient","resp_content":"Hh\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/69942/41-years-lupus-patient"},{"post":{"author":"amybkk2","post_time":"over 1 year ago","post_title":"Looking for health insurance for lupus","post_content":"Hi, I am moving to US and wondering if I can buy health insurance overthere to cover all of the medical cost. If yes, which insurance would you recommend? How much would it cost per month? And will it cover everything like doctor visit, prescriptions, blood tests,..? I am 39 years old and have Lupus for 1 year. Any suggestions would be much appreciated!","like_count":"0","tags":["Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Looking for health insurance for lupus","resp_content":"It doesn't pay 100 percent co pays monthly premiums that could vary. 200 or more go on line and check out for more information\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/60501/looking-for-health-insurance-for-lupus"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Flares?","post_content":"Hi, I was diagnosed with Lupus 11 years ago, I also suffer with depression, fybromyalgia and psoriatic arthritis. Roughly 3 years ago I had what I assumed were lupus flares. These take on a distinct pattern, not wanting to eat or drink, hot and cold chills, excessive sweating, loss of weight and vomiting if I should try to eat or drink, these last 5-6 days then takes me a couple of weeks to get over them. I was admitted to hospital last week following quite a severe 'flare'? these episodes are getting worse and the time between each is getting less. The hospital said it wasn't lupus, likely gastroenteritis, but I am not convinced. Has anyone else suffered with anything like this?","like_count":"1","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/62289/flares"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Weird symptoms","post_content":"Here it goes:\n\nI'm a 24 female with historic of chorionic tonsillitis but had my tonsils removed at age 17.\nOn April I started having heart palpitations randomly so I went to the ER, general doctor there asked for an ECG which come back normal so he prescribed me Xanax 0,5mg/ once a day for 5 days, after 10 days the palpitations stoped. Couple of weeks later they come back this time I also got Ill with zebra I think was a bad cold, I had fever of 38, headaches and mucus. I noticed it took me a long time recovering from that cold. When I got better 2 weeks after since I was still having palpitations I went to the cardiologist. He listened to my heart and told I had a heart murmur I/II degree, did a 24 hour Holter and found I was having tachycardia, and sinusal breathing arritmia. The Dr said it was nothing serious so prescribed nothing. Meanwhile I had lost 5kg in a month ( probably because of the cold). Had an investigation of what was causing the heart murmur so I did:\nThyroid eco: found several cistes on thyroid\nHeart eco- all normal and functioning normal no alterations\nThyroid hormones tested- TSH, T3 and T4 all within normal range\nBlood work- all normal\nNose and throat bacteria test- found a Kleibsiela bacteria on my throat (antibiotics prescribed for that) nose come back clear.\nDuring that time I started experiencing sometimes pain on my left arm ( I thought I would have a heart attack) but it went away\nI had electric shock like sensation down my right arm or shoulder sometimes but it would last miliseconds (that also stopped)\nI experienced sometimes at night my temperature raising and a little bit of sweating (really minimal sometimes just between my breasts a bit)\nI still have excessive hair loss and recently had to have my hair cut short (but I also been trying a new hair relaxer and dye it might be it. I just never had so much hair loss before)\nI noticed jerk like movements when I'm about to fall asleep at the first it happen 3 times now I have muscle spasms constantly they are very small and last miliseconds too\nMy heart had no reason to be having arritmia so I was sent to the endocrinologist.\nShowed all my lad work and was sent to have anti- thyroid anti-corps tested.\nIt takes two weeks for me to get the results so I have to wait.\nSince this first started I have eye discomfort but for the past 3 days I sometimes had something \"flow\" on my peripheral vision but bothers me. It's like I can catch any movement or light and it is just a weird perception and I see even small particles floating on the air.\nSumming up my symptoms are:\n1- heart murmur I-II and palpitations ( tachycardia and sinus breathing arritmia)\n2- hair loss (brittle very thin hair)\n3- eye discomfort and weird vision\n4- neck stiffness and neck pain\n5- neck lymph nodes enlarged and thyroid nodules\n6- weight loss and apetite loss\n7- increase on bowel movements\n8- menstrual cycle alterations\n9- jerky involuntary movements and muscle spasms\n\nIf anybody has any idea what this can be or what other tests I should do please help me out.\nI'm so young.","like_count":"0","tags":["Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/60476/weird-symptoms"},{"post":{"author":"aliadar","post_time":"over 1 year ago","post_title":"Chest pain moving","post_content":"Hello,\nI am 36 and I have SLE, Sjogren's and Antiphospholipid syndrome.\nThis spring after a few hours spent in cold weather, I had fever, a lot of night sweating and lung pain, trouble breathing. CT showed a pleurisy with very little liquid that needed no drainage. They said it must be from Lupus. They gave me paracetamol (acetaminophen) told me to rest and sent me home.\nSince then the fever went away but the breathing problems and pain are still present. I made a new RX and one doctor said it looked fine, another said it is still a very very small ammount of liquid present so sent me to ultrasound. Ultrasound said there is no liquid.\nI have no idea what I have and neither the doctors.\nI also have some colon issues and trouble swallowing food without water. Not sure if IBS-C, but seems that way. When I have issues with my colon, the chest/back/lung pain intensifies and I hear rales in the lower part of lung. It started on the left side, no it is more present on the right side and sometimes in the back. I cannot sneeze, cough or inspire deep. When I go to bed, I have a hard time staying on sides because it is very painful. Any idea what this could be? Sound familiar to anyone?\nThank you!\nAlia","like_count":"1","tags":["Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Chest pain moving","resp_content":"Hi did you find out what it is?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/57130/chest-pain-moving"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Positive ANA, White Blood Cell Count, Lupus?","post_content":"Hi, I'm a 22 year old female college student. I'm the anxious type so I was wondering if someone could give me some info. So, I've been through a few blood tests and there are a few different things that I'm concerned about.\n\nFor one, my Antinuclear Antibody came back as positive, and that by itself isn't a huge deal. It's just that, on top of a positive ANA, my white blood cell count is slightly risen above average.\n\nI don't have an exact number, but that's what my doctor told me. My WBC also isn't actively getting higher, it's just staying in place slightly above the average WBC.\n\nI've also been experiencing a few physical symptoms such as scalp hair loss, fatigue, headaches, heart palpitations, random throat ulcers that only last a day and I'm cold ALL the time. I literally carry a blanket around with me to my college classes because I get so cold.\n\nI don't know if any of those symptoms are really related to Lupus but I was wondering if anyone knew an Autoimmune Disease that it could be related to, considering the white blood cell count and the ANA. Thank you!","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"melanie94","resp_time":"over 1 year ago","resp_title":"RE: Positive ANA, White Blood Cell Count, Lupus?","resp_content":"Maybe it is thyroid related? It might be hypothyroid. Get your thyroid checked. Hair loss and cold are definitely thyroid issues. Any other symptoms?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/42494/positive-ana-white-blood-cell-count-lupus"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"feeling sick ALL THE TIME","post_content":"I almost never do things like this. I respect my doctors and other medical professionals immensely, but I am genuinely desperate. In October (about 5 months ago) I visited my PCP after feeling sickly for weeks on end. I had been having low-grade fevers on a daily basis, joint pain and general aches, and fatigue so bad I would sleep for 16 hours. My blood work came back with normal CBC, but positive for mono. I was given prednisone (which did nothing) and told I would feel better in a week or two. 5 months later, my symptoms have only gotten worse. With my fevers come a bright red butterfly shaped rash across my face, and I am often too sick to get out of bed. I visited the doctor once again, who agreed that the fevers were not likely caused by the mono I had five months ago. She thought there was a chance of an autoimmune condition, so tested my ANA, CRP, CBC, ESR, and for lyme (for good measure). Yet, every single test came back within the normal range. I had been treated for kidney pain recently as well, but all that showed up in my urine was a little protein and white blood cells (but not an amount too excessive). With having tested negative for lupus, lyme, and any sort of infection, I do not know what to think. My fevers have not subsided, and the rash on my face shows up a few times a week at least (it's not itchy, just hot). I also continuously break out in hives, despite having had allergy testing (not sure if this is related). If I don't have an autoimmune condition, lyme, mono, or any infection, why on earth am I feeling so sick and what can I do to feel better? I feel like I have tried everything, and I eat and exercise well. Even pain meds do a poor job of relieving my symptoms. If anyone has any ideas on what I can do to feel better or what the issue is, it would be greatly appreciated.","like_count":"0","tags":["Living & Managing","Symptoms","Diagnosis"]},"responses":[{"author":"melanie94","resp_time":"over 1 year ago","resp_title":"RE: feeling sick ALL THE TIME","resp_content":"Can it be stress related? I'm experiencing weight loss, stiff neck and jerk like movements. All my tests have come back negative so far. I think I'll visit neurologist and ask for more tests. I don't know.\nMaybe you should visit a psychologist to see whether it's stress related or not.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/44072/feeling-sick-all-the-time"},{"post":{"author":"jesswatt","post_time":"over 1 year ago","post_title":"Vision problems from autoimmune disorder?","post_content":"I have been dealing with autoimmune symptoms for quite some time that are widespread. I had tests done last year with ANA of >=1:640 and I was told they would monitor possible lupus symptoms. Anyway, I have started getting weird cloudy blurry vision randomly, especially after eyes are exposed to sunlight without sunglasses. A couple of times, my vision actually went black from the peripheral inward and then vision came back. Only lasted a couple of seconds. Has anyone heard of this before?","like_count":"0","tags":["Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/51144/vision-problems-from-autoimmune-disorder"},{"post":{"author":"jesswatt","post_time":"over 1 year ago","post_title":"High ANA & Undiagnosed autoimmune disorder with list of symptoms","post_content":"I started dealing with autoimmune symptoms over a year ago (I.e. itchy, rashes that scarred, fatigue, nerve issues such as tingling and vibrating, muscle twitching, numbness in toes when cold that discolor, occasional pain in joints. The most recent and slightly disturbing is eye problems. They go blurry sometimes especially after sunlight and a couple times went black for a second. All my symptoms tend to come in flares especially after stress. My ANA was >=1:640 speckled and homogeneous. No other tests came back concerning except I had low C3 and in my metabolic panel, I had high total protein, high albumin and high anion gap. Does this sound familiar to anyone? Does it sound like lupus or something else?","like_count":"0","tags":["Diet","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/51142/high-ana-undiagnosed-autoimmune-disorder-with-list-of-symptoms"},{"post":{"author":"jmt91277","post_time":"over 2 years ago","post_title":"Lupus? RA? Sjogren’s? Do I need a second opinion?","post_content":"I just met with my Rheumy and he offered no diagnosis and no path forward and I am both shocked and frustrated.\n\nFor the past 3 years I have been dealing with joint pains (fingers, hands, wrists, hips, knees, ankles, and elbows). Every morning I wake up feeling like I was hit by a bus. After about an hour or so, I am able to move around and my joints feel bruised. It is symmetrical. For example, both left and right pointer fingers hurt worse than all other fingers throughout the day. I have clear cognitive dysfunction. I forget what I am talking about mid sentence. I will forget what others tell me. I sometimes find myself in a stall mode where I am just staring at my computer screen at work. Its like my brain is refusing to work for me. I use and sometimes type the wrong words. So instead of saying “I drove the car” I would say/type “I used the bike”. These mix ups are so confusing, people around me think I am losing my ever loving mind. Concentration is becoming a huge issue as well. My overall body is achy and feels like a dull pain is covering my entire body. Fatigue is a huge issue as well. I describe it as a powering down of my systems. One minute I will be fine and then I will go through 5 days or so of intense fatigue. I also have sharp stabbing pains going through my left arm and hand throughout the day. It’s so painful that it keeps me up at night and will affect my concentration. My hands go numb when holding my phone or talking on the phone and at night when I sleep. About two years ago I started getting these debilitating back pains. I kept ignoring them until I finally went to the ER and found that I needed an emergency gallbladder removal. I thought everything would be better after that, but the back pains still persist. These pains have the intensity of a contraction. It sounds similar to pancreatitis pains, my my blood tests don’t show any issues with my liver or pancreas. I also have a red rash that showed a little over a year ago. I have just gotten pregnant and assumed it was related to hormones/acne . It is still here and looks similar to a Malar Rash. When the color is more defined I know I am about to get extreme fatigued followed by the back pain and intensification of the above mentioned symptoms. I also get mouth ulcers about 2-3 times a month.\n\nAs for blood work, I have a positive ANA with a titer of 1:1280. I have speckled pattern. I have a positive Anti-SSA (149 strong positive). I have a positive RH Factor (54). I also have an equivocal saccharomyces cerevisiar AB (IGA) at 21.2.\n\nDuring the appointment I had Friday, my Rheumy looked at my hands and said the fingers didn’t bend correctly. He asked if I could open jars and I let him know opening jars, taking my charger out of my phone in the morning is impossible and opening water bottles is impossible in the mornings as well. He proceeded to tell me he thinks I have osteoarthritis even though I am 40 and young for that diagnosis. He asked if my mother had issues opening jars and when I confirmed she did, he said it’s genetics and not Rheumatoid Arthritis. I later saw a table with the differences between the two and found that my symptoms more fit with RA. It is symmetrical pain, it came on suddenly, I have a high ANA and a positive RH factor, etc. He then pushed a couple muscles and when I flinched he said my muscle pain is from not getting enough sleep and possible fibromyalgia, but that he couldn’t help me with that. He then went over all my blood work and said the only thing he sees is that I might be at risk for Sjogren’s. I did ask about SLE, he said if I had SLE then I would have 4 out of the criteria list he gave me. He said the Malar Rash (picture posted) has to be diagnosed by a dermatologist. I don’t have arthritis (which I thought he just said I did and I clearly have all symptoms pointing to it). He agreed with mouth ulcers and positive high titer ANA so I only had two.\n\nHe ended the appointment saying there was nothing he could do for me. I don’t have dry mouth or dry eyes so he can’t make a Sjogren’s diagnosis. He told me to go get a second opinion. I have been shocked since Friday. I clearly have something going on so I am baffled why he is done searching for answers. My first appointment I was five minutes late and he seemed annoyed by me. I overheard him dictating my patient record and he said that he didn’t think I had any issues and that the blood work would most likely reveal nothing. I called him after that appointment and asked him why he felt that my blood work we just sent in wouldn’t show anything. He explained to me that he has been doing this for years and he just knew. He was apparently wrong.\n\nAm I going crazy here, or is this doctor blowing me off? I feel like all my symptoms point to some sort of autoimmune issue. It took 3 months to get into this doctor and get all the blood work results back. I feel like I wasted 3 months and still have no answers. Any advice on where I should go next?","like_count":"0","tags":["Exercise","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"keerthan","resp_time":"over 2 years ago","resp_title":"RE: Lupus? RA? Sjogren’s? Do I need a second opinion?","resp_content":"I still think it's definitely SLE\n"},{"author":"kkat12","resp_time":"over 2 years ago","resp_title":"RE: Lupus? RA? Sjogren’s? Do I need a second opinion?","resp_content":"You should definitely get a second opinion. I've had a similar experience. Remember, Doctors, for all their fancy titles, are humans too. Despite training that's supposed to prevent it, They wind up taking their personal problems into the office or can be just plain incompetent. An ANA of that high means their is SOMETHING auto-immune going on. You should politely ask his office staff for a copy of your lab results (you'll get nowhere by antagonizing them) and get a an appointment elsewhere as soon as you can. With those results, you might even try asking you primary doctor (if you have one) to refer you to someone he/she thinks is good-maybe your primary doc could ask that you be seen more quickly\n"},{"author":"madi29","resp_time":"over 2 years ago","resp_title":"RE: Lupus? RA? Sjogren’s? Do I need a second opinion?","resp_content":"I'm sorry you are having a hard time. I don't agree with anything the rheumy said to you except that you should get a second opinion. Your ANA is high, mouth ulcers, one hour morning stiffness, brain fog and possibly a malar rash. I am not a doctor but I believe you probably have SLE lupus, largely supported by the high ANA. It's not uncommon to have crossover symptoms to other auto-immune diseases, like RA. My advice to you would be to take pictures of anything abnormal including red and swollen joints, face rashes, and any mouth sores. Check the back of your mouth, your tongue, and the roof of your mouth for sores that you don't feel. Also, return to your primary MD with your labs and pics, see if he/she is willing to render an opinion. Lupus is treated both by rheumatologists and some primary MDs. If your primary will at least acknowledge an auto-immune process, see what he/she can do for you. Can they start you on Plaquenil while you are pregnant? Suggest other labs? C3, C4, dsDNA, ESR? If you start Plaquenil, it takes several months to be effective. You and your primary may feel treatment can be handled with him/her. Otherwise, hopefully your primary can treat you temporarily until you can get a second opinion by a rheumatologist. Research rheumy profiles on the clinic website, Google them, check patient reviews, ask around if anyone else sees a rheumatologist and their opinions, use social media for opinions on rheumys if you're into social media. Hopefully you can avoid another experience like the last one. Other things you can do for yourself is to research anti-inflammatory diets to find foods to incorporate in your diet and foods which are making your symptoms worse. Google sleep hygiene and aim for 8 hours of sleep. Get some purposeful exercise every day even a 20 minute walk. Try daily meditation. See if your primary will refer you to physical therapy, especially for your hands. You may want to look into chiropractic, holistic medicine, acupuncture as this may be a long road for you with modern medicine. If you feel depressed, and why wouldn't you after 3 years of this, find a good therapist, research one first. Research Prednisone and be prepared to make a decision if you will ever accept steroid treatment. If you are diagnosed, this may be offered when you are in an acute flare and you should be well educated beforehand, not when you are writhing in pain. And lastly, if you see a doctor or therapist you don't like, research and find a different one. I hope some of my advice is helpful to you. I hope you get some answers soon, and some relief.\n1\n"},{"author":"milkywayz81","resp_time":"over 2 years ago","resp_title":"RE: Lupus? RA? Sjogren’s? Do I need a second opinion?","resp_content":"I know how you are feeling. I don't have answers. I do recommend seeing a different doctor. There has to be answers and you should get them even if you have to get a second or third opinion. I'm in the process of this myself. Not a fun process. You shouldn't have to live life in pain. (hugs)\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/40012/lupus-ra-sjogren-s-do-i-need-a-second-opinion"},{"post":{"author":"milkywayz81","post_time":"over 2 years ago","post_title":"I may have lupus...","post_content":"I've been dealing with chest pain for over a year, almost 2. When it first started I had fluid around my heart and lungs and was diagnosed with pericarditis. After a couple of months the pericarditis started to go away but the chest pain is still constant.\n\n\n\nThe initial Lupus tests came back that I didn't have it. I did blood work yesterday and they are doing a test that is more rare because the doctor said in very rare cases it doesn't show up on the other one.\n\n\n\nMy question is, has anyone else been diagnosed like this?\n\n\n\nIt makes sense that's what I have all my symptoms are lining right up and we've tested for so many other things and nothing is showing up. Its so frustrating having people look at me like I'm crazy and doctors telling me they don't know what's wrong with me and just basically giving up and sending me on to another doctor because they don't know what else to try.","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/47651/i-may-have-lupus"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Sun allergy maybe?","post_content":"I'm not quite sure what's going on with me. I'm a teenager- I was diagnosed with mono at the beginning of January. It's now July, and all my symptoms had gone away. I started working as a lifeguard and swim instructor this summer so I spend 4 or 5 + hours in the sun almost everyday. I've never had any reaction to the sun before, except I've never spent this much time outside before. I've been getting this red rash all the way down the inside/tops of my arms and legs. It's not super itchy or painful- just there. But I've had extreme fatigue and headaches lately; even slight dizziness. I get headaches almost everyday. The fatigue has been awful. It's like no matter how much I sleep, I'm still tired. I do feel slightly achy and dizzy. My pupils also tend to dilate when I have headaches. My mom has lupus and I know she's sensitive to the sun. Some of my symptoms could be a flare up from mono, though. What do you think..? Has anyone had any experience with a rash that follows the inside/tops of your arms and legs?","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Sun allergy maybe?","resp_content":"Yes, you should be checked given the family history and the fact that when you had mono you had a strong immune response which can trigger lupus. I hope it's not\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Sun allergy maybe?","resp_content":"It all started with a rash with me several years ago while on vacation. Sun exposure caused me to get rashes on my chest, arms, torso, hands and also extreme fatigue. I tested positive for ANA and from there it went downhill. They diagnosed me with Sjorgrens Syndrome and I was on Plaquenil. Lupus is extremely hard to detect. I'm assuming because of the inconsistent symptoms. I was like this for years- having sun sensitivity until one year I had terrible joint pains out of nowhere. I believe stressed triggered it. I knew something wasn't right. My Dr ran more test and told me that Lupus was present. Everything made sense from there. Just continue to follow up with your dr and limit sun intake as much as possible.\n"},{"author":"sanadayukitaira","resp_time":"over 2 years ago","resp_title":"RE: Sun allergy maybe?","resp_content":"Xerodema pigmentosa? not quite with the spellings, just XP, unless type A XP, usually not diagnosed at young age and not quite harmful, check with doctor and try to avoid staying under the sun and see if symptoms disappears. also check UV light when you are trying those days\n"},{"author":"atlantametro","resp_time":"over 2 years ago","resp_title":"RE: Sun allergy maybe?","resp_content":"Yes, you can be. My father is allergic to the sun and has to wear long sleeves outdoors so his arms don't break out. A dermatologist said it's a pre-cancerous condition, so don't neglect it.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/10982/sun-allergy-maybe"},{"post":{"author":"mish125","post_time":"over 2 years ago","post_title":"Abnormal blood work. Cause for concern?","post_content":"About 2-3 years ago I was constantly sick but didn’t know why. Just didn’t feel well, rapid heartbeat, dizziness, etc,etc. would feel like I had the flu every month for a couple years. I feel a lot healthier these days due to diet, exercise and supplements but my blood work is still not normal. Is it any cause to worry? My doctor said to see her for more blood work in a year. This is what is abnormal:\n\n1. DHEA- 292 mcg/dL (normal is 23-266) I got this tested a year ago and it was 268 so it’s slowly going up (I’m a 35 y/o female)\n2. Thyroid peroxidase- 60 IU/mL (normal is less than 9)\n3. Thyroglobulin antibody- 2IU/mL (normal is less than or equal to 1)\n4. I also have enlarged red blood cells but no iron, B12, or folate deficiency so they don’t know why my red blood cells are enlarged.\n5. High iron and iron saturation %\n\n\nI tested ANA positive for lupus and have seen a rheumatologist and besides hair loss I don’t have any of the symptoms so they said I don’t have lupus. My mom and sister both have really bad rheum\nEverything else in my blood work is normal (glucose, cholesterol, white blood cells, etc) any thoughts? I would appreciate it. I feel like something is not quite right but every doctor I go to doesn’t seem concerned.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/43102/abnormal-blood-work-cause-for-concern"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Should I be concerned?","post_content":"Just had an appointment with a Rheumatologist to go over my lab results. Even though there were several areas out of the norm - she doesn’t seem too concerned. Here were the things that were red flagged - ANA Screen-15, Chromatin-220, GGT-150 , trace blood in urine, trace leu in urine, ALP -100, BUN -20\n\nI stay fatigued and have lots of aches and pains.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/41201/should-i-be-concerned"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Is it positive?","post_content":"My doctor thinks I have lupus. I had a DSdna blood test and I'm wondering if a value of 110 is positive? The test results are hard to understand.","like_count":"0","tags":[]},"responses":[{"author":"keerthan","resp_time":"over 2 years ago","resp_title":"RE: Is it positive?","resp_content":"Do a fluorescence screening of your blood\n"},{"author":"chatcat76","resp_time":"over 2 years ago","resp_title":"RE: Is it positive?","resp_content":"Please get a second opinion, 3rd, 4th, until you have answers. Lupus is not something to play with - it is a virus and can lead to other issues. THERE are ways to cure or help. But you must be willing to do the research, as many doctors don't want to take the time. YOu can insist on blood testing (viral load), and that is important, even if you can't read it, someone can. And Google will help you. This is not to be played around with and firing doctors who won't help, is best for your health. Keep looking, ask FIRST if they do viral testing. PCP's are usually pretty good, there is no need to have a Rhum. for possible Lupus. That isn't within their speciality unless they want to learn about it.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/37447/is-it-positive"},{"post":{"author":"mb12345678","post_time":"over 2 years ago","post_title":"Autoimmune? MS? Lyme? Something else?","post_content":"To start off I'm a female, 23 years old. Two years ago I had my first son, before his birth I was very healthy. After his birth I developed weird symptoms, skin rashes, dizziness, weakness, joint pain, headaches, low grade fevers, floaters in eyes, dry mouth and eyes, light sensitivity especially in eyes, stomach problems etc. It started with the skin rashes and I went to a derm, they said it could be scabies and gave me multiple rounds of the treatment for that(feel like the cream could have triggered an immune response), still was getting rashes and was on prednisone for awhile. The rashes would come and go. I had my second son 1 month ago and during the pregnancy the joint pain, bad headaches and neck pain, swelling and rashes continued. Had a few incidents of numbness in my hands and feet during the pregnancy. Developed bad sinus problems too. Was getting sinus infections every other month. My OB pretty much blew me off the whole time and said it's pregnancy and go deal with it. The joint and muscle pain was so bad I could barely walk in the mornings and my headaches and brain fog continued to worsen. Since November I've also come down with 3 bad colds and feel like my immune system is non existent. Even when I'm not sick I have chronic sinus problems. Today I just got back from the dr and have a swollen pus filled tonsil, fever, and swollen neck glands. What could be wrong with me? Could my first pregnancy have triggered an autoimmune disease? Could the rashes be Lyme? Or could this be something completely different? Plan on seeing a regular dr this week and getting blood work or a referral. All of these problems have caused me to have bad anxiety as I have no clue what's wrong with me. My OB put me on Zoloft because I think he got tired of hearing me complain :(","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"cakebaker18","resp_time":"over 2 years ago","resp_title":"RE: Autoimmune? MS? Lyme? Something else?","resp_content":"Wow, with the exception of your age and bearing children I'd swear you were me. I was diagnosed with Lupus SLE about 4 yrs ago. It sounds like you may have one or more of the autoimmune diseases. I currently have 3 we are aware of, beside Lupus, there's Sjogrens Syndrome (dry mouth, skin and other things), and Mystemia Gravis (currently has been associated with my left eye only with my lid drooping). The tests for these diseases are very expensive and I believe doctors only want to do them as a last resort to prove to the insurance companies that they've ruled out all other standard illnesses. I do thing you should have that blood work done and be sure you get a copy of write down the results to keep track.\nUnfortunately today sometimes we are our own best physicians asst. Please feel free to send me a message on how you are doing. I really hope you don't have any of them as they are not fun and other people don't understand why one week you have to walk with a cane and the next 2 weeks you don't. It is hard to explain to people what the pain feels like and its exhausting. I wish you the best.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/38436/autoimmune-ms-lyme-something-else"},{"post":{"author":"bieque","post_time":"over 2 years ago","post_title":"Concerns regarding my daughter","post_content":"Back in August, my daughter began having tailbone pain (not related to any type of injury). We saw her doctor who then sent us on to a pediatric orthopedic (she's 15). She went to PT for a month and used an anti inflammatory for 2 months with no improvement. Then during Thanksgiving weekend, she had sudden onset of pain in both knees. The pain is severe enough that she can not use the stairs, can not walk for any prolonged period of time, nor stand in one place for long without pain. We revisited the orthopedic who ran bloodwork and sent her for an MRI. The labwork came back showing low WBC and low absolute neutrophils but the RA was under 14 (normal), C reactive protein was under .2 (normal), Sed rate 2 (normal), and HLA -B27 Antigen was negative. She then referred us to the rheumatologist but we can't get in until February. In the meantime, she began having severe chest pains and shortness of breath. Off to the ER where they diagnosed inflammation of the chest wall and sent her home (no meds). We have no idea what the MRI shows as ortho had it sent directly to the rheumy and again they can't see us for a few months. What is going on?! Is this related to Lupus or are we looking at something else? Ideas and suggestions on how to proceed greatly appreciated.","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"tecoarose","resp_time":"over 2 years ago","resp_title":"RE: Concerns regarding my daughter","resp_content":"Not to scare you but ask for a full body MRI. I have lupus for years but also have Ewing Sarcoma. It's a bone cancer that's a pediatric cancer. Most the time it's misdiagnosed for growing pains. Maybe ask about it. Blood work usually shows not many issues. MRIs are where it's diagnosed.\n"},{"author":"bieque","resp_time":"over 2 years ago","resp_title":"Thank you for the response. It's been difficult to sit on the waiting list to get in to see the rheumatologist. She is scheduled to go in at the end of February. She has her good days (minimum pain and fatigue) and her really bad days that cause her to miss school. No one seems to want to do much....and friends and her grandparents think she's just depressed. There are days which she does get upset because she can barely walk or breath without pain but she is a typical teen who wants to hang out with her friends. She'll rest for 2 days just so she can have enough energy to go somewhere with them and then crashes for another 2 days afterwards. Anyway, they did an MRI of her knees but no one has bothered to look at them yet (they're sitting at the rheumatologists until her appointment).","resp_content":""},{"author":"meme2222","resp_time":"over 2 years ago","resp_title":"RE: Concerns regarding my daughter","resp_content":"Check for avascular necrosis (can happen from eating medications like prednisone). Fix your daughters diet. Anti inflammatory diet! No more white bread. No more milk. The food she is eating could be contributing to the inflammation.\n"},{"author":"meme2222","resp_time":"over 2 years ago","resp_title":"RE: Concerns regarding my daughter","resp_content":"Check for avascular necrosis (can happen from eating medications like prednisone). Fix your daughters diet. Anti inflammatory diet! No more white bread. No more milk. The food she is eating could be contributing to the inflammation.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/34783/concerns-regarding-my-daughter"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"I don't know if it could be Lupus or not","post_content":"I'm 15 years old and for the past 4 years I've been having symptoms that doctors haven't been able to explain. I get a rash over my nose and cheeks and all over my legs and stomach, my hair has been falling out in clumps recently, I've been having seizures, randomly gaining and losing weight no matter what I've been eating, and my fingers, toes, and lips have been turning purple randomly (they don't hurt and this usually lasts around 5 minutes), and really painful swollen joints. I've been diagnosed with Celiac Disease two years ago and Type 1 Diabetes 3 months ago; both are being treated but my symptoms persist. (to be honest I haven't been taking insulin regularly at all and have been in the ER several times for DKA, I don't know if this could have anything to do with it). My parents and general pediatrician are starting to think I'm a hypochondriac and are telling me it's all in my head or that maybe I'm just stressed, but they don't understand how I constantly feel awful, I really don't think it's just in my head. I've also been having a chronic croupey cough that lasted for 3 months before my parents took me to an immunologist to check for asthma and allergies. All the allergy tests came back negative and my lung function test was 50%. The doctor gave me an inhaler and put me on a month long course of prednisone for possible asthma. Even though the prednisone messed with my blood sugar, it helped a lot with my other symptoms. I felt like I had a lot more energy, my rashes slowly started to clear, and the swelling and pain in my joints went down. After the course ended and I was tapered off, I slowly started to feel worse again. My family all thinks I'm just being a hypochondriac and that I'm being paranoid, especially since being diagnosed with diabetes, since my blood tests all seem to come back normal except for an elevated sedimentation rate, high white blood cell count, and vitamin deficiencies. I really don't know much about what's going on, could this be Lupus? I haven't been to a rheumatologist.","like_count":"0","tags":[]},"responses":[{"author":"tagallagher2","resp_time":"over 2 years ago","resp_title":"RE: I don't know if it could be Lupus or not","resp_content":"Hello my name is Teresa i have had systemic Lupus (that deals with ur organs) since 1986 of course back then they didn't know as much as they do these days. I've had Discod Lupus that affects ur skin since about 2004. But u need to go c a Rheumatologist because they will know the proper test to run to c if u have Lupus. I do know u have about 5 of the symptoms u mention that go with lupus.\nSo find u a Rheumatologist to get tested. If possible can u let me know what u find out. Tagurit.Too@gmail.com\n"},{"author":"tecoarose","resp_time":"over 2 years ago","resp_title":"RE: I don't know if it could be Lupus or not","resp_content":"It sounds like it's possible to be lupus or an autoimmune disorder. Even a thyroid problem which can cause majority of what you said. But, you could be getting diabetic neuropathy also. It could be multiple things going on that make it seem like lupus. I have lupus SLE. It's hard to get diagnosed because our bodies don't always show in blood work. But maybe ask Your Dr. To test Your ANA screen. That will let them know a lot more. Your so young. Well wishes to you.\n"},{"author":"tecoarose","resp_time":"over 2 years ago","resp_title":"tecoarose: also I believe SLE covers it all. The organs, skin, etc. I have the all the effects of lupus from the rash, swelling to organs failing. I've had it for about 9 years now. Among other things. I'll pray it's not lupus. It's no fun that's for sure.","resp_content":""},{"author":"meme2222","resp_time":"over 2 years ago","resp_title":"RE: I don't know if it could be Lupus or not","resp_content":"Get a referral to a RHEUMATOLOGIST!!!!! The purple fingers thing... i have it too its Raynauds (poor circulation) you have to keep yourself, your core, WARM. I was on prednisone........i hate that drug.... because of prednisone i got avascular necrosis (avn) in my right hip. AVN is death of the bone...meaning my femur bone is not round anymoreits deterioted and flattened on top. Please please please be mindful of how much prednisone u take! Its a scary drug, ya it reduces inflammation fast... but its going to hurt u in different ways. Good luck ... the journey is stressful especially when your family doesnt understand lupus. My parents thought I was in denial and lazy and over reacted, it wasnt until I was hospitalized the third time for my kidneys... that they finalllllllllllly accepted that i had lupus. Focus on your diet. Your goal should be to reduce the inflammation in ur body. Anti inflammatory diet.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/36504/i-don-t-know-if-it-could-be-lupus-or-not"},{"post":{"author":"mandileee","post_time":"over 2 years ago","post_title":"Waiting on Rheumatologist...","post_content":"What do I do while I am waiting to see my Rheumatologist? I’ve had to wait all through the holidays while their offices were closed after being told my PCP feels I have Lupus but need a diagnosis from a specialist. I am miserable...I’ve added in vitamins and supplements...I want to know what is wrong with me.\n\nSymptoms:\nRF: normal\nANA: positive\nHeadache\nFacial rash\nFacial psoriasis/eczema\nDry eyes\nSores in nose\nDry mouth\nNeck pain\nTingling arms/fingers/hands\nTremors in hands\nSwollen painful joints\nCold hands\nHands change color\nTingling feet\nCold feet\nItchy shins\nExtreme fatigue\nSensitive to cold\nEyes sensitive to sun\nSkin turns bright pink when over 20 min of sun exposure\nSeizure\nDepression\nAnxiety\nSpeech issues\nBrain fog/Concentration problems\nRestless legs\nUrgent urination\nEpstein Barr virus (had mono @14)\nAllergic to bactrim/sulfa drugs\nAnemic\nLow Potassium","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"meme2222","resp_time":"over 2 years ago","resp_title":"RE: Waiting on Rheumatologist...","resp_content":"Anti inflammatory diet. Less stress environments. I know exercise seems absurd given how much pain you are in, but a brisk walk with fresh air can help you. You need to focus on reducing inflammation... start with your diet!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/37461/waiting-on-rheumatologist"},{"post":{"author":"rachaelmichaelle","post_time":"over 2 years ago","post_title":"Lupus","post_content":"Can my lupus cause my birth control to not work?","like_count":"0","tags":["Living & Managing"]},"responses":[{"author":"meme2222","resp_time":"over 2 years ago","resp_title":"RE: Lupus","resp_content":"Switch to an IUD\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/37504/lupus"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Feel like dying slowly","post_content":"I've been tested ANA positive since 2013. Yet not a single doctor (seen 3) since then does anything about it nor cares... ANA positive? Ok great, bye!\nMy condition has deteriorated greatly! Now I get unexplained attacks that we almost have to go to ER (the only thing that's stopping us is the ER bill).\nMy first time I tested ANA positive : 1:320. No treatment was given.\nNow I've tested ANA positive (since 2013 - 2017 always ANA positive) 1:160. My current doctor told me : \"No rheumatologist would want to see you with 1:180. It's too low for lupus\". I asked her to give me a referral anyway. I am like my own doctor!\nRecently had many blood tests done for C3 and C4 components. : My C4 level is 7661 (normal range 0-2830ng/ml) My doctor told me \"you have very high C4, you suffer from mold toxicity). Ok... I do not work nor live anywhere where's mold! Besides if my home had any mold, my other family members would've been sick! But I am the ONLY ONE who's sick and getting sicker by the day! My C3 is elevated as well but slightly. Do patients with lupus have high levels of C3/C4 or patients with lupus have lower numbers generally for C3 and C4 components?\nI feel like I am helpless. Nobody cares no wants to help me. I don't know anymore what doctor to see. Nowadays I feel when my face is getting swollen, my neck and my lymph nodes on my neck. Please help to clarify what high concentration of C4 could mean? Thank you.","like_count":"0","tags":["Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Feel like dying slowly","resp_content":"So to help you out , I have had lupus for over 25 years, my mom has lupus , and my youngest daughter has lupus. I know more about this monster than most Dr.s . But please get professional help with this. I am going to say first of all there are several catagories that they go by in order to diagnose lupus , the ANA is only one as is Rheumatoid factor. In rare casss you can be negative and still have lupus. For most of the last 17 years I have been in remission, which basically means I am not sick enough for rheumatologist to waste his time. So every time I have ever had even a mild flare they say I am a new patient again. This is ever so frustrating as you are finding out. Dr.s that start testing for mold, and valley fever, Lyme disease right off the bat usually sell a huge amount of supplements in their office. I work in the medical field and I don't trust them and neither do most the Dr I know and that it quite a few. Getting that out of the way you need to list your symptoms . Then look up lupus symptoms . If you look like you have lupus st that point you need a new Dr or make sure they see your list, I suggest a diary . I have been in a spiraling down hill flare for about a year. I realize now it started before I realized because I kept having lymph nodes swelling on my head and neck .. and other pain I blamed on she and other iѕѕυєѕ. For the last year I went from running around playing with my grandkids to being mostly bedridden from pain, severe , pleurisy , pneumonitis, memory issues. I can no longer do chores, bathing us excruciating . My point her is you may have lupus and you just can not except no for an answer . My primary care now takes care of all my care as she is frustrated that my rheumatologist was going to make me start over again. I don't think that's fair for anyone , I take prednisone, plaqunil, methotrexate, pain meds lots , and am finally starting to feel better. I know there are new better meds but insurance does require you to fail or not tolerate these medications first, as the new meds are about 10,000 a infusion. Don't give up fight for your right for good medical care. Get another opinion than your current primary. They should at least try some steroids to see if it helps. Although you didn't really share much of your symptoms I'm sure they are more than swollen glands. Good luck and don't give up\n"},{"author":"tagallagher2","resp_time":"over 2 years ago","resp_title":"lulabelle48: hello I agree with alot of what you said I've had Lupus for 32 yrs but thank god I've had 2 good internal medicine drs & a good Rheumatologist.","resp_content":"Reply\nlulabelle48\nover 2 years ago\ntagallagher2: I know it is so difficult , I am on list for a rheumatologist so that I may try rutuximab . My grandson gets it for his auto immune pandas. It works well and side effects just a few days. I try to educate people since an ANA test is only a screen, nit the diagnosis. Positive ANA with out symptoms mean nothing. My self you read the criteria for lupus I am 10:11.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/32989/feel-like-dying-slowly"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Lupus and pets","post_content":"my mom has lupus, along with other medical problems like arthirtis and we currently had to send away a dog that was very dear to me, and as she will not let us get another dog i was wonderin what other animals would be safe for us to have and not hurt my mom.","like_count":"0","tags":["Living & Managing"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Lupus and pets","resp_content":"Is she allergic to dogs , I have never heard of there being a connection . My mom has lupus, I have lupus as does my daughter . I would really like to know the reasoning\n"},{"author":"ps3555","resp_time":"over 2 years ago","resp_title":"RE: Lupus and pets","resp_content":"I have always had a dog. I have had Lupus for 46 years, I was diagnosed in 1972 and I was 13 yrs old. I have never heard that animals can be a problem with Lupus. Only animal I have heard that isn't good are birds. Cleaning the bird dropping and cage can be harmful.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Lupus and pets","resp_content":"I was diagnosed with SLE 40 yrs ago and currently have 13 cats & 1 dog. We have had cats, dogs & ferrets as pets and never was told I had to get rid of any of them so I'm more than a little curious as to why you had to get rid of your dog. I also have Sjrogrens disease, Fibromyalgia, ITP, chronic fatique w/insomnia, overactive bladder & gastric paresis. But I was never told I had to get rid of any of my pets.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/31043/lupus-and-pets"},{"post":{"author":"pegcr","post_time":"over 3 years ago","post_title":"Lupus - a trigger - before and after diagnosis?","post_content":"For as long as I can remember, I have been plagued with sinus infections. Starting at age 17 I began having Migraines with Auras which continue. I had a complete hysterectomy at 30 and developed Bells Palsy at 38. I was diagnosed with Lupus at the age of 43. I began taking low levels of Plaquenil and remarkably it reduced the symptoms & I returned to work after a 2-year layoff. I modified my diet, stress levels and workload and except for flu and sinus infections (which usually lasted 10x longer) I survived with the love and attention of my family and coworkers who constantly reminded me to take care of myself. I developed severe chemical allergies to the point that I had to retire because of the perfume and chemicals in our office. Throughout all of this the only symptoms that I consistently displayed in medical tests were low white blood cell counts (25 - 35). At age 65 I began having problems with my right eye (the right side of my face was the one damaged by the Bells Palsy) but over a three-year period my ophthalmologist indicated that it was the optic nerve which was inflamed and it would go away. I should have sought a second option. This year at age 68 I lost vision in my right eye and it has been diagnosed as Non-Arteritic Anterior Isochemic Optic Neuropathy (the optic nerve is permanently damaged). Doctors assure me this was not caused by the Plaquenil; however, realizing there is a slight chance of damage from the drug, I have stopped taking it as I certainly can't afford to lose sight in my left eye. I am posting this because I believe my own experience with Lupus has shown me that the disease causes significantly more damage to my system than is obvious and that it shows up in non-standard ways, probably long before it is diagnosed. I think that because Lupus is usually not outwardly visible, we and our doctors fail to understand its possible detrimental effects on other illnesses or diseases. As Lupus patients we need to watch all symptoms and illnesses and assume the worst. That way we delve deeper, question more, and take charge of ourselves. If we're not satisfied with what our caregiver is saying we need to seek other opinions. We must advocate and make sure everyone around us understands the significance of the disease and its possible deadly consequences. That includes our family, colleagues and medical team.","like_count":"1","tags":[]},"responses":[{"author":"debiblueeyes","resp_time":"over 3 years ago","resp_title":"RE: Lupus - a trigger - before and after diagnosis?","resp_content":"Very similar medical history. I am having extreme finger pain so will keep this short. Also if anyone knows of a dictating program that will type for me please let me know! You didn't say what type of lupus. I have the kind mostly in my joints I may also have RA. I have Shoegren's and Raynard's too. My dentist recently diagnosed me with Burning Mouth Syndrome. This is due to years of dry mouth. My teeth became soft and I am loosing them. Partly from ten years on Prednisone. Just curious what meds you take. I take 3 Vicodin a day and am getting very little relief that's it along with OTC Aleve. Drop me a message, Debi\n1\n"},{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"debiblueeyes: I get ocymorphone er for pain, it really helps, I can not even walk without it. I can't even take a shower . I am one year into a very severe flare, joints, mouth nose sores, dry mouth and eyes, pleurisy , pneumonitis , kidney function, lymphodema, biliary spasms, edema in my lower legs , it's been a real hell.. but after reading your story I think it's time to get my eyes checked","resp_content":""},{"author":"pegcr","resp_time":"over 3 years ago","resp_title":"RE: Lupus - a trigger - before and after diagnosis?","resp_content":"I'm sorry to hear of your continuing issues. I took Plaquenil for 20 years but just stopped it because of the loss of my sight in my right eye although the retinal specialist assured me that the damage to my optic nerve was not caused by the drug. The reason I stopped is because I can't afford to take any chances with my other eye, even if the possibility of its being damage from the Plaquenil is remote. I take a baby aspirin every day and avoid all other drugs with the exception of ibuprofen occasionally or Sumatratripan for really severe migraines. I found that Aleve offers little to no relief for me which is strange because it is very effective for my husband's occasional pain. I try to stay as active as possible no matter how much I hurt - swimming, weights, stationary bike. I'm about to start yoga because since I stopped taking the Plaquenil my possible really aches. Hope this helps. Peg\n"},{"author":"bettynow","resp_time":"over 2 years ago","resp_title":"RE: Lupus - a trigger - before and after diagnosis?","resp_content":"The inflammation lupus causes to the eyes is under-recognized, in my book. I have had frequent cases of iritis due to lupus. I lost the vision in my right eye to endophthalmitis (infection inside the eyeball), which is nearly impossible to get unless you've just had surgery...or if you have lupus. I got the vision back in that eye--what vision I have. I have had four corneal transplants: lupus causes iritis which in turn causes me to reject the transplant. I've had 13 surgical procedures on my eyes in all. Lupus hasn't caused all of them, but it certainly has been a contributing factor. I see corneal and retinal specialists at a major university. Yet few ophthalmologists are knowledgeable about lupus. This is why, as you say, it's so important for us patients to be aware and educated.\n\nI have no doubt the lupus caused the inflammation to your optic nerve, not the Plaquenil. I say this because Plaquenil DID damage my macula (the central part of the retina), and I've had many conversations with specialists about this. Plaquenil does not damage any other part of the eye--ever. There are specific tests that will indicate not only when there's retinal damage, but if it's due to toxicity, which would be the Plaquenil. The condition is called toxic retinopathy. It's very rare and only occurs in a tiny fraction of people who take Plaquenil in large doses for many years (like 20). The chances of it harming any other part of your eye are 0%. Plaquenil is a great lupus medication because unlike the other lupus meds, it doesn't suppress our already-compromised immune system. I hated having to go off it, but I had to. If you don't have to, please don't go off it due to needless concerns about the rest of your visual structure.\n\nI realize I'm responding to an older post, and you probably won't see this, but others might.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/3147/lupus---a-trigger---before-and-after-diagnosis"},{"post":{"author":"dtruxal","post_time":"over 2 years ago","post_title":"Blood count numbers","post_content":"I have had my CBC done a few times in the last 6 months and the same as 5 things are off on them all.\n\nRDW SD is 34.2\nNuer auto is 69.5\nMCHC 37.2\nMCV 79.9\nLymph % 21.4\n\nThe rest are normal or borderline, are any of these concerning? Or anything I should be asking about?","like_count":"0","tags":["Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/36315/blood-count-numbers"},{"post":{"author":"adelejj","post_time":"over 2 years ago","post_title":"Systemic Lupus Erythematosus - Possible breakthrough drug Lupuzor","post_content":"Finally there could be hope for millions of sufferers of Systemic Lupus Erythematosus. Today UK company ImmuPharma announced the last patient had received their last dose in its Phase 3 trial of SLE drug Lupuzor (also known as IPP-201101 or Rigerimod) with the trial due to end in January 2018 and readout shortly afterwards. Results so far have been impressive, with the Phase 2b trial indicating Lupuzor could be more efficaceous, faster acting and lack the side effects of GSK's Benlysta (Benlimumab) together with being available at a lower price. One to watch in the coming weeks and would love to hear from anyone who took part in any trials.","like_count":"3","tags":["Diet","Living & Managing","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/34963/systemic-lupus-erythematosus---possible-breakthrough-drug-lupuzor"},{"post":{"author":"maryann89","post_time":"over 3 years ago","post_title":"Lupus or scarcoidosis","post_content":"My blood test show. ANA positive (speckled pattern)\nESR elevated and my ACE elevated.\nDr is not sure if it's lupus or scarcoidosis. Anyone have any thoughts on this?\n\nI was also reading a book that Sulfa can cause a flare in Lupus patients.\nIn Dec 2016 I had a UTI and my primary physician gave me sulfamethoxazole..... a certain antibiotic.\n\nThis was what it said on the Lupus site\n\n\"Bactrim and Septra are often prescribed for bacterial infections, especially urinary tract infections. They are also sometimes given prophylactically (i.e., to prevent infection), especially in people taking immunosuppressive medications. However, it is very important that you avoid Bactrim and Septra, because these antibiotics are known to cause an increase in sun sensitivity and lower blood counts in people with lupus, resulting in lupus flares.\"\n\nhttps://www.hopkinslupus.org/lupus-info/lifestyle-additional-information/avoid/\n\nSo I'm confused? Is it Lupus? Could it be both?\n\nHowever, I recently have been started on Hydroxychloroquine (plaquenil)\nI started my first pill yesterday. What should I expect?","like_count":"0","tags":[]},"responses":[{"author":"Shubee1965","resp_time":"over 3 years ago","resp_title":"RE: Lupus or scarcoidosis","resp_content":"Hydroxy for me is a mild medication. I've been taking it for years for Lupus. Just be sure to get annual eye exam with visual fields. It can affect your color vision but I have never had that problem after 26 years of taking it.\n"},{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Lupus or scarcoidosis","resp_content":"Bactria makes you more sensitive to sun which the sun already triggers lupus flares\n"},{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"lulabelle48: I take plaqunil , 1000 mg a day along with prednisone and methotrexate , the plaqunil is the lesser of the 3 I take","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/5499/lupus-or-scarcoidosis"},{"post":{"author":"petcrazed","post_time":"over 3 years ago","post_title":"Muscle tears-","post_content":"I have lupus and rheumatoid arthritis I have noticed that I seem to get muscle tears very easily is this due to these diseases? I also have tendinitis in numerous tendons","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Muscle tears-","resp_content":"Yes\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/5792/muscle-tears-"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"I need answers o lupus as everything comes up negative yet naturopath says it positive and I have rashes","post_content":"Rash on face hands and it won't go away.Im tired all the time.One doctor said it looks like Lyme disease.Dies anyone think they can help as I'm at my wits end.My life is passing me by.","like_count":"0","tags":["Diet","Living & Managing","Symptoms","Diagnosis"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: I need answers o lupus as everything comes up negative yet naturopath says it positive and I have rashes","resp_content":"Are you bringing treated?? Rash usually clear up with plaqunil\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/6950/i-need-answers-o-lupus-as-everything-comes-up-negative-yet-naturopath-says-it-positive-and-i-have-rashes"},{"post":{"author":"jersep","post_time":"over 2 years ago","post_title":"Happy with your Phoenix rheumatologist?","post_content":"The rheumatologist I am going to does not take adequate time with patients so we do not improve. If you have a doctor who knows autoimmune disorders with good patient skills, I need to get out of his office. I appreciate knowing.","like_count":"0","tags":["Treatment"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Happy with your Phoenix rheumatologist?","resp_content":"Wish you luck\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/7953/happy-with-your-phoenix-rheumatologist"},{"post":{"author":"hazel34","post_time":"over 3 years ago","post_title":"Should I tell people at work that I have lupus?","post_content":"Since my diagnosis I've been struggling with whether or not to tell my boss or my coworkers that I have lupus. So far I've been able to control my flares to the point where they haven't interfered with my work, but I worry that won't always be the case. I don't want my boss to think that this will be a detriment to the company or my work and I don't want the others to think that I am being given special treatment. A lot of the time my symptoms are things that you can't see on the outside like joint pain and migraines, so I also don't want them to think that I'm just faking it. I don't think that there is a lot of understanding about lupus and what it's like to have it so I worry people won't be as sympathetic and just won't understand. Has anyone here made this decision and how did it play out?","like_count":"1","tags":["Living & Managing"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Should I tell people at work that I have lupus?","resp_content":"I just mentioned it like it wasn't a big deal , then when everyone goes what??? I didn't know that I would tell them I've always had it mostly under control, and that yes sometimes I hurt but who doesn't.. that way if you do have a unforeseen big flare, they are more understanding , and will have no reason to think you won't be back to work and in full force, or understand your retirement\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/508/should-i-tell-people-at-work-that-i-have-lupus"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Do I have Lupus?","post_content":"Im 18 and I had blood work down in 2014 for joint pain and the doctor said it was a false positive and tested me again and never heard about it again. I switches doctors and she told me I tested positive 2 time in 2014 for my ANA test. My \"Value\" was 1:80 both time but my WBC was normal and my Neutrophils were always up and down. A couple time lowr then average. My new doctor made me get more blood work and this time I tested positive for ANA with a 1:160 and my WBC is 3.4 which it says it's low and my Neutrophils are low(1.37) too but other then those 3 test all the other test are fine. My doctor said she doesn't know what is going on and is sending me to a Rheumatologist but my appointment isn't until 12/26. Any opinions on what it could be? Please help.","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Do I have Lupus?","resp_content":"If you are having symptoms write them down for the dr.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/25709/do-i-have-lupus"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"What You Should Ask Your Doctor About Lupus","post_content":"Have you just been diagnosed with lupus? We know that this can be a confusing and stressful time, so we’ve put together a list of 10 questions that you should ask your doctor about lupus:\nhttp://wb.md/2pgYr2e\n\nFor those who have been living with lupus for some time now, is there anything you’d add to this list? What do you wish you would have asked your doctor at that first appointment post-diagnosis?","like_count":"0","tags":["Living & Managing","Treatment","Diagnosis"]},"responses":[{"author":"tcorbs","resp_time":"over 2 years ago","resp_title":"RE: What You Should Ask Your Doctor About Lupus","resp_content":"Some of the medications for lupus can cause birth defects so anyone pregnant with lupus needs to consult with their doctor about safer alternatives. Birth Defect Research for Children (BDRC) is a great site to visit for those dealing with birth defects.\n"},{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: What You Should Ask Your Doctor About Lupus","resp_content":"Good list\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/7782/what-you-should-ask-your-doctor-about-lupus"},{"post":{"author":"maycatmom","post_time":"over 2 years ago","post_title":"Could this have to do with autoimmune?","post_content":"Reaching out to anyone with autoimmune kiddos out there. My 14 y.o. daughter has had some markers for autoimmune show up in her bloodwork twice in the past year and is just being monitored periodically by our rheumy at this point. ( I am diagnosed with lupus). She had a bizarre episode Wednesday night that took us to the ER and was admitted but they didn't find anything. She was cheering at football game Wednesday, just fine one minute, then suddenly was in intense abdominal pain, in the center of her stomach. We went to leave, and she could barely walk, was doubled over. I sat her down to get the car and within less than the minute it took me to get back to her she had vomited and become extremely lethargic. She said everything went blurry, she was very unaware of her surroundings, and really dizzy. I put her in the car and she was in and out of being awake (passed out?!) Drove to the ER, they did bloodwork, blood pressure pretty low, iv with fluids to hydrate, her pain levels went down within an hour significantly. No fever, did an ultrasound on her ovaries and appendix which showed a minimally enlarged appendix. They monitored her over night, and as nothing really showed up and pain went down to a 1-3 by yesterday afternoon and she pepped back up, they released her. Other than 2 bloodynoses in the last 24 hours, that's it! Following up with pediatrician this afternoon. Do I also check in with rheumatologist? New to this with her. No idea if this has anything to do with autoimmune and I know a lot of doctors never correlate anything to that. Sorry for the novel, just concerned. Thank you for any thoughts on this.","like_count":"0","tags":["Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Could this have to do with autoimmune?","resp_content":"My mom has lupus she was diagnosed at 32, I have lupus and was diagnosed at 33, my daughter has lupus and was diagnosed at age11, my daughters had many different symptoms than me or my mom at diagnosed. But when I was a teenager I had symptoms like your daughter , the stomach aches I had were horrible. But she could have had a mild case of appendicitis , my granddaughter went through this recently.. but I say since you have lupus and she starts having strange things going on ask for her to be checked. They know it runs in families\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/26306/could-this-have-to-do-with-autoimmune"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"im confused","post_content":"i am 49 year old female. The first time i started realizing something was wrong was when i went walking and my whole face turned read and i hadnt been outside that long. i took sometime for the redness to go away but i just didn't realize that i was getting sick, I just thought that i was just out of shape. these are the many symptoms that have started happening after this. This started 4 years ago which lead me to the dr 4 with extreme fatigue, hair loss, extremely bad headaches, rash,and my body felt like i had the flu. All of this lasted for 2 months until i went to the dr for medicines. My blood test showed that i had extremely low vitamin D. But even with all the blood test, ultrasounds and xrays and rhmutalogist exams they still cannot pinpoint a specific condition. i am gabipatine medicines for leg pains, muscle spasms for shoulder pains and ibprofin for headaches. my knees can hurt so much that if i bend them it takes a little bit to straghten them before i walk. i get extremely dry eye conditon that can last for weeks. and a rash that can be so bad that i need steriod pills to aleviate the itchying. i cant stand the sun, because it makes my chest hurt and feel so sick that it takes a while to recoperate after being outside so i hide under umbrellas or jackets to cover from the rays. My blood test show that i am 320 titer, speckled blood and positive ana. Any suggestions as to what this could be.","like_count":"0","tags":["Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: im confused","resp_content":"You sound just like me! My vitamin D is extremely low and I had a positive Ana test in 2015. I'm currently trying to figure out if it is CREST syndrome or Lupus. I've been told my whole life I have lupus, but now I do not know. I would bring up these conditions to your doctor and see if they seem like they could be an answer to this!\n"},{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: im confused","resp_content":"Have they suggested lupus, because you could be describing me, I have a few more....\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/27287/im-confused"},{"post":{"author":"optimisticmommy","post_time":"over 2 years ago","post_title":"20yrs and counting","post_content":"Have had sle for 20yrs already and my has it been tough but NEVER has it been this bad. I'm a new mommy of two and a new wife.:) have managed my flares on my own with clean foods exercise and tons of rest. I no longer have that luxury. I have a babies and s husband to tend to. I'm losing my strength and mind and don't know how and when it'll get better. I've never experienced all lupus symptoms till now. Wish I could fix me","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: 20yrs and counting","resp_content":"Congrats on your marriage and your little one! Are you on any medications? Might be worth talking with your doctor about that or other treatment options for when you have a flare as it sounds like your symptoms are getting worse. I know that you are a busy momma but make sure that you are still taking time for you. Your health is important :)\n"},{"author":"optimisticmommy","resp_time":"over 2 years ago","resp_title":"Thank you. It's been the craziest roller coaster ever. Come to find out my lupus is completely under control due to my nutrition and herbal supplements but can possibly developing something else. I'm terrified! I do my best to put myself first sometimes in order to take care of my family but now I'm scared of the unknown. I mean... what comes after lupus??!","resp_content":""},{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: 20yrs and counting","resp_content":"I'm with you on this , I have always been able to control. But I can't now I am to weak, too much pain, to sick .. most horrible year of my life.. good luck\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/27359/20yrs-and-counting"},{"post":{"author":"melorey1","post_time":"over 2 years ago","post_title":"Do I have Lupus","post_content":"My doctor took blood maybe a year ago and said I have Lupus all he said not to worry and to go to find out what it is. I also suffer from fibromyalgia anxiety depression bipolar PTSD. so I started going to a rheumatologist she said that I don't have Lupus cause I don't have the butterfly rash my neighbor has Lupus as well and she doesn't have the butterfly rash,but I have several symptoms\nFatigue\nMy hands and feet turn blueish when cold\nJoint pain\nFever on occasions\nBack and neck pain\nSunlight I have to wear sunglasses and I get fever blisters and sometimes rashes.\nChest pain and when breathing in deep it hurts sometimes. I just don't know what to do can you help me please","like_count":"0","tags":[]},"responses":[{"author":"susiekp","resp_time":"over 2 years ago","resp_title":"RE: Do I have Lupus","resp_content":"I myself don't have lupus, but my sister does. She lives at the beach, but with the SPF30 shirts and lightweight slacks from REI, she does okay. I know she does a lot of casual cycling, wearing plenty of sunscreen and a hat. She never took medication at first because she is so stubborn. But now she does, because of the danger to her organs.\nI, on the other hand suffer from RA and have been under the care of a wonderful rheumatologist for years now. My mom, uncle, and all my first cousins (along with some of their kids) suffer from a variety of autoimmune diseases, which includes RA and lupus. I don't know if others in your family suffer from lupus or rheumatoid arthritis, or PsA (psoriatic arthritis, with or without the skin lesions of psoriasis), Type 1 (insulin-dependent) diabetes, which appeared in otherwise healthy, active adults in 40s and 50s. You really need to have blood work done by your rheumatologist, and if she is too vague about the results, ory you're not satisfied that you were getting the proper treatment or information from the rheumatologist, I'd say it's time for a second opinion. Autoimmune conditions or diseases aren't something to fool around with. Infections can invade the body without major exposure. I hope you do or have found answers and relief\n"},{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Do I have Lupus","resp_content":"Not everyone gets butterfly rash, I think some of these dr.s need to learn more or just say they don't treat lupus . It's s very difficult disease.. get another dr\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/30772/do-i-have-lupus"},{"post":{"author":"4doggies","post_time":"over 2 years ago","post_title":"I am currently being infused with Benlysta. After 10 months, the Dr. doesn't see any improvement in my blood work. The side effects include severe depression and insomnia. Will I experience any withdrawal symptoms after treatments are discontinued ?","post_content":"Side effects of Benlysta","like_count":"0","tags":["Symptoms","Treatment"]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: I am currently being infused with Benlysta. After 10 months, the Dr. doesn't see any improvement in my blood work. The side effects include severe depression and insomnia. Will I experience any withdrawal symptoms after treatments are discontinued","resp_content":"Let us know\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/31582/i-am-currently-being-infused-with-benlysta-after-10-months-the-dr-doesn-t-see-any-improvement-in-my-blood-work-the-side-effects-include-severe-depression-and-insomnia-will-i-experience-any-withdrawal-symptoms-after-treatments"},{"post":{"author":"lupusmillennial","post_time":"over 2 years ago","post_title":"Lupus or Not Lupus?","post_content":"So I have tested positive for ANA twice at the 1:160 level. The test also showed \"ANA Qualitative: Positive, Pattern: Speckled.\" I am 33 years old, Asian, and generally in good health (until now).\n\nEarlier this summer, after unexpected sun exposure, I had a red rash that followed the curve of my left cheekbone. (It did not have this on the right). It was extremely itchy at times and lasted for nearly a month. I actually thought I had skin cancer and made an appt with a dermatologist, but then the rash suddenly disappeared.\n\nI was exposed to sun again. A week after the rash disappeared, my left knee became so painful that I couldn't walk for three days. X-rays did not show evidence arthritis and the MRI showed no tears. This went away for about a month. Then I was exposed to sunlight again, and I ended up having terrible joint pain on both knees this time.\n\nNow my kidneys show \"decreased functioning,\" and I have to sleep at least 9 hours a day to be functional (to be fair, though, I've always needed a lot of sleep). I lost a job because of this; I used to work 60-70 hours a week, and when I could no longer perform at that level (this was during the period of my joint pain + excessive sleeping), my boss fired me immediately.\n\nMy nurse practitioner (the rheumatology office was too busy to let me see a doctor, so they had me see their nurse practitioner instead) said that the rash was probably just an allergy because the butterfly rash appears on both side. She also thinks I just have arthritis.\n\nNow something ELSE is wrong: I am losing hair rapidly. I have lost legit 30% of my hair. Same nurse practitioner recommended I take vitamins.\n\nI have a new job now that is less demanding, but I'm terrified of this happening again. What do you all think? Does this sound like Lupus or am I just being a hypochondriac?","like_count":"0","tags":[]},"responses":[{"author":"lulabelle48","resp_time":"over 2 years ago","resp_title":"RE: Lupus or Not Lupus?","resp_content":"Sounds like lupus to me, it really does. I have had that run around and trust me it can go away or remission for long periods and for some never returns. Me 17 years remission now I am only the same person inside. Mine came back with a vengeance . Get another opinion.. do a diary.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/32100/lupus-or-not-lupus"},{"post":{"author":"4doggies","post_time":"over 2 years ago","post_title":"Side effects of Benlysta","post_content":"I am currently being infused with Benlysta. After 10 months, the Dr. doesn't see any improvement in my blood work. The side effects include severe depression and insomnia. Will I experience any withdrawal symptoms after treatments are discontinued ?","like_count":"0","tags":["Symptoms","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/31581/side-effects-of-benlysta"},{"post":{"author":"dozzi","post_time":"over 2 years ago","post_title":"Vision","post_content":"On 3 episodes I had vision issue things I see are out of sorts lasted a few seconds then disappeared","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/30350/vision"},{"post":{"author":"mangojuliana","post_time":"over 2 years ago","post_title":"Drug induced lupus erythematosis?","post_content":"Hi,\nI am a 27 year old female and I wanted to know if it was possible for me to have developed DILE. After reading up on this condition in online medical journals, it seems to be the only thing that makes sense. The only unlikelihood of this is that it typically affects women over 50. I started taking Wellbutrin XR about 3 and a half months ago and started experiencing on and off low-grade fevers, fatigue, terrible joint and muscle pain, along with swollen lymph nodes a couple times. I usually only get sick about 3-4 times a year and I started getting \"sick\" every two weeks, then every week, then almost every day. I have never experienced this in my life so I went to get blood tests done and everything came back completely normal and I was told I didn't have any cold or flu. The doctor was puzzled and could not come up with any possibilities of a diagnosis. I suspected I was having a bad reaction to the Wellbutrin so my psychiatrist has put me on a taper plan to get off this medication (I have 4 days left). This morning I woke up in tears because the joints and muscles in my arms and hands were hurting so bad they felt like they were on fire. I am hoping these symptoms will subside after discontinuing the medication. Unless my symptoms become worse and do not away, I don't think there will be any point in going back to the doctor. Has anyone else experienced this from a medication? I know there are four medications that have been proven to cause this and there are at least 50 more medications that have been reported to cause it (Wellbutrin being one of them) but not actually proven. Luckily, if I do have this condition it is said to completely go away after stopping the medication.","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/28468/drug-induced-lupus-erythematosis"},{"post":{"author":"okiecobb","post_time":"over 3 years ago","post_title":"Could I have Lupus?","post_content":"Hello, I am a 26 year old male living with a variety of ailments yet to be treated effectively. After extensive research online, I have several reasons to believe that I am one of the few male suspects with lupus.\nAt age 8, I began losing hair in splotches along the back of my head which would soon be diagnosed as alopecia areata. Shortly after, strange reoccurring rashes began forming along my knees and random places around my arms and neck. These rashes were diagnosed as both a dermatitis and eczema by different dermatologists. These rashes and stints of alopecia have occurred randomly and consistently throughout my life.\nAt age 14, I began to notice widespread rashes forming on both arms below the line of my shirt sleeves anywhere my skin was exposed to the sun. These rashes continue to occur every spring and summer and slowly retract during the fall and winter months. This was also when I realized the excessive dryness of my hair, scalp and face. I began treatment with certain prescription soaps and shampoos, all of which were unsuccessful. These symptoms still exist today. This was also the approximate time in which the lymph node behind my left ear began swelling at random times, often 3-5 times per month, followed by a feverish feeling up to an hour or two. This swelling and fever still occurs today.\nAt age 18, I began experiencing crippling depression and fatigue for no apparent reason as I have always been a fairly happy person. These periods of suicidal thoughts, depression and fatigue come about unprovoked and make almost any normal activity impossible. These streaks will come to an abrupt end and I will wake up feeling 100% normal and happy. I was diagnosed bipolar type II by my psychiatrist at age 23 with minimal help from a variety of anti-depressants and anti-psychotics, which I chose to stop taking after 2 years due to fatigue, foggy mind and the risk of dependence.\nAt age 22, I began experiencing unprovoked chronic low back pain. An MRI showed 2 bulged discs as well as abnormal narrowing of the spine for someone of that age. After 3 epidural injections I was advised to undergo surgery by my primary physician. I was referred to a spine surgeon at OU Medical Center who upon consultation suggested surgery would not relieve much pain as his diagnosis leaned toward osteoarthritis.\nAt age 25, I lost over 60 lbs in a matter of two months after no change in diet or physical activity. I began experiencing intense reoccurring joint pain in my knees, hips, and hands, especially in the morning and late at night, along with consistent nerve pain stemming from my left buttox down into my quad. Various anti inflammatory drugs were prescribed to subdue the pain, although I soon developed stomach ulcers and rectal bleeding.\nNow, at age 26, I continue to deal with all symptoms listed above on either a consistent or reoccurring basis, and new symptoms have emerged. In the last three months, I have started experiencing constant constipation, hemmeroids, rectal bleeding and abdominal pain. The most recent symptom, which began a few months ago, is the \"butterfly\" rash on my face notoriously associated with lupus. It produces redness and elevation of the skin with a burning sensation rather than an itching sensation, lasting several days or up to a week.\n\nLupus seems to coincide the best with my research, but I would like outside opinions.","like_count":"0","tags":["Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Could I have Lupus?","resp_content":"Hi okiecobb Thank you so much for posting your story here. I hope that someone with personal experience is able to chime in soon and offer some words of encouragement and a little bit about what led them to a diagnosis.\n\nHave you spoken with your current doctor about your thoughts that the symptoms you are experiencing may be lupus? A medical professional will best able to determine if your symptoms are consistent with lupus and run the necessary tests to properly diagnose you. Here is some information about how lupus is diagnosed, tests your doctor may request, and a list of questions that you may want to discuss with your doctor: http://wb.md/2cEVKTN\n\nI hope that you will check back in soon and let us know how you are doing, and if you have gotten closer to a diagnosis!\n"},{"author":"nelliefromtexas","resp_time":"over 2 years ago","resp_title":"RE: Could I have Lupus?","resp_content":"Hello. My response may not be what you are looking for, but my question is: why are you asking a group of laypeople for an \"outside opinion\"? For your age, it looks like you have had quite a few issues. MY opinion would be to tell you to go see a good professional to help you diagnose your symptoms! It may be something very serious! Good luck!!\n"},{"author":"gregathome","resp_time":"over 2 years ago","resp_title":"RE: Could I have Lupus?","resp_content":"you may never know if its lupus. it can come and go in your blood tests.\nmy sister and I both have been diagnosed. She was chronically sick as a child and rec'd many drugs. I was a heavy drug user as a teen. My haematologist .told us Lupus our lupus is drug induced, as no blood disorders or auto immune is in either side of our family, and we live healthy, non, drinking, non smoking lives.\nDont be label conscious. Listen to your body. Read and learn its language(s).\nEat alternating paleo and/or keto, avoid dairy, trans fats, drink distilled or RO water with minerals added back in, dont vaccinate, dont smoke, reduce or dont drink alcohol, do a liver cleanse, fast for a day regularly\nand keep your body active.\nKeep a chart on your symptoms and triggers. Eliminate foods etc one at a time and record results.\nGet a before and after live blood cell test, hair analysis and blood Ph.\nDoctors cant piece together many modern maladies, as they are complex, and the metrics they used to use to determine population health and projected diseases are skewed by mass migration and mixing gene pools, myriads of vaccines and other drugs, pesticides, hormone transfers thru water supply etc, and airborne toxins.\nI was diagnosed by accident in my early 20's, confirming many symptoms Id had in my youth. I took almost two years off work to recover, and formulate an informed response. I began rebuilding my lifestyle, one change at a time as I learned about how my body, and mind work, or dont.\nIm nearly symptom free for 40 years, other than very mild, almost imperceptible attacks following long sleepless periods due to over work, or stress.\nJust had a series of several blood tests, x rays and skin biopsy, for a suspected\nskin disorder, that turned out to be nothing. All clear test results.\nBecome your own expert.\nAnd dont worry. If after you have done all you possibly can to mitigate Lupus, you are still sick, well then, you may just have to live with it.\nBut Id bet having done the above, you will have far less troubles.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/392/could-i-have-lupus"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"ANA positive with Centromere pattern","post_content":"After my ana got positive doctor performed the below.\nAll my other tests are normal Dsdna negative c3 c4 normal .\nDoctor started hcq as the treatment due to the ATT treatment is still onging.( he started off anti tb drugs for the Puo with skin test positivity)\n\nDo I have lupus or crest.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/26053/ana-positive-with-centromere-pattern"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Swollen Lymph Nodes","post_content":"I'm 53yo, with Lupus and just had my infusion last Friday. Sunday, I noticed a lump below my right ear, the size of a pea that was tender to the touch. Today, the lump grew the size of a small pebble, and still tender to the touch and it hurts quite a bit when I raise my head. I recently had been nursing a head cold and just been getting over it. I never had experienced a swollen lymph node before. Can you tell me what this is all about and why this happens? Should I monitor the growth? I don't see my specialist for another three weeks.","like_count":"1","tags":["Symptoms"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Swollen Lymph Nodes","resp_content":"I personally know a 65yo lady who's had lupus in her family....lost her mother and sister at early ages due to lupus. This lady, named Sue, has used Doterra oil and capsule therapy and her test results have gone from a count of 2000, down to 200 with taking the oils topically, but after taking certain capsules, she has now tested a ZERO count....unheard of apparently with lupus, which the medical community say CANNOT be cured. She is making history at the moment. I can put you in touch with her if you're interested :)\n"},{"author":"christopher73","resp_time":"over 2 years ago","resp_title":"RE: Swollen Lymph Nodes","resp_content":"I have Lupus also and last year was put in the hospital due to an abscess. The attending told me my lymph node was measuring 1.7cm and I needed to tell my Primary. I did he could care less due to the fact I have so much wrong. I think he's just over whelmed . But I would like to know more about it as well.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/18880/swollen-lymph-nodes"},{"post":{"author":"talena89","post_time":"over 3 years ago","post_title":"Drug-induced lupus","post_content":"Has anyone ever been diagnosed with DIL (drug-induced lupus)? A few years ago, I began having lupus like symptoms that caused a lot of dysfunction in my life for over a year, and I had a positive ANA test. I was referred to a rhumetoid specialist but he only thought it was something other than lupus and yet never gave me any other diagnosis after many many many tests, referrals, etc. I have had a healthy year now since then but feel at times as if I could be experiencing those symptoms again. I was wanting to know more about drug induced lupus and exactly what that can consist of. Does it go away after so long? Are there certain drugs to cause this induction?\n\nThank you!","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"nelliefromtexas","resp_time":"over 2 years ago","resp_title":"RE: Drug-induced lupus","resp_content":"Hello. I recently read that Lisinipril for BP has the side effect of causing Lupus in some patients. Article stated that this fact is even listed in the brochure that comes with your meds. (I was on it for some time years ago, but of course have no idea if it influenced my diagnosis of Lupus.)\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/4259/drug-induced-lupus"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"How Do You Manage Your Lupus?","post_content":"Whether you’re an adult dealing with your own diagnosis or the parent of a child with lupus, you have challenges to face every day. Throughout Lupus Awareness Month we’ve talked about how lupus is diagnosed, the symptoms to look for, what questions you should ask your doctor, and what treatments may help you manage your symptoms. Today we’re taking a look at tips to help you live well with and manage those everyday challenges that come with having lupus.\n\nSo, take a look at these articles that cover everything from skin care tips and diet to the emotional impact of living with lupus to lupus and pregnancy: http://wb.md/2qa0c1A","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/8445/how-do-you-manage-your-lupus"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"What You Should Know About Lupus Treatments","post_content":"Although there’s no cure for lupus, there are treatments and lifestyle changes that can help you manage your symptoms. Treatments can help ease your symptoms, bring down inflammation, prevent and relieve flares, and prevent organ damage and other health problems.\n\nWhat types of treatment available to you depends on your symptoms and how severe they are. Here’s a quick overview of treatments as well as lifestyle changes that could help: http://wb.md/2qaVvXG","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/8071/what-you-should-know-about-lupus-treatments"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"May Is Lupus Awareness Month. Here’s What You Should Know","post_content":"Lupus is a lifelong disorder of the immune system, and it affects women 10 times more often than men. While the symptoms of lupus may be limited to the skin, more often lupus also causes internal problems and in severe cases can damage the heart, kidneys, and other vital organs.\n\nWhen lupus begins it can look a lot like rheumatoid arthritis, which causes joint pain and swelling, or fibromyalgia, which causes fatigue and pain. Find out what sets it apart, what puts you at risk, and how you can reduce lupus flare-ups if you’ve been diagnosed, here: http://wb.md/2oFtFUy\n\nAre you living with lupus? What were the symptoms that lead to your diagnosis?","like_count":"0","tags":["Exercise","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/7484/may-is-lupus-awareness-month-here-s-what-you-should-know"},{"post":{"author":"alister0110","post_time":"over 2 years ago","post_title":"Alternative Meds?","post_content":"I have read many articles suggesting highly concentrated cannabis oil can be effective and alternative meds for people suffering with lupus. Pain and inflammation are two commonly recognized therapeutic properties of cannabis, so its ability to treat lupus effectively is not surprising. Like this article about chronic inflammation from http://www.ilovegrowingmarijuana.com/chronic-inflammation/ . Let me also hear your thoughts or personal experience when it come with medical marijuana. Thanks","like_count":"1","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/7394/alternative-meds"},{"post":{"author":"gardenbev","post_time":"over 2 years ago","post_title":"Benlysta for lupus","post_content":"Just had my 2nd Benlysta treatment, took me 2 years to agree to try this drug. So far everything is going well. Just looking for some first hand experiences with this drug. Is it going well for you or not? I live in a small community and my rheumatologist has only 1 other patient on this drug that I know about.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/7105/benlysta-for-lupus"},{"post":{"author":"elizabeth5154","post_time":"over 2 years ago","post_title":"24 years old and need some help... could this be lupus","post_content":"First of all, I am a 24 year old female and a nurse. Past medical history is: diagnosis of celiac disease as a child, factor mthfr heterozygous, and inappropriate sinus tachycardia. My sx began about 7 years ago when I developed a DVT in my calf. During that year, I experienced many Upper resp infections, sinus infections and strep. I developed a rash on my face and my dermatologist mentioned that it looked like a lupus rash to her. I went off to college and had ups and downs, but remained fairly well. After graduating, I have been sick, lethargic and rundown with a fever for nearly 4 months. I am a RN in an ICU. I have been on antibiotic after antibiotic, and the only relief I have is when I am on prednisone. I am small for my age 5'3.\" And 100 lbs, so long term steroid usage is probably not a good idea. I have had a lot of bone breaks, but not due to low bone density. I had labs done last week due to fever of unknown origin and vertigo and a decline in cognitive function and overall feeling terrible. My CBC and Chem were fine but ANA was 1:340 and homogenous with ANA ab positive. DS-DNA was negative. Can anybody shed some light on what could be going on? I'm being referred to a rheumatologist, but it's taking some time and I'm not super patient! Thanks!!!","like_count":"0","tags":["Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/6928/24-years-old-and-need-some-help-could-this-be-lupus"},{"post":{"author":"Anomaly63705","post_time":"over 3 years ago","post_title":"Long Term Cellcept Use","post_content":"I have been taking large doses of Cellcept for almost 10 years now - 3,000 mg/day. Has anyone else on large doses experienced any adverse side effects? Just curious because of the long term toxicity issues with doses exceeding 2,000 mg/day.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/5505/long-term-cellcept-use"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"How do I know if this is a lupus rash? Is there somewhere to post a picture?","post_content":"I was hoping to find somewhere to post a picture of a rash I have in my face","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/4474/how-do-i-know-if-this-is-a-lupus-rash-is-there-somewhere-to-post-a-picture"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"i wont to know about exercise to do","post_content":"Tell me more a good exercises to help for people with lupus","like_count":"0","tags":["Exercise"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/4229/i-wont-to-know-about-exercise-to-do"},{"post":{"author":"swimfan01","post_time":"over 3 years ago","post_title":"My mother and Lupus?","post_content":"Hello everyone.\n\nAt my apartment, I like to keep the temperatures cool and I enjoy cozying up with my PJS and a blanket with friends and family. However, whenever my mother comes over, even though I keep my AC on 72, my mother's fingertips turn almost completely blue. I thought it was oxygen deprivation but it seems to be only when she's cold. My friend told me that it could be Lupus. Is that something that typically happens? It's very strange and I'm concerned.\n\nPlease help. I don't want anything bad to happen to my mom.","like_count":"1","tags":["Symptoms"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: My mother and Lupus?","resp_content":"Hi swimfan01 Thank you for your post! The best thing that you can do to help determine what is causing your mom's fingertips to turn blue is to have her see her doctor for an exam. Her doctor will hopefully be able to determine what is causing these symptoms and offer next steps to treat it.\n\nIn the meantime, you may find it helpful to look through this overview on lupus to see if any of the symptoms listed there seem to be things that you mother is experiencing: http://wb.md/2c8kUMn .\n\nAs the slideshow says, \"some people with lupus do develop something called Raynaud's phenomenon, where their fingers and toes become painful, numb, and tingly in response to cold temperatures or emotional stress.\" However, people can also have Raynaud's without having lupus or any serious health conditions. Here is some more information on Raynaud's you may wish to look through: http://wb.md/2clcHk8\n\nPlease check back in and let us know how she's doing!\n2\n"},{"author":"rjatl55","resp_time":"over 3 years ago","resp_title":"RE: My mother and Lupus?","resp_content":"It could also be a condition called Raynauds... an intolerance to cold or very cool temps\n"},{"author":"indianddo1992","resp_time":"over 3 years ago","resp_title":"RE: My mother and Lupus?","resp_content":"Hi, it could renaus. Is when the hands turn blue and yellow. just make an appointment with the rheumatologist. After a lot of test for her you will find the answer.\n"},{"author":"debiblueeyes","resp_time":"over 3 years ago","resp_title":"RE: My mother and Lupus?","resp_content":"She probably has Raynard's. The triple play as I call it are lupus shogren's and raynard's.I have lupus and my fingers are very painful so I will suggest you look them up. It will help explain. I get the blue digits too. I carry several pairs of gloves with me everywhere. In the movie theater out for whatever. I have quite an extensive collection. I guess you could call me the Glove lady!\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/373/my-mother-and-lupus"},{"post":{"author":"frekathy","post_time":"over 3 years ago","post_title":"Lupus","post_content":"My mother had lupus and so did I. It did end my working life early because it forced me out on permanent disability, gave me a hard time for 10 years or so; then went into remission. However, along the way, I also picked up epilepsy and 2 diseases: Sjogrens and Raynauds. For the rest of my life I will be on seizure meds. Within the last year, S & R (I call them my evil twins) have come back and likely will haunt me for the rest of my life. Sjogrens makes every orifice dry, as in dry mouth, dry eye, very dry skin etc. I drink a LOT of water every day to help offset it. Raynaud's makes me quite sensitive to cold - even in the middle of summer, going by the freezer section in the grocery store is uncomfortable. In the winter, I am known for and teased about how many layers I wear.\n\nJust recently, my internist found a spot on one lung. Had all kinds of tests and finally got referred to a pulmonologist. He zeroed in on S & R, telling me either one very possibly could have caused the spot.\n\nLife wasn't too bad when my lupus was active, but I sure DON'T LIKE the side effects it left me with. Overall, I try to avoid taking any long-term meds. IMO, taking meds for the long-term messes with Mother Nature. Obviously, there are times when something in your body goes wonky and you need to take a med for a while. For me, epilepsy has been an exception. I have tried not taking seizure meds and been convinced that I need them.\n\nI'd love to hear from others who have lived with S & R for a long time and felt the evil effect.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/3143/lupus"},{"post":{"author":"georgeskoda","post_time":"over 3 years ago","post_title":"Lupus diagnosis","post_content":"Hi\nI live in Kentucky and I need information about a doctor who can effectively diagnose lupus or tell me what is going on with me.\nIn a nutshell, I have tried two primary physicians who were not able to give me a correct explanation about symptoms I am experiencing. the only answer was they don't know.\nSo far I have experienced UTI like symptoms but all the test came up negative. I had swallowed lymph nodes in my groin that comes and goes. Since 8 months i am experiencing allergies to some food ,I can no longer drink coffee, no gluten or any type or cereal otherwise will be inching within a couple of minutes. I also had some episodes of total fatigue in a way that I cannot even move my body, I had to rest for a while before being able to do anything. But what really scares me is the white particle or worm-like strings in my urine(maybe white cells). doctors still cannot figure this out. all urine test came up negative. In addition, I am having poor blood circulation symptoms. I cannot even kneel down and pray without feeling cramp and tingling like when you sit on your feet for a while. it happens also when I am in the bed, I cannot fold my arms without feeling the same sensation. I have to sleep with my arm and leg flat. all this started 8 months ago when I experienced a huge series of symptoms: pain in the back, itching and tingling, metal taste or bidder tongue, fatigue and so on, pain in my chest like something stinging my heart. I don't know what to do and really don't know who else to talk to.\nI remember that I use to have the lymph node in my groin since I was a kid, but I thought that was important. I also had some episodes of very light fever. I thought that was normal since it did not last more than one day.\nif you know anyone who can help, please let me know. I can feel that my body is going through a lot of changes but no doctor is able to help. I see that many people with lupus experience the same symptom, that is why I really want to check with another doctor.\nP.S : all the test I took are negative: urine test, blood test, a scanner of the lower body, ultrasound and CT scan for kidney and bladder, camera in the bladder, urine culture for bacteria, test for prostate and many other that I don't remember.","like_count":"0","tags":["Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Lupus diagnosis","resp_content":"I'm so sorry that you are going through this! You might start with seeing a rheumatologist. Unfortunately, we can't talk about specific doctors on here. But WebMD does have a doctor finder that could help you find someone in your area who could help you. http://doctor.webmd.com/?sponsor=core\n\nAlso, here's some info from the Lupus Foundation about what doctors treat lupus http://www.lupus.org/answers/entry/what-kinds-of-doctors-treat-lupus\n\nI hope you are able to find answers soon!\n1\n"},{"author":"indianddo1992","resp_time":"over 3 years ago","resp_title":"RE: Lupus diagnosis","resp_content":"Hi, I'm from Connecticut and I have lupus, ranous and Fibromylgia too. You will experience a lot of symptoms. Pain, tiredness, tingle fingers and toes. Find your self a good Rumatology, it will do a lot of blood test including the NA witch it will show all the cells and what is high or low in your body. The immune system sometimes do drastic changes and it needs to be check. Lupus and fibromylgia has the same symptoms. Make sure the rumatologist do more test to find out. Good luck\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/1695/lupus-diagnosis"},{"post":{"author":"indianddo1992","post_time":"over 3 years ago","post_title":"lupus hedache","post_content":"Doctor doesn't believe me when I told them that I have lupus hedache. Hi, I was diagnose with lupus after my heart attack in 2012. I was very active at home, with my kids and I think too active in my job. Ocasionally I had tension hedache. After my heart attack, I had a lot of trouble with my right leg, couldn't walk properly. I can fill the right side of my face and my lip was sideways. It took me two years of therapy and now I walk, exercise. work and do everything in my house. Doctor rule out the stroke cause my body was damage in two different sides. Then, the reumatology did told me that I'm also have Fibromylgia. Believe me i'm in pain 24-7. Now I'm having a lot of lupus hedache. Is so different than the other hedache. Usually start on the back of my head and goes up to the front, filling my hole head. It fill like a big buble expanding inside my head with a lot of presure. I can't lift my head, or down for too long. Is not like some hammer hitting my head, or stress hedache but is painful. Trying to focus or concentrate is bad and even talking is awful cause the presure is there all the time. I take over the counter tylenol, cause for my heart, I'm not aloud to take anything else. I lay down until the presure inside my head goes away. My vision is bad. they change my glases every year but this time, the change was very bad. it wasn't even a year, it was six months. The insurance did not paid and I have too. The glases where expensive. Even though that I have lupus and Fibromylgia the only thing that put me in bed is the lupus hedache, other wise I do everything else fine.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/2968/lupus-hedache"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Been having symptoms. What kind of doctor do I see?","post_content":"I've been having some strange symptoms for a couple of months now and when I looked them up all signs seem to point to lupus. It has me anxious to find out if this is actually what I have or if something else is going on. My main symptoms are pretty intense fatigue especially when I change my routine in any way as well as joint pain mainly in my arms and fingers but sometimes also in my knees. I also occasionally get headaches and have noticed hair loss, although not to the extent that I have entire bald patches, more like overall thinning. I'm wondering what type of doctor I should make an appointment to see. Just my general physician? Or is there a specialist I should be trying to get in to see?","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Been having symptoms. What kind of doctor do I see?","resp_content":"I think your best first step is to see your regular doctor. Because lupus symptoms are so similar to things like RA and fibro, your doctor can help determine what testing is necessary and refer you to a rheumatologist or other specialist if necessary. Please keep us updated!\n"},{"author":"nancyj95","resp_time":"over 3 years ago","resp_title":"RE: Been having symptoms. What kind of doctor do I see?","resp_content":"You should be seeing a rheumatologist who should be able to diagnose f it is Lubus or fibromyalgia.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/930/been-having-symptoms-what-kind-of-doctor-do-i-see"},{"post":{"author":"michaelneijar","post_time":"over 3 years ago","post_title":"HELP","post_content":"Hello WebMD Community. I'm posting this for my mom because she has had a skin condition for the last 2 years and no matter how many doctors she goes to we cant find out what it is. She has been misdiagnosed with psoriasis and even exema but neither one of those treatments have worked. We have wasted hundred on different types of creams and even visiting different doctors but nothing yet. I'm hoping someone has been thru this before and has found out what it is. To give a little background story we used to have a dog that would pee all over the house and even on her bed. This skin condition developed around that time. We got rid of the dog but it has been getting progressively worse. It might be possible this has nothing to do at all with the dog but I wanted to add that in there. She tells me she feels like something is crawling under her skin. At first it was on her arms and back and she cant help but to scratch because the feeling of itchiness leaves her in agony. She is scared because now she has that same feeling on her face. We need to find out what this is before its too late. Please people I need your help. Here is a imgur link to\n\nimages http://imgur.com/gallery/kiatc\n\nso that you can see what it is. I'm banking on WEBMD to shed some new light on what this can be\n\nhttp://imgur.com/gallery/kiatc\nhttp://imgur.com/gallery/kiatc\nhttp://imgur.com/gallery/kiatc","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/1697/help"},{"post":{"author":"lupieness","post_time":"over 3 years ago","post_title":"Lupus Fatigue Tracking","post_content":"Hi All,\n\nI came across this article on Facebook: http://www.lupuscorner.com/fatigue-severity-scale-fss-and-lupus/\nthat talks about using a scale to monitor fatigue for lupus. Has anyone used this number when talking to their doctor?","like_count":"0","tags":["Living & Managing","Symptoms","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/1476/lupus-fatigue-tracking"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"What You Should Know About Lupus and Your Diet","post_content":"While there are no foods that cause lupus or that can cure it, good nutrition is an important part of treating the disease. Here's what you should know about lupus, diet, and nutrition: http://wb.md/2eM6DEG\n\nWhat have you learned about lupus and your diet?\n\nSign in or sign up to join the conversation.","like_count":"1","tags":["Diet"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/1370/what-you-should-know-about-lupus-and-your-diet"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"How Lupus Affects Your Body -- And What You Can Do","post_content":"Lupus can affect just about any part of your body. Here's what you can do to help avoid the effects of lupus on your heart, skin, kidneys, eyes, and other areas: http://wb.md/2ee5Zga\n\nHow do you work to prevent and/or ease lupus-related problems?\n\nSign in (or sign up to become a WebMD member -- see link in the upper right corner of this page) and share your thoughts.","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/870/how-lupus-affects-your-body----and-what-you-can-do"},{"post":{"author":"jlanz","post_time":"over 3 years ago","post_title":"Lupus Can Cause All of My Problems, Did It?","post_content":"O-kay, I have learned that it possible for Lupus to cause All of my problems. The Question Remains, Did it? AND does it really matter. My plan is to take care of each illness seperately and not be concerned with whether or it was caused by lupus since there is no cure for most of what ails me. I am 64 and I would to maintain some quality in life w/o being overly concerned.","like_count":"0","tags":["Risk Factors","Living & Managing"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Lupus Can Cause All of My Problems, Did It?","resp_content":"Hi jlanz I am glad that you are taking a positive approach to controlling your illnesses. Have you worked with your doctor or rheumatologist to develop a plan to treat and manage your symptoms? Hope you are doing well!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/578/lupus-can-cause-all-of-my-problems-did-it"},{"post":{"author":"hazel34","post_time":"over 3 years ago","post_title":"Question about triggers","post_content":"I'm new here, and relatively new to Lupus. Just wondering how you all deal with your triggers. A big one for me is sunlight, which I also understand is very common. I'm a pretty active person and I love the outdoors so this has been hard for me. I hate limiting my time outside, but even with taking measures to cover up, wear sunscreen and all that, I still feel run down faster than ever, my skin flares up, and I start to ache. Anyone have anything that could help me still enjoy summer days? At this point I'm actually looking forward to overcast afternoons because I feel a tad better...\n\nIt was suggested to me that I track my triggers and how I'm feeling in a daily journal. Anyone do this? Does it actually help?","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Question about triggers","resp_content":"Hi hazel34 Staying out of the sun is certainly tough, especially on those beautiful summer days. As this article says, about 2/3 of those with lupus are UV-light sensitive, so you are certainly not alone: http://wb.md/2cWFRJH\n\nLuckily there are some ways to protect yourself from the sun that are listed in the article above. They include things like avoiding the times of day when UV rays are at their peak (between 10am and 4pm), slathering on the sunscreen, covering up, and checking your medications to see if they could be magnifying the sun's affects on your body.\n\nYou may also be interested in this article that goes over some basic skin care tips for lupus: http://wb.md/2ck4NXl\n\nI think that tracking your triggers would be a good idea for both yourself and for your doctor. It may be good to speak with your doctor about this to see what would be most helpful for you both to track.\n\nI hope you'll check back in and let us know how you're doing!\n"},{"author":"hazel34","resp_time":"over 3 years ago","resp_title":"Thanks! I'll definitely look through those articles to see if there is anything I should be doing differently :)","resp_content":"1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/365/question-about-triggers"},{"post":{"author":"camillel1","post_time":"over 3 years ago","post_title":"Lupus and hypothyroid","post_content":"I was diagnosed with lupus several years ago, this summer I had a yearly blood test and found out that I am hypothyroid on top of it. Now that I am on medication for my thyroid, I was hoping that I would lose some weight. But, no, still gaining and more than ever. Ugh! The joint pain has also increased . Is there a correlation between the lupus and the hypothyroid?","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Lupus and hypothyroid","resp_content":"Hi camillel1 Thanks for your post! Have you talked with your doctor about the weight gain and increased pain that you are experiencing since starting on medication? Your doctor really is the best place to start as a number of things could explain your symptoms.\n\nThis article has some information about starting out on hypothyroid medications that you may be interested in reading: http://wb.md/2cWUxqz It does say that \"if you take too little medicine, you may have symptoms of hypothyroidism, such as constipation, feeling sluggish and gaining weight.\" It may be worth asking your doctor if your dosage is the correct one for you.\n\nAlso, here is some information from the Lupus Foundation of America that talks a little bit about the connection between Lupus and thyroid disorders: http://www.lupus.org/answers/entry/how-are-thyroid-disorders-related-to-lupus This may also be a good thing to speak with your doctor about as he/she may have some ideas on how to manage the symptoms of both disorders.\n\nI hope you'll check back in here soon!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/446/lupus-and-hypothyroid"},{"post":{"author":"nikgott","post_time":"over 3 years ago","post_title":"ANA positive, some symptoms?","post_content":"Hello all- first time to any forum ever. I'm becoming increasingly nervous of some symptoms I've had so I thought I'd ask experts- people who have the illness themselves. I'm a healthy 27 year old female. Never had any major medical issues. In the past few months, I've had lymph nodes behind my ear and in the back of my neck swell. No illness, it was by accident I found them. I went to my PCP and they put me on antibiotics. I had no decrease but rather an increase. She ran bloodwork and everything but my ANA was elevated at 1:160. I was referred to a general surgeon to biopsy the lymph nodes and rheumatology. At the same appointment, I showed her mouth sores that I have been getting very frequently for about 1 year. They appear as red sores on my tongue. My dentist said it is not geographic tongue and to see a medical doctor.\n\nI am concerned as my first thought was lymphoma. Upon reading I have shown some early signs of lupus. Has anyone ever had anything like this before?\n\nThank you!","like_count":"1","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: ANA positive, some symptoms?","resp_content":"Hi nikgott First of all welcome to the message board. There is a great community of members here, and I hope that soon someone will be able to reach out with some personal experience and guidance to help you in your next steps.\n\nHave you scheduled appointments for a biopsy and with a rheumatologist? I think that you have taken the best first steps you can take by reaching out to your GP and now other medical professionals for help in getting a diagnosis.\n\nMouth sores and swollen lymph glands are common possible symptoms of lupus, but they are also symptoms common in many other medical conditions ( http://wb.md/2cX1UQS) .\n\nHere is some more information on lupus symptoms that you may find helpful: http://wb.md/2cDbitO I would make sure that you are documenting the symptoms you are experiencing so that you can share them with your doctor at your next appointment.\n\nThis guide to lupus also has some great information that may be helpful to look through, including questions you should ask your doctor and exactly how lupus is diagnosed: http://wb.md/2cl9QaT\n\nI also found this information on positive ANA tests that you may find helpful: http://wb.md/2cX3TVu It explains what may cause a positive ANA test, what can affect the test, and things that you should take into consideration. It does say that almost all people with SLE (systemic lupus erythematosus) have a positive ANA test, but that most people with a positive ANA test do not have SLE. That is why it is so important that you continue to work with your doctors to help identify the cause of your symptoms.\n\nI hope that some of this information helps you better prepare for your next appointment with your doctor so that you can go in feeling confident of the questions you want to have answered and so that you can best work with your doctor to find out what is causing your symptoms, lupus or otherwise.\n\nPlease check back in and let us know how you are doing!\n"},{"author":"nikgott","resp_time":"over 3 years ago","resp_title":"Thank you very much for the reply! I meet the general surgeon tomorrow and from there they said she will schedule as she just happened to be coming to the satellite office near me coincidently. My rheumatology appointment is another month.","resp_content":"\nI do feel fatigue but I usually just associate this with working a hectic job and being a mom\nOf 2 kids. I have been needing naps in the day lately, which isn't usual for me. I also sleep at least 9 hours at night. I have had joint pain and I know this sounds weird, but in my toes for years. Besides this, my joints are pretty healthy it seems.\n\nMy mother has Sjögren's Syndrome it may be possible my ANA was elevated just from genetics.\n\nHopefully they will find out soon!\n1\nReply\nWebMD Addie\nover 3 years ago\nI'm glad that you have an appointment so soon and I hope that you will have all of your questions answered. Weirdly, I too have joint pain in my toes on occasion, but it's generally fleeting and I've never really thought to look more into it (I do have tendinitis in the arches of my feet so I've always associated it with that but don't know for sure). I'd love to know if you doc has anything to say about it! Good luck tomorrow :)\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/380/ana-positive-some-symptoms"},{"post":{"author":"toadblossom","post_time":"over 3 years ago","post_title":"Lupus anticoagulant","post_content":"Looking for information... have had lupus/sjogrens/raynauds for years.. have had two heart attacks and a recent stroke. So they have tested and confirmed that I have lupus anticoagulant... I'm being referred to a hematologist, and I'm guessing I'll be put on coumadin. Wondering if this dx changes treatment other than coumadin or do things stay the same...","like_count":"0","tags":[]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Lupus anticoagulant","resp_content":"Hi toadblossom I hope someone with personal experience is able to chime in soon. I did find this information that does say that when diagnosed, antiphospholipid antibody syndrome is usually treated with anticoagulants: http://wb.md/2cV1zLM . I hope you get some more concrete answers about your individual treatment plan when you meet with your hematologist. Please check back in and let us know how you are doing!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/372/lupus-anticoagulant"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"How do you fight fatigue?","post_content":"What are some tips that have helped you deal with the overwhelming fatigue that comes with having lupus? What about the brain fog? Anyone here struggle with memory problems and confusion?","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/181/how-do-you-fight-fatigue"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Welcome to the Lupus Message Board","post_content":"We are so excited to be able to share our new boards with you!\n\nJust a few housekeeping things to go over before you get started:\n\n- Bookmark this page so you can easily find us any time\n\n- Make sure you check back frequently as conversations are always being added and expanded\n\n- Head on over to your Message Board profile (just click on your account avatar in the top right corner of the page) to update your personal story and add a photo\n\n- Don’t see what you’re looking for? Look through the tags at the top of the page to customize your view to only see posts that interest you\n\n- When creating a post, choose a tag to add that most clicks with you. (Using tags is encouraged but not required.)\n\n- Like what you see? Or need help? Send us an email at CommunityManagement@webmd.net","like_count":"0","tags":["Exercise","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/lupus/101/welcome-to-the-lupus-message-board"}]