[{"post":{"author":"Anonymous","post_time":"17 days ago","post_title":"Has anyone heard of Timely Medical Alternatives?","post_content":"Looking for surgery in the upcoming year but our public options are limited at the moment. Has anyone tried a service like this for hip surgery? https://www.timelymedical.ca/surgical-procedures/orthopedic/hip-surgery/","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/113268/has-anyone-heard-of-timely-medical-alternatives"},{"post":{"author":"rimsky","post_time":"over 1 year ago","post_title":"Diagnosed with Osteoporosis at 40, now 46. Scared of treatment.","post_content":"Hi. I was diagnosed with Osteoporosis (DEXA) at 40. I'm now 46 and did not follow any treatment. Always scared of side-effects of medications and stuff I read on the Internet.\n\nResults were:\nRegion, DMO (g/cm2), Adult-Young %, Adult-Young Z-Score\nL1-L4, 0.817, 67, -3.4\nLeft Femur, 0.686, 62, -2.9\nLeft Forearm, 0.868, 87, -1.3\n\nThat was 6 years ago. I have not repeated the DEXA exam.\n\nDuring the last 6 years, I started to take Vitamin D supplements, since blood tests showed that I had vitamin D deficiency. Also, sporadically I took Calcium-Mg-D supplements.\n\nDid not take any Osteoporosis medications (Fosamax, etc.) because I'm scared of side-effects, specially after reading of possible issues with heart valves and stuff like that.\n\nI never had a fracture in my life. I'm not very active.\n\nI found out that I had osteoporosis by coincidence, because I went to the doctor due to pain in my legs. It seems that I suffer from something called \"Restless Leg Syndrome\". Blood tests showed slightly elevated levels of Calcium. As a result, the doctor ordered the DEXA. The DEXA was repeated at a different hospital a few months after the first one, and it confirmed that the results were correct.\n\nI would love receiving feedback about my situation, DEXA results at my age, how bad is my situation, how much can I achieve via supplements, diet and exercise; and also feedback about medications. Which medication is the latest & greatest with least side-effects, ...\n\nThanks a lot in advance.","like_count":"1","tags":["Exercise","Bone Density","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: Diagnosed with Osteoporosis at 40, now 46. Scared of treatment.","resp_content":"Sigh.....where to start...Are you postmenopausal or were you postmenopausal when you had your first DXA? A diagnosis is not given to premenopausal women. That said..with your -3.6 and -2.9 Z-scores, you should've gone on a medication immediately. You will never regain what bone is lost unless you take Forteo, a medication that is made from the parathyroid hormone and is the only one that grows new bone.\n\nPlease, please don't take as gospel all the stuff you read on the internet. The medications are evidence base results (as required by the FDA) and have been proven to strengthen bone. You will always read horror stories on the internet. People love to post about their negative experiences. When scores, particularly Z-scores, are as low as yours, your T-score (postmenopausal scores) will be lower.\n\nI suggest that you look at the ISCD website (www.iscd.org) for a facility near you that is accredited for another test. DXA testing does not, at this point, have to be accredited and anyone who does a day's training with the sales rep can perform a test. This is very risky and means you cannot bank on the results you get. NC has more accredited centers than any other state. OH is next. Some states don't have any.\n\nI would recommend that you immediately schedule a test. Then go on a medication. Forget any possible side effects. Everything you eat or touch has side effects. There are no guarantees. Osteo drugs strengthen bone. That's what you need. I can swear to you that your risk of having an osteoporotic fracture is much much greater than the chance you'll have of some dreaded side effect of the medication. You have to weight the risks vs the benefits.\n\nGo to the National Osteoporosis Foundation (www.nof.org) for a lot of verifiable information. They even give a comparison of the drugs for osteoporosis. There's a section on body movements, calcium, Vit D and an excellent Q&A section.\n\nYou need calcium. The body doesn't make it. Your body now has all the bone it's ever going to have. Preserve it. A fracture can change your life drastically. Calcium is a mineral. There's no best calcium. Get a supplement with the USP symbol on the label. You need 1200 mg a day. The body will only absorb 600 mg. Anything over that is peed out. Take 600 mg at lunch and another at supper. Read the label to see what a dose is. For some calciums (citrates) it's 2 pills, for others (carbonate) it's 1 pill. Get one with Vit D added. That sends the calcium to the bones.\n\nExercise - walk at least 1/2 hour 3 days a week. Or you can spend 4 hours a day on your feet. This is weight bearing. This stimulates the bone cells to grow. You want this. No toe touching, crunches, anything bending the waist or twisting side to side. Don't lift anything more than 10 lbs.\n\nIf you haven't fractured a bone, that is very very good. That's what you want. Not necessarily a higher score. The goal is to keep what you have strong and minimize your chances of having a fracture.\n\nDon't be scared and quit reading unproven website stories. Good luck to you.\n"},{"author":"rimsky","resp_time":"over 1 year ago","resp_title":"Bonebabe, thanks for your reply.","resp_content":"\nI must clarify they I’m male. The results are from two Dexa exams taken at different hospitals, both confirming almost identical results. About 8+ years have passed since. I have not taken any medicines, only Vitamin D.\n\nNo fractures yet.\n\nI will read about Forteo. 8 years ago, doctors prescribed Fosamax, which I did not take :(\n\nIs Forteo for male patients too?\n1\nReply\nbonebabe\nover 1 year ago\nOK - so knowing you're male changes things - not much, but changes.\n\nFirst - an osteoporosis diagnosis is not given to a male under age 50. That said, your test scores still show tremendously porous bones.\n\nSex hormones play a HUGE part in bone growth and strength. To have such a low score at such a young age (after you've met your peak bone mass) is a red flag for something going on. You need to find out what caused your bones to be so fragile. That's where an endocrinologist comes in.\n\nA case in point. My brother was 41 when I did his bone density because we were tracking how men fared when compared to a Sahara heel ultrasound screening to a gold standard DXA. We wanted this info before we participated in health fairs with the Sahara machine. My brother's score was -2.9. That was a shocker because he lived in Manhatten and walked everywhere, ate well and had no chronic illnesses.\n\nI told him to go back to his doctor and get an RX for Actonel. He went back, the doctor said no, to wait 2 years and if the scores were still low, go to an expert. I explained that he'd started with the expert and to get the RX. He did, and his bones strengthened so that now he can scuba dive and volunteer to swim with the sharks at a local aquarium.\n\nBut he did have further testing. Turns out that because he'd been a partyer in high school and college (during bone forming years) his testosterone was suppressed, blocking full bone mass attainment.\n\nSo...it may be that you never reached your full bone mass or it could be that something is going on that is leaching calcium from your bones. You need to know this.\n\nTake a medication. The oral ones do have GI side effects on some people. There's also Reclast which is an annual infusion that is covered by your major medical (not drug) insurance and is hassle free. Forteo is for the frailest of the frail. Talk to your doctors about your situation.\n\nThe bottom line is - you need a medication. Nothing you can do naturally is going to give you what you need.\n\nWhen you have your next DXA, go to one of the places you went to initially and stick with it for future tests. No matter what you're told, they can't reliably compare tests results from one place to another. Also Z and T-scores themselves don't indicate increase or decrease. That's a whole 'nuther posting.\n"},{"author":"ssr30","resp_time":"1 month ago","resp_title":"RE: Diagnosed with Osteoporosis at 40, now 46. Scared of treatment.","resp_content":"I’m curious if you ever started a medication. I’m a male with OP, tried Prolia and had to stop due to side effects. I am considering what to do next.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/75236/diagnosed-with-osteoporosis-at-40-now-46-scared-of-treatment"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"type of professional best suited to review bone density scans","post_content":"I am 83 yo, and have had bone density scans for the past 8 years, I am confused by some of the information and would like to know what type of doctor (MD or PhD) is most qualified to take all of my history into account in order to recommend a course of treatment.\nThank you.","like_count":"0","tags":["Treatment"]},"responses":[{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: type of professional best suited to review bone density scans","resp_content":"You are so very wise to be seeking such a person. Many just write a RX and blow you off. The osteoporosis center where I worked (for 21 years until last year) was overseen by a rheumatologist who was clinically certified to read, interpret and treat osteoporosis testing and patients. Not all do.\n\nThe best thing I can tell you is to go the the ISCD (International Society for Clinical Densitometry) www.iscd.org. That is the gold mine of all things relating to the disease, management and treatment.\n\nClick on the top where it says \"Certification\" then click on \"Registry.\" You can put in a doctor's name if you have a particular one you'd like to know is certified, or you can just put in your location to find a doctor near you who can do what you seek. What you'll be looking for is CCD, Certified Clinical Densitometrist. Those are the doctors who know how to diagnose and treat osteoporosis. They are usually rheumatologists and endocrinologists.\n\nI hope this helps.\n"},{"author":"catarinalyn","resp_time":"1 month ago","resp_title":"RE: type of professional best suited to review bone density scans","resp_content":"Hi. It's good to ask questions. I went to a rheumotologist, then my regular internist. They both explained my scan clearly and recommended same course of treatment. I had lots of questions about the medication fosomax. They said the benefits of it outweighed the risk of side effects. I took my first one this week. I have severe osteoporosis in my spine. Good luck to you.\n"},{"author":"catarinalyn","resp_time":"1 month ago","resp_title":"RE: type of professional best suited to review bone density scans","resp_content":"Hi. It's good to ask questions. I went to a rheumotologist, then my regular internist. They both explained my scan clearly and recommended same course of treatment. I had lots of questions about the medication fosomax. They said the benefits of it outweighed the risk of side effects. I took my first one this week. I have severe osteoporosis in my spine. Good luck to you.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/38664/type-of-professional-best-suited-to-review-bone-density-scans"},{"post":{"author":"Anonymous","post_time":"4 months ago","post_title":"Shocked and scared","post_content":"Hi\nI was hoping for some advice I am a 66y old female I have always been active but had treatment for cancer and thyroid problems.\nI have have a score of -3.9 on my spine but -1.5 on my neck and hips.\nI have already lost an inch in hight and have a fractured back.\nI just thought it was a muscle problem. I am in agony and feel my life has ended. I am trying to come to terms with this and am hopeful that I can live a full life.\nCan anyone give me advice on the drugs and vitamins to help and the ones best avoided.\nI only found out 2 days ago so my head is spinning I had no idea I had osteoporosis even when they sent me for the scan I didn’t know why.","like_count":"1","tags":["Bone Density"]},"responses":[{"author":"Anonymous","resp_time":"4 months ago","resp_title":"RE: Shocked and scared","resp_content":"Hi there!\n\nDo you have room in that boat for me? I'm 61 and was diagnosed at 58 with advanced osteoporosis in my lumbar spine and my left hip. Left hip diagnosed at -7.6 \"major osteoporotic\".\n\nLast week I had pain in my lumbar spine and had an x-ray that shows I also have a degenerative disc and arthrosis. I just had a second bone density scan done last Thursday but no results yet. I'm scared to death to know.\n\nI don't know where you are but my first scan was done on the west coast. Now I'm on the east coast. Both areas have good medical facilities but it seems like pulling teeth to get a doctor to speak with me. My PCP is useless other than ordering tests.\n\nI'm too young for this!\n"},{"author":"beans57","resp_time":"3 months ago","resp_title":"RE: Shocked and scared","resp_content":"I had 3 fractured vertebrae and had a procedure done called Kyroplasty it worked no more pain\n"},{"author":"catarinalyn","resp_time":"1 month ago","resp_title":"RE: Shocked and scared","resp_content":"Hi shocked and scared. Sorry to hear that. I too was just diagnosed with severe osteoporosis in spine. I'm an inch shorter than I was. I'm 60 and I'm still in shock with my diagnosis. Got a second opinion. I feel like I have no choice but to take meds and vitamin D. I started on fosamax 2 days ago. So far so good but hate all the possible side effects but feel like I have no options. I'm feeling sorry for myself but I hope to live another 20 years without fractures or pain. I hope I don't get any of the crazy side effects either. It's supposed to strengthen bones. I have back pain but Motrin interacts with fosamax so I can't take it. I feel kind of helpless.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/103266/shocked-and-scared"},{"post":{"author":"ngovantai","post_time":"1 month ago","post_title":"Osteoporosis","post_content":"Osteoporosis, also known as osteoporosis or osteoporosis, is a condition where the bones are constantly thinning and the density of the bones in the bone is becoming more and more thin, which makes the bones more brittle, more vulnerable and more likely to break. minor injury.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/110039/osteoporosis"},{"post":{"author":"Anonymous","post_time":"3 months ago","post_title":"AlgaeCal","post_content":"Has anyone tried AlgaeCal for Osteoporosis?","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/105275/algaecal"},{"post":{"author":"live4ward","post_time":"over 2 years ago","post_title":"Help...I'm freaking out over bone density test!","post_content":"Help...I just had a bone density test and it's showing I'm osteoporotic (score of -3 according to the radiology tech....my ob-gyn has not reviewed it with me yet). I'm only 53 and otherwise in perfect health!. I am completely freaking out now, afraid I'll be labeled as osteoporotic (with no idea what implications that will have) and doomed to a life of cifosis and compression fractures. I have absolutely no fracture history. I was drastically underweight for a brief time as a teenager, I tend to eat vegan and I'm sure I haven't gotten enough calcium over the years, and I've always thought I was low in estrogen (androgynous body type, infrequent periods, barely noticed menopause). On the other hand, I don't smoke and I exercise plenty -- any advice? I'm scared.","like_count":"1","tags":["Bone Density","Treatment","Diagnosis"]},"responses":[{"author":"faithduggi","resp_time":"over 2 years ago","resp_title":"RE: Help...I'm freaking out over bone density test!","resp_content":"Hi - I also have been recently diagnosed and like you felt like I was maintaining a very healthy lifestyle. I am 59, did not overeat, and exercised regularly. Apparently 1 in 5 women over 50 develop this. The good news is that there are lots of treatment for this and some meds can reverse the trend. I just met with my friend for dinner yesterday who has it at 56 and her mother has had it for years and is now 90! I am here for you...Let me know what you find out from your doctor.\n2\n"},{"author":"live4ward","resp_time":"over 2 years ago","resp_title":"Oh wow Faith, thank you!! You can't know how reassuring your post was. 1 in 5....I'll be.... So I'm pondering low-dose estrogen/progesteron and calcium supplement OR Fossamax OR both. I'm a bit embarrassed to say that I'm afraid of the possible weight gain from the estrogen, and I'm afraid of being labelled \"osteoporotic\" if I take the Fossamax....or even if I don't, honestly. I don't know what implications that might have. Main thing is, I'll probably need another dental implant one day (have already had one very successful one), and I don't know if this diagnosis is a contraindication. My ob-gyn is young and I think I'm one of the first of these early onset types she's seen, so she's open to my input I THINK..... What did you do, Faith? What would you recommend? I have zero other health conditions. (And I am sorry you went through this to, healthy as you have lived....I admit I didn't vary my diet enough over the years and didn't take in enough calcium, so I'll sure take responsibility for bringing it on...) Thank you again so much for posting!!!","resp_content":"1\nReply\njasminecage\nover 2 years ago\nwow I was just given the same news back in Nov. 2017 so thank you both for posting. I was shocked too because I too was living a healthy lifestyle at least that is what I thought. I have been not doing as much as I use to because I have been afraid of breaking my back. I am finally going to a specialist next month. please post any ideas that work for both of you, I don't know anyone who has this which is even harder to get advice. again thank you both.\nReply\nfaithduggi\nover 2 years ago\nThank you all for your posts. It is great to hear from others. Right now, I am looking at various options. I am very interested in bioidentical hormones and Im still researching which doctor to see. I was prescribed Elixar (sp?) but I have read that there are some side effects...but it is not out of the question. I am going to see my regular ob/gyn on Feb. 22nd to discuss options. In the meantime, I am exercising --this is really important-- doing weight bearing exercises plus walking every day and taking calcium citrate, magnesium, boron and K2. I have also watched videos on Youtube regarding osteoporosis. Regarding bioidentical hormones, these were used previously to treat Osteoporosis but were discontinued after the Women's study in 2002. This study has come into question from the reading that I have done.\n1\nReply\nlive4ward\nover 2 years ago\nHey guys.... I want give you an update. I got a second scan from a company I found called Dexafit ... local folks franchise and do fitness assessments usually for athletes. They did a whole body fat/BMI/lean muscle/symmetry all over the body/and bone scan for just $150. I was fully prepared for ... and expecting ... the results to be as bad or worse than the first one. I just wanted to be sure. THE RESULTS WERE DRAMATICALLY DIFFERENT....AND BETTER!!! Instead of a -3 overall, I had a -1.8. This is osteopenia, not osteoporosis. That was huge for me. It did not motivate me less to address the condition; it motivated me a whole lot more. I asked the guy if he was confident in his results and he said absolutely.....master's in kinesiology, certified in xray, and just calibrated the machine last month. So WOW. First scan was ordered by doctor through one of those services that do all that stuff for doctors. Troubles me that it was so far off; wonder about the machine and calibration. Interesting that the tech told me she sees scores like my -3 \"all the time.\" I thought she was just trying to make me feel better. Just thinking that if you can, get a second scan if you get extreme scores, just to be sure. Having said that, I took my first dose of Fosamax Monday and I'm off on my bone-building adventure. Also FINALLY drinking some milk after years of stubbornly refusing. Just a little. Baby steps. How's everybody else???\n1\nReply\nAnonymous\n3 months ago\nHi Faith - Did you ever use the Biodentical hormones?\n"},{"author":"llynn1143","resp_time":"over 2 years ago","resp_title":"RE: Help...I'm freaking out over bone density test!","resp_content":"Hi all. I'm 59 and was diagnosed with osteoporosis when I was 50. Yes it was a shock because like many of you, I lived a \"healthy lifestyle.\" But what you will learn is that your currently lifestyle really has nothing to do with this - you lay down bone when you are a child, teen and young adult. It is during that time that nutrition and exercise matters most. I was borderline anorexic in high school and was always naturally thin, and along with genetics, I ended up with this. The good news is that I have taken a variety of medicines, my bone density has remained stable - that is, as I have aged, my bones have not. I am very active, hike, bike, lift weights, do yoga, etc. etc. I eat right but maintain a healthy BMI - my doctor (a rheumatologist, by the way) does not want it below 22, because you need to carry some weight to keep your bones strong. I have tried a variety of medicines and none have given me side effects. I have not broken a bone, nor have I suffered any implications with my health insurance. I realize everyone is different, and I know your diagnosis is scary, but there are far worse things that can happen to you! Research your condition, make sure you have a good doctor - my GP recommended me to a specialist right away who I see annually. Good luck, and try not to worry!\n2\n"},{"author":"wezee","resp_time":"over 2 years ago","resp_title":"I am 72 and just diagnosed with osteoporosis..I have been reading about vitamin K2 and it’s great benefits for directing calcium to our bones and out of our arteries..I started taking 200 mg daily along with plenty of vitamin d3 and magnesium and calcium..I won’t take the drugs..too many side effects...","resp_content":"3\nReply\nlive4ward\nover 2 years ago\nHi Lynn, and thank you so so much for the encouragement. I can't say how much it means to hear all that. We are twins :-). Anorexic in high school also, and so grateful to have recovered... but I realize I did this to myself 35 years ago. Ready to go forward and deal with it. Lynn, I wonder what meds you have done to stabilize? Would love to know. AND THANKS SO MUCH TO ALL OF YOU WHO POSTED, AND BLESS YOU\n1\nReply\njasminecage\nover 2 years ago\nHi everyone, I had an eating disorder for 15 years so now I know how I got this. I got some of the vitamins today and will start to take them, thank you Faith, also if anyone has taken the medications for this could you tell me if it worked and what are the side effects. I looked some up online and they list all the side effects which is scary. thank you all, keep healthy\nReply\nfaithduggi\nover 2 years ago\nJasmine - Keep reading, eat healthy including fats, and continue taking vitamins and weight bearing exercising. It sounds like you are doing the right thing, asking lots of questions, and yes, I will be interested in hearing what medicine is helpful. There is hope.\nReply\njasminecage\nover 2 years ago\nHi Faith, Thank you for your input, it is not as scary when others have the same thing and are doing good. I have been doing weight bearing exercises, at first I was afraid to even move for fear of my back breaking but thanks to the internet I know what to do, I have two daughters and just the fear of not being able to take care of them was a lot. they are very active so we all go walking together. I am feeling so much better after reading all the positive posts, Thank you for that and bless you. Jasmine\nReply\nlive4ward\nover 2 years ago\nJust can't get over all the great posts and how much it has helped me face this head on. I already do lots of walking and some weight training, so got that covered. A retired radiologist whom I know and love said that Fosamax is a \"no-brainer,\" so yes on that. Already started a calcium/D/K supplement called \"Bone Up,\" though I may try low dose estrogen to possibly improve absorption. I need to start drinking some milk.....i am easing into that one. I found a fitness place where I can pay out of pocket for a second bone scan just to see what it says and probably reinforce my commitment. I really proud of all of us for dealing with this thing, and gosh it is so true that of all the conditions we could have this one's far preferable to so many. Thank you again so much to each of you....faith and llyn, you guys gave me HOPE.... hey, and you guys keep posting on your progress! Bless you all ------\n1\nReply\nfaithduggi\nover 2 years ago\nWill continue to post Live4ward! And everyone's support is so incredible that it has helped me so much as well. I'll let you know what I find out with my doctor in February. Bless you all and keep exercising!\n2\nReply\nbonebabe\nover 1 year ago\nSounds like you're very positive and moving forward. I will tell you though, having a bone density scan less than 2 years apart will not give you any information. Bone is very slow to respond to change - increase or decrease. You have to be patient, wait the two years, and the rescan at the same place. I'm glad to see that the 2nd scan you had was on a calibrated machine. Sounds like the first one was rather sketchy. One thing to avoid are the ultrasound heel scans that are done at health fairs and such. They are designed to determine if you need to have a DXA. They are not diagnostic and cannot be used to determine bone density. Many people (including health professionals) don't truly understand this.\n1\n"},{"author":"marnee314","resp_time":"over 2 years ago","resp_title":"RE: Help...I'm freaking out over bone density test!","resp_content":"Hi, I was just diagnosed with osteoporosis as well. I’m almost 55 and have not taken any meds due to fear of side affects. I take all the require supplements, walk lots and am working on the weights. Is there any chance to fight this without taking the RX? Help!! Suggestions!!\n1\n"},{"author":"MsBaak","resp_time":"over 2 years ago","resp_title":"I researched osteoporosis in college years ago. At the time there was an older lady who had completely reversed severe osteoporosis entirely through lifestyle, nutrition and exercise. I believe it is possible if a person will put in the effort.","resp_content":"Reply\nbonebabe\nover 1 year ago\nShort answer - No. If you have osteoporosis (T-score of less than -2.5 or have had a nontraumatic fracture as an adult) you need a medication. Nothing else will strengthen your bones. You'll need the 1200 mg of calcium every day (taken twice a day, 600 mg at a time) and 1000 IU of Vit D.\n\nAbout exercise - weight bearing exercise does not mean using weights. In fact, if you have osteoporosis, it can actually contribute to spinal fractures.\nWeight bearing exercise is anything done on your feet - supporting your whole body weight. Walking is the best. Not biking, swimming or running.\n\nDon't be afraid of medication side effects. Nothing in this world is without side effects on some people. My husband is deathly allergic to strawberries. How much more natural can you get than those? If you take a medicine that doesn't agree with you, try another. Just like with antibiotics (speaking of side effects!) you might have to go through trial and error.\n\nTwo years after you begin a medication, repeat your bone density test at the same testing center. That's how you'll get an accurate result, assuming that your tech is certified in bone density testing.\n2\n"},{"author":"meghanjane","resp_time":"over 2 years ago","resp_title":"RE: Help...I'm freaking out over bone density test!","resp_content":"Hi. I am 48 and pre menopausal and also have low bone density which I’ve known for a while but also just went for a dexa scan after not having one for 4 years and it showed an 11% decrease in the femoral neck (down to -2.4). I also was freaking out as I am very active and feel like I am in the best shape of my life. My OBGYN sent me to a rheumatologist and she is ordering blood work but said no meds, and wants me to get more calcium from foods like ricotta cheese etc as opposed to just supplements. I am very thin and struggled with an eating disorder in my 20s. It is very upsetting but she said risk of fracture is more than just the dexa score so the good news is we have time!! Stay active and eat well and remain positive!!\n2\n"},{"author":"marnee314","resp_time":"over 2 years ago","resp_title":"Thank you! Is it really true we can’t reverse the density loss by diet and exercise?","resp_content":"Reply\nmeghanjane\nover 2 years ago\nI’ve heard different things about this and would appreciate other’s input. I’ve heard it can’t be reversed however I believe the “scores” can improve if the bone loss is halted or slowed as we age.\n1\nReply\nlive4ward\nover 2 years ago\nI'm told we can slow the progression OR EVEN HALT IT, but not increase scores past our 30s except with a med that interferes with the cells that cause bone deterioration. But all that good diet and exercise stuff DEFINITELY slows it and is awesome. (by the way, consider a second opinion? see my post on this)\n1\nReply\nbonebabe\nover 1 year ago\nYes, diet and exercise alone will not reverse osteoporosis. Once you reach a certain stage, you'll need a medication. So many of my patients would put off taking the RX out of fear or denial or whatever. The sad thing is, they continued to lose bone all during that time. The more bone you lose, the harder it is to keep what you have healthy and strong. By the time, they fractured and wanted RX, they were a lot further down the T-score scale. You can't bring a number back into the normal range. You can, however, strengthen your existing bone and stop the breaking.\n\nThere's an excellent website www.nof.org (The National Osteoporosis Foundation) that has a good Q&A section. They address all thing relating to bone health. I think you'll find answers to questions you didn't even know you had.\n1\nReply\nbonebabe\nover 1 year ago\nOne thing I want to say about improving scores. The DXA machine only measures the calcium in your body. So...if you have a lot of arthritis in your spine or hip - or bone spurs, it can appear as more bone, thereby giving you a higher score. If that happens, the technician should scan your forearm as the bone in the forearm is similar to that of the spine. The spine results would be thrown out in the analyzation of your test.\n\nAlso, as I stated in another post - results aren't determined by T-score. In fact, sometimes we'd get a T-score that was actually higher than the previous one, but when we did our calculations, the BMD numbers showed a decrease. Be sure to have your test done at a reliable certified place and interpreted by someone who's also certified clinician in reading DXA results.\n1\n"},{"author":"grayowl","resp_time":"over 2 years ago","resp_title":"RE: Help...I'm freaking out over bone density test!","resp_content":"I'm freaked out as well. I'm 54 and in good health but had ovarian failure and early menopause in my 40s. I have always been thin. I too did not get enough calcium as a child, but drink about 1/2 gallon of milk a day and take Vitamin D. I figured that my bone density would be okay; however, I had my first bone density exam this month and received result similar to yours. I am taking Calcium and Vitamin D now on a daily basis and have been reading about the various drugs to treat osteoporosis. Seems they all have negative, scary side effects. Please let me know which treatment protocol you went and if you have experienced any side effects since beginning treatment. I recently started weight training....I have never have used weights before and hope to preserve the bone density I do have. I too am worried about compression fractures in my spine...\n1\n"},{"author":"marnee314","resp_time":"over 2 years ago","resp_title":"Hello,","resp_content":"\nI am coming up on 55 years. I had a hysterectomy when I was 40 yrs old and had both my ovaries removed. Have been on HRT since then yet i have been weaning off significantly. I have never struggled with weight until these last few years.\nMy last Dex scan was six month ago and it showed my osteoporosis has worsened. So, this all has led me to see an endocrinologist. Honestly, I felt my appointment was more a sales pitch to get me on medication.\nI take all the supplements suggested and also know to strengthen muscles surrounding bones is very important.\n\nSo.... I’m planning to get another doctors opinion, I’m planning to see a holistic person and get all thoughts.\nIt’s extremely frustrating hearing both sides of medicine bashing each other.\n\nI am hoping to hear from you ladies, your successes, your suggestions and what you know to be truth and facts!\n1\nReply\nfaithduggi\nover 2 years ago\nHi Marnee and all -\n\nI went to my OB yesterday and I am not that much closer to an answer. One thing she suggested which I think all of you consider is getting a second bone density test. According to her, variations occur in bone density testing due to the technician who is doing the evaluation. I am not trying to give false hope but it is definitely something that you might consider.\n\nI am also undergoing some additional testing including a 24 hour urine collection to see if I am losing too much calcium.\n\nStill thinking about HRT and homeopathic as sometimes I experience fatigue and headaches.\n\nAssuming all is non remarkable, my OB/GYN is recommending Forteo to add bone mass. My endocrinologist recommended a different drug so it is all very confusing. I know nothing about this Forteo but that is next on my list. I've been busy at work but will let you all know what I find out.\n\nIn the meantime, keep reading, keep exercising and eating right. And maybe take another bone density test to rule that out.\n\nThinking of you all...\nReply\nfaithduggi\nover 2 years ago\nHi ladies -\n\nA very quick update!!!!! I just found out the results of my second bone density and I do NOT have osteoporosis - still osteopenia!!!!\n\nStill this is a HUGE wakeup call to me to keep exercising and eating right for my bones!\n\nMy OB who is a specialist in osteoporosis read my scan herself so I feel so fortunate. And thank God as well as He has a hand in everything.\n\nPlease go out and get one more test if you have not done so and from a clinic that is reputable.\n\nHang in there, keep exercising with weights and walking, and eating right! Thinking of you all as we go down this path.\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Help...I'm freaking out over bone density test!","resp_content":"I've been labeled with osteo since age 57, I took the meds, had a once a year infusion for 3 years and now take a shot 2 times a year, I'm 80, ride a motorcycle, western dance, ride a bike and have had no problems. I did break my wrist a couple of years ago after a fall on concrete but nothing else. Don't be afraid you can turn low calcium around and build bone with medication. I had short periods and barely noticed menopause too.\n1\n"},{"author":"tremmy","resp_time":"over 1 year ago","resp_title":"Hi, my Mom is 78 & has had osteo for 20+ years. She took the daily med for a short time but stopped due side affects. Her test have been fine but last year they should treat loss. She has just seen a Endocrinologist. She wants her to go on Prolia but she is very afraid of the side affects. Is this what you take.","resp_content":"Reply\nAnonymous\n7 months ago\nWhat meds did you take?\n"},{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: Help...I'm freaking out over bone density test!","resp_content":"I haven't been onboard for a while, retired and got custody of my 15 year old grandson, but let me weigh in. I worked (for those of you who aren't familiar with my posts) for the past 21 years in an internationally accredited hospital affiliated osteoporosis center. There's nothing you post that I haven't seen or heard.\n\nSo specifically about your situation....living a healthy lifestyle is great but is no guarantee against osteoporosis. Sometimes it's just the luck of the genes. The fact that you were low weight, low estrogen and vegan certainly plays into your low bone density. I have had this same conversation with my sister in law - who is in complete horror and denial of her osteoporosis. She also teaches yoga, so we've had numerous conversations about proper body positions to avoid fracture.\n\nThe good news for you is that you're young. Your body will not grow more bone, but you can keep what you have healthy and reduce your chances of having another fracture. People who fracture once are twice as likely to fracture again. Having osteoporosis in your 40's or 50's is not as dangerous as in your later years.\n\nHere's my advice and insight for you. You need 1200 mg of calcium every day. The majority of people do not get it in their diets. The reason being that your body will only absorb 500-600 mg at a time. Any more than that is peed out. Best to take a supplement. Doesn't matter what kind. Calcium is a mineral and not broken down. Don't be spending a lot of $$ at a health food store thinking you're getting the best. Tums and a multivitamin are fine too.\n\nYou need 1000 IU of Vit D each day. You'll need a supplement for that as people over age 50 do not make it from the sunlight like they did when they were kids. It's what sends the calcium to the bones.\n\nExercise - be careful. No running. It pounds the spines and can fracture the tiny struts within the vertebrae. When that happens often enough, you have a compression fracture. No bending forward from the waist or side to side twisting of the spine. Remember too, calcium is excreted in your sweat, so if you are perspiring heavily, you're losing calcium.\n\nTake a medication. Talk to your doctor about which one you take. They all will reduce your risk of fracturing. It's not about the T-score. It's about your risks. The meds won't rebuild your bone (except Forteo, and that's for the frailest of the frail), but they will make what bone you have stronger. Medications do not take the place of calcium. In fact, they won't work if you don't give them the calcium to work with. Don't be afraid of any possible side effects. Everything has side effects, even natural stuff.\n\nWhat you want to do is not fracture. Get a repeat DXA 2 years after your last one. DO NOT look at the T-score as an indication of improvement. That's not how it works. I suggest you ask the person doing the test if she is credentialed by the ISCD (the governing body of all things osteoporosis). If she isn't or looks at your blankly, have your test done somewhere else. You won't be getting verified information. If you really want to throw them, ask them if they do a precision test on the machine and how often. That's where they scan a person 2-3 times to see how closely they can replicate the test. They then go through a series of calculations to determine the LSC (lowest significant change) or error of margin. This is extremely important to do. Otherwise an inch or two difference on how you're lying on the table can determine whether you've improved and whether or not you take a medication.\n\nMy soapbox. Too many places put unqualified people doing DXA testing because the requirements for it are not regulated. There's money in testing too. And most radiologists and doctors are not credentialed in interpreting bone density tests. You can look at the website www.iscd.org to find a testing place and doctor who do know what they're doing. If one is near you, I'd suggest you go there.\n\nSorry this long. I hope I've given you some valuable information. Best of luck to you.\n2\n"},{"author":"faithduggi","resp_time":"over 1 year ago","resp_title":"Bonebabe and all -","resp_content":"\nWhat an excellent post and so good for us all to hear. I urge everyone to follow your advice about bone scans. Again it is a wakeup call for all of us to continue leading a healthy lifestyle and seeking out the best advice.\n\nI have just reread all of the posts and they are all brilliant and inspiring to me to continue working out and keeping my body strong.\n\nI have just upped my hand weights to 10 lbs from 5 lbs. I am not very good at using them - but I am trying...I told my 22 year old daughter that I was working out with weights and she said that I will have \"2 tickets to the gun show\". Ha!\n\nYou ladies in your 60s, 70s and 80s - motorcycles! - you go girls! You are my inspiration!\n\nHope you all have a blessed day and keep walking, working out, eating right, and being you!\nReply\nscolifriend\n10 months ago\nIn response to \"bonebabe\" - since you worked at a hospital affiliated with osteoporosis and have seemed to been in contact with so many different conditions, I'd like your opinion on my situation. I do have osteoporosis and am currently on Prolia after taking Fosamax for years. I also have Scoliosis and have had 3 surgeries on my back. I had a double curve, and my first surgery was at 26, an older age than normal (kind of a long story). I was put in traction for almost a month, operated on (fused 2 Harrington rods to my spine) and wore a body cast for 11 months. My third surgery was on my lower back and the rods were taken out and the doctor used spinal cages. That surgery was when I was in my late 50's. I am now 69 and have osteoporosis. It seems my back is more boney (?) than ever, and I am concerned as to how the spinal cages will be held with the deterioration of the bones. When I do get a dexa scan, they can only do my forearm and hip because of the cages. Have you heard of anyone else in this situation and what I can expect in the future? Thanks for any information you can provide!\n"},{"author":"engracia21","resp_time":"7 months ago","resp_title":"RE: Help...I'm freaking out over bone density test!","resp_content":"Hola !! yo tengo 62 anos y fui diagnosticada igual que tu, pero yo no me panique, yo me ocupe de hacer lo que debo hacer: mejorar mi dieta, hacer yoga y ejercicos y vivir mi vida feliz.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/37327/help-i-m-freaking-out-over-bone-density-test"},{"post":{"author":"tappy7","post_time":"3 months ago","post_title":"Reaction to reclast infusion","post_content":"This may be repeat I thought had already posted\nI have had severe neg reaction to reclast infusion of 6 days ago\n10 hrs after infusion I awakened dizzy vomiting\nWith severe chest pain felt like heart attack. Taken by Amb to ER local hosp\nNo heart attack or lung evidence. Lab tests ok\nWas given opioids for pain and discharged w dx of\nChest pain. Pain in chest arms now slightly abating so I have hope. It is the worst pain - beyond childbirth/ I have ever experienced. I beg u don’t risk it!!!! How this could be on the market is beyond my comprehension","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/104865/reaction-to-reclast-infusion"},{"post":{"author":"tappy7","post_time":"3 months ago","post_title":"Reclast reaction","post_content":"Had infusion of reclast for osteoporosis 6 day’s ago\nApprox 10 hrs later nauseous dizzy lost balance and fell repeatedly. Severe chest pain. Center of chest and arms. Like a heart attack\nSevere drop in BP. Pick up by EMT Hosp r/o heart and lung probs. Blood tests ok. Pain persists\nSlightly abated.\nWould like to warn others\nI just overlooked the possibility anything could be this dangerous and on the market. Please don’t risk it!!!!!\nI was prescribed opioids for pain and discharged w\nDx “chest pain”","like_count":"1","tags":["Bone Density","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/104864/reclast-reaction"},{"post":{"author":"hellomyfriend","post_time":"4 months ago","post_title":"DEXA shows -7.6 in left hip","post_content":"Hello all,\nCan anyone tell me what the odds are with osteoporosis this severe, what if any recovery would be if I break this hip. Will I be in a wheelchair for the rest of my life? I'm 61 and was diagnosed 2 years ago. Waiting for the most recent scan results and even though I've been on Fossamax for 2 years, I'm not hopeful.\nThanks for any input.","like_count":"0","tags":["Bone Density","Living & Managing","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/103562/dexa-shows--7-6-in-left-hip"},{"post":{"author":"carolshaffer","post_time":"5 months ago","post_title":"Barbotage","post_content":"Can Barbotage be done on finger bone spurs?","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/101990/barbotage"},{"post":{"author":"joelcoqui","post_time":"5 months ago","post_title":"Dr. cant tell if Fosamax causing more IBS because I have it. Change to infusion?","post_content":"I have had IBS-D for years which now became IBS C&D. On Fosamax for 3 months now and we cant tell if it causing side effect bowel issues. Dr. wants to try a once a year infusion because it bypasses the stomach. Would this mean that if there was a side effect, it would last a year? Im wondering if I should put up with my belly symptoms (constipation, then urgent diareah). Thoughts?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/100932/dr-cant-tell-if-fosamax-causing-more-ibs-because-i-have-it-change-to-infusion"},{"post":{"author":"Anonymous","post_time":"7 months ago","post_title":"Just diagnosed","post_content":"Just diagnosed with a 3.5 and am having a hard time leaving my house I’ve become so scared. I haven’t started any treatment yet, so frightened of side effects. I need some help and support to keep on going.","like_count":"0","tags":["Exercise","Bone Density","Living & Managing","Treatment","Diagnosis"]},"responses":[{"author":"3spoiledfurkids","resp_time":"7 months ago","resp_title":"RE: Just diagnosed","resp_content":"Hi!\nI'm no expert, just another patient, but wanted to encourage you!\nIs your number +3.5 or -3.5? I'm guessing -3.5, but could be wrong\nI fractured right femur (thigh) stepping onto a sidewalk in 2011. Dr just told me I had brittle bones. I asked about osteoporosis (my mom had had it), but was told no. In 2015, I fractured fibula & tibia on same leg, just bending over & was finally told I had bones like cracked eggshells & surgeon HOPED I'd be able to walk when I healed...oh, & osteoporosis. (I was so doped up, he had to say the words!)\nWhy tell you this? Because I AM walking again (with a walker, but I'm WALKING!)\nAlso because, fingers crossed & knock on wood & LOTS of faith, I've been on two different meds and had a no serious side effects AND NO more fractures!! Also, my DEXA results are showing improvement!\n\nAt least you know you have osteoporosis AND there are meds that can be tried! I don't know what your experience will be, but I can guarantee that living with worry and fear will NOT help.\nI was pretty fearful about one of the POSSIBLE (NOT guaranteed) side effects of one medicine. I talked to several medical folks, including my pharmacist. One of them said, \"They have to put every possible side effect so you can't say you weren't warned. Heck. If you drink too much water you can have problems! It's also possible that the folks with those side effects may have had other factors that you don't, so don't assume you'll get side effects!\"\nLonger story short: you can worry yourself sick, which can weaken your body, etc. Don't do that. Fear/worry feeds illness. Starve it!\nHang in there and think positive! Discuss medications with Dr and ask other medical folks' opinions if you need. Get your positive attitude and start fighting osteoporosis back!!!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/97649/just-diagnosed"},{"post":{"author":"Anonymous","post_time":"8 months ago","post_title":"Normal bone density scan, so then why...","post_content":"I'm 58 y/o, post-menopausal, and had my first DEXA bone density scan a few months ago. Said my bone density was good and was what to be expected in a woman my age. Thought it curious though; in the letter I received from the office, they recommended I consume 1500 to 2000 mg of calcium daily. That would be an increase from the twice daily, 500 mg doses I have been taking since what seems like forever (probably since I hit menopause 7 years ago). Everything I've read says you shouldn't take more than 600 mg at one sitting; I did find a Citracal MaxPlus that is something like 650 mg in one sitting. But still that's only 1300 mg daily. Where am I supposed to get the other 700 mg? I only drink about 8 oz of skim to 2% dairy milk a day; SOME days I have 4 to 6 oz Greek yogurt (plain with fresh fruit added) and those foods can't possibly make up the 700 mg I'm now apparently short! Does anyone think 2000 mg per day is excessive?","like_count":"0","tags":["Bone Density","Diet"]},"responses":[{"author":"Anonymous","resp_time":"8 months ago","resp_title":"RE: Normal bone density scan, so then why...","resp_content":"I take 1200 daily and drink almond milk for extra calcium atkins shake and exercise to add to my daily intake\n"},{"author":"Anonymous","resp_time":"7 months ago","resp_title":"RE: Normal bone density scan, so then why...","resp_content":"I was given that larger dose but I was diagnosed with osteoporosis.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/95429/normal-bone-density-scan-so-then-why"},{"post":{"author":"braidsl","post_time":"over 1 year ago","post_title":"Upset about the diagnosis of osteoporosis","post_content":"I just turned 72. Until last year, my bone density tests revealed osteopenia. Last year for the first time it revealed age related osteoporosis with some bone loss in my left hip...but not in my spine or right hip. My doctor wanted me to start on Boniva, but I decided to wait until my next test, which is coming up this Saturday. I am generally in good physical health. I am thin, exercise regularly and lead an active life style. I have decided that if the next test shows additional bone loss, I will start taking one of the recommended medications. Would like to hear from people who had had experiences with these meds. Thanks.\nLorraine","like_count":"2","tags":["Bone Density"]},"responses":[{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: Upset about the diagnosis of osteoporosis","resp_content":"Take the medicine. You won't recoup any bone lost and can maintain and strengthen what you have. It doesn't matter the scores in your right hip or spine. Diagnosis is given upon the lowest score. With the medication, be sure to consume 1200 mg of calcium taken in 600 mg increments. The medication won't work effectively without this. Get a supplement with Vit D and it sends the calcium to the bone.\n\nAs for exercise. Walking is best - no running. No bending forward at the spine (toe touches, crunches, etc) and no side to side twisting of the spine. These weaken the small bones in the spine that cause minute fractures that you can't feel - until the last one in a vertebra breaks, then you have a no do-over compression fracture.\n\nAs I tell everyone - go to the NOF website (www.nof.org) for the most reliable and up to date info on osteoporosis. They have very good sections on medication comparisons, body mechanics and diet. Also one on \"natural cures.\"\n1\n"},{"author":"amystudentpt","resp_time":"over 1 year ago","resp_title":"RE: Upset about the diagnosis of osteoporosis","resp_content":"Dear Lorraine (braidsl),\nHello, my name is Amy and I am a second year Doctor of Physical Therapy student. I am sorry to hear about your diagnosis of osteoporosis. It sounds like you are concerned that this diagnosis will prevent you from doing the things you enjoy in life and from continuing your healthy, active lifestyle. While it is important to follow your doctor’s recommendations about medications to slow bone loss, you would likely also benefit from physical therapy in combination with your medications.\nAs your doctor has likely informed you, osteoporosis puts you at increased risk for fractures, which can commonly occur from falls, bumps, or strenuous activity. While physical therapy is not a substitute for medications recommended by your physician, it can be a beneficial adjunct to help reduce your risk of fractures. In fact, a 2018 study by Rafiq examined the effects of treatment for osteoporosis using medication plus physical therapy compared to medication alone and found that women treated with medication plus physical therapy had a higher bone mineral density after treatment than the women treated with medication alone.1 A physical therapist can help you increase your strength, slow your bone loss, improve your balance to prevent falls, and teach you small adjustments you can make in your life to safely perform activities that you enjoy doing to maintain a high quality of life.\nA physical therapist will work with you to assess your current strength, movement patterns, and balance and develop a set of exercises specifically for you to help increase your strength, improve your balance, and slow the breakdown of bone to help reduce your risk of fractures. A physical therapist can also educate you on proper movement patterns to reduce undue stress on your body to make sure you can participate in the activities you enjoy safely for as long as possible. A physical therapist can also work with you to help improve your balance to reduce your risk of falls and associated fractures. If you would like more information on how physical therapy can help with osteoporosis, you can go to https://www.moveforwardpt.com/SymptomsConditionsDetail.aspx?cid=b5e09439-77a8-497d-b8d9-b5250de60544 . There is a section near the middle of the page labeled “How can a physical therapist help?” that can provide you with more information.\nWhile I am not sure what state you live in, all states have some form of direct access to physical therapy, meaning that you do not need to obtain a physician referral before seeing a physical therapist. If you would like help finding a physical therapist near you, you can use this link here. http://aptaapps.apta.org/findapt/SearchResults.aspx .\nI hope this post helps you and I wish you the best of luck.\nSincerely,\nAmy, SPT\n\n1. Rafiq S, Zia S, Ijaz MJ, Shahid HA, Adeel M. Role of weight-bearing exercises in the treatment of post-menopausal osteoporosis. J Coll Physicians Surg Pak. 2018;28(2):122-125. https://www.ncbi.nlm.nih.gov/pubmed/29394971 . Published February 2018. Accessed February 23, 2019.\n"},{"author":"PeasandCarrots","resp_time":"over 1 year ago","resp_title":"RE: Upset about the diagnosis of osteoporosis","resp_content":"My mother took the biophosphonates for years; it slowed and for a while stopped the progression of osteoporosis. Ultimately, she did a two-year injectable therapy of Forteo, which was also successful. I am 58 and at my next bone density it is very likely my hip joints will be in the osteoporosis category; I expect my spine to still be osteopenia. I cannot take the biophosphonates due to jaw surgery. I am working with an endocrinologist and am trying to get as much dietary calcium as I can. I need to exercise more; I figure the more muscle I have to hold up my bones the better! From watching my mom, I would say those medications were totally worth it. If you're a good candidate, go for it.\n"},{"author":"Bradenton","resp_time":"8 months ago","resp_title":"RE: Upset about the diagnosis of osteoporosis","resp_content":"Your doing great. What is Boniva?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/79460/upset-about-the-diagnosis-of-osteoporosis"},{"post":{"author":"marksindone","post_time":"10 months ago","post_title":"used","post_content":"I used to be in a similar situation after suffering from a torn ligament due to a road accident. I was really afraid to get back on track for months after the doctor certified that I was fit to be active again. However, I learnt that I needed to push myself slowly, but surely, in order to train my body back in order for my body not to deteriorate even worst.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/92069/used"},{"post":{"author":"djack078","post_time":"10 months ago","post_title":"Osteoporosis with spinal fractures","post_content":"Is it normal to get more spinal fractures after kyphoplasty","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/91751/osteoporosis-with-spinal-fractures"},{"post":{"author":"forrest5","post_time":"over 1 year ago","post_title":"Barbotage (Non Surgical Bone Spur Treatment)","post_content":"Does anyone have any experience with the following treatment for bone spurs? The area is numbed and then a needle is placed under ultrasound guidance to break up the bone spur. The spur is then naturally reabsorbed by the body and the joint can now move freely. This is a great example of how stem cell therapy can be combined with advanced image guided needle techniques to help restore normal joint function.","like_count":"0","tags":[]},"responses":[{"author":"labia56","resp_time":"11 months ago","resp_title":"RE: Barbotage (Non Surgical Bone Spur Treatment)","resp_content":"No. I was 28 when I had my toe joint replaced. I was told 25 years later by another podiatrist that it was a botch job and I should have sued. I didn't know any better. I hope you get the resources you need to be more informed than I was! Good luck~\n"},{"author":"Anonymous","resp_time":"10 months ago","resp_title":"RE: Barbotage (Non Surgical Bone Spur Treatment)","resp_content":"Are you talking about ANY kind of bone spur, ANYwhere? I happen to have one on my L4 or L5 vertebra. It is pressing on my sciatic nerve and causing intense pain down my right leg, especially in the thigh. I'd like to just have the \"spur\" removed. Can this be applied to spinal surgery?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/88534/barbotage-non-surgical-bone-spur-treatment"},{"post":{"author":"Anonymous","post_time":"11 months ago","post_title":"Does osteoporosis cause cysts in your uterus","post_content":"I have a cyst in my cervix that was found last year and I keep having recurring UTIs.","like_count":"0","tags":["Exercise","Diet","Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/89017/does-osteoporosis-cause-cysts-in-your-uterus"},{"post":{"author":"crumblingbody","post_time":"over 1 year ago","post_title":"Fragility fractures with osteoporosis","post_content":"I am 29 and have severe osteoporosis caused by chronic anorexia Nervosa. Just in the past two months I have fractured 2 vertebrae and 2 ribs, plus other older fractures. But it’s getting worse. One fracture was from trying to pick up a toddler, and the most recent rib I broke by leaning gently on my kitchen counter. My body is crumbling for no reason. I’m scared to do anything anymore. I know I’ll just keep breaking bones. I’m starting nursing school but I can’t have my bones snapping there so I can’t, can I? And they say exercise helps, but couldn’t weights or running or a ballet class break more bones? Any feedback would be appreciated. This seems hopeless, I’m only 29!","like_count":"0","tags":["Exercise","Bone Density","Living & Managing","Symptoms","Diagnosis"]},"responses":[{"author":"PeasandCarrots","resp_time":"over 1 year ago","resp_title":"RE: Fragility fractures with osteoporosis","resp_content":"It sounds like you want your future, which is awesome :) I assume you are under lots of good medical care for complications of the anorexia? Honestly, my suggestion is to create yourself a team -- primary medical, maybe endocrinology, psychologist, maybe psychiatrist if that seems appropriate, physical therapist -- hopeless it is not but you need a great team!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/83865/fragility-fractures-with-osteoporosis"},{"post":{"author":"giljackson","post_time":"over 1 year ago","post_title":"hyperparathyroidism not mentioned as cause of osteoporosis","post_content":"In your recent article and slide show on osteoporosis, you failed to mention hyperparathyroid disease that is a readily surgically correctable, fairly common cause of early onset osteoporosis. More common in women than men, the diagnosis can be made with thorough office clinical evaluation along with blood tests including serum calcium and parathyroid hormone (PTH) and possibly others.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/83669/hyperparathyroidism-not-mentioned-as-cause-of-osteoporosis"},{"post":{"author":"carolem","post_time":"over 1 year ago","post_title":"CaroleM","post_content":"What is the safest medication for osteoporosis?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/83214/carolem"},{"post":{"author":"bluejay1960","post_time":"over 1 year ago","post_title":"Declining bone density while on Reclast","post_content":"Age 79 female of Norwegian descent. BMI 24.2. Mother with hip fracture in her 80s. DXA indicates osteoporosis is worsening despite treatment with Fosamax and then Reclast (2018, 2017, 2010, & 2009. I am scheduled for another infusion in March of this year. Report from DXA scan in September 2018 concludes my 10-year fracture risk is 51% for major osteoporotic fracture and 39% for hip fracture. The previous scan in 2016 was 48% and 36%. Daily intake: calcium citrate (1260 mg) and vitamin D 2000 IU (blood level in July 2018 was 54). I cut down from 20 mg to 10 mg of omeprazole daily a year before the 2018 DXA. In 2004-5, I took prednisone (starting at 80 mg) for 18 months for polymyalgia rheumatica. Also took prednisone for some time in the late 1980s for tendinitis. In addition, I was on a small dose of Accutane for at least a year during the 1990s for acne rosacea. I did not do any regular exercise/walking. Despite a torn meniscus, I have recently started walking 1 mile 4 times a week and have joined the YMCA where I am in PT for the knee and back pain (arthritis and stenosis), as well as balance and fall prevention including Silver Sneakers Tai Chi and Yoga. My rheumatologist wants me to have Reclast for 2 more years and then switch to something else (assume Prolia, though I don’t like the side effects I read about, especially increase in cholesterol since I already take a statin and have a lipoprotein-a score of 84). A 2009 article on webMD entitled “Do Bone Tests Help Monitor Ostoeporosis? Study Shows Bone Density Tests May Be Misleading for Patients Getting Bisphosphonates” by Salynn Boyles, states: “Even if the test were completely accurate, bone mineral density testing is not a particularly good measure of fracture risk, says Juliet Compston, MD, University of Oxford professor of bone medicine.”\nAnother article reviewed in July 2018 on webMD entitled “Monitoring Osteoporosis Therapy: The controversy of bone density testing in patients already taking osteoporosis medication” makes me wonder if my worsening fracture scores are an accurate indication of fracture risk. At what point can a person stop treatment, and how concerned should I be? My primary care physician is very concerned.\nThank you!","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/82827/declining-bone-density-while-on-reclast"},{"post":{"author":"spencer1942","post_time":"over 1 year ago","post_title":"Nausea with Osteoporosis","post_content":"I’m only taking paracetamol (acetaminophen) and 6 monthly injections of Denosumab But I am in more and more pain and now very susceptible to nausea.\n\nDoes anyone have nausea?\n\nDo you have any ideas of helping it?\n\nMany thanks","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/82813/nausea-with-osteoporosis"},{"post":{"author":"wishing1955","post_time":"over 1 year ago","post_title":"Hip surgery","post_content":"In November (mid) I dislocated and fractured my left hip. I had a total replacement, and am wondering how long does the hip pain last? I can feel the cold in the replacement and over all I am doing well, as I can get around house with out cane, but do need it out side. It is just the pain I hate asking my doctor for pain pills, even though I do not take them all the time, I try to take Tylenol first, and some times it works. But other times I need the pain pill, does the pain ever go away??","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Hip surgery","resp_content":"On a level of 1 to 10, 10 being worst pain you've ever experienced, what is your normal pain level? Pain isn't only physical, it affects your brain too. If you need pain medicine while healing please take it. Be honest with your doctor. You also need to be aware of the risk of addiction,but allow yourself to heal pain free for now. I myself have had several orthopedic surgeries. Take your medicine as prescribed as use ibuprofen instead of Tylenol between doses of pain medicine and see if that works better. And stay strong. You will get through this.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/80568/hip-surgery"},{"post":{"author":"dja1953","post_time":"over 2 years ago","post_title":"re: low bone density...from Jane , age 65","post_content":"After BrCa treatments for estrogren + in 1997-98, I was treated with many drugs (fosamax, prolia to name a couple) to combat my osteopenia. I exercised, did wt lifts, walking, calcium supplements ...not much improvement. After a vacation from bone building prescription drugs for a couple of years, I was prescribed yet again a new oral drug Actavis-Risedronate Sodium to help my bones as I was 63. After about 5 months of faithfully taking this med, I started to have severe bone/joint pain and was limited in my exercise routine. So with medical oversight, I stopped taking the risedronate and improved somewhat in QOL. I was referred to a bone mineralist specialist who ran a new bunch of tests, 24 hour urine collection, Mg, calcium and parathyroid levels included. The whole 9 yards. Never had this done before. I followed the testing criteria to the T.\n\nThat was the revelation I needed. I got the test results online before following up with my bone mineralist dr. I finally saw that my parathyroid level was elevated at the same time my blood calcium was elevated. I did a lot of research on the Internet and discovered I probably had hyperparathyroid DZ. So after more testing and medical HX reviewed, I was accepted as a pt at the Norman Parathyroid Center in Tampa, FL and they found and excised my parathyroid tumor and left the other 3 normal parathyroid glands intact as they were behaving and were normal in hormone production. Day surgery by very skilled doctors. The Norman Parathyroid Center does about 15 parathyroid surgeries a day. I flew there from Dallas, TX.\n\nSo I expect my bone density test to be much improved one year after this neck surgery and I take vit D/Calcium supplements, work out, stay active. That is it. Of course, watch the alcohol, diet sodas...normal advice for anyone. When the parathyroid is stealing calcium from your bones, there is no amount of oral calcium or bone building drug that can over come that powerful hormone effect. There is some medical discussion (from a chemo nurse presenter at a Br Ca support group) that chemotherapy can have an effect on the endrocrine system and may have played a part in my one parathyroid tumor, but my Tampa, FL surgeon, Dr. Daniel Ruan, said it was just my bad luck and I could live my life w/o worrying about this problem recurring. Hyperparathyroidism is underdiagnosed, though relatively infrequent in the gen pop.\n\nSo bottom line, go to a bone mineralist specialist and get all your labs and Look at them to see what is going on with your bones... Don't let the drs assume you are just old or just a Br Ca survivor and that is just a normal part of your situation. My bone mineralist dr did not agree with my lay person diagnosis and he wanted to put me back on Fosamax again for a year then check me again. With my bone density on the line, I said no, I need a 2nd opinion and that is how I finally got the right diagnosis for me. People, you need to know your lab results and take charge of your health. Good luck to you in your pursuit of good health and strong bones. Without the bones, life is not too rosy.","like_count":"0","tags":[]},"responses":[{"author":"dja1953","resp_time":"over 2 years ago","resp_title":"RE: re: low bone density...from Jane , age 65","resp_content":"Oh, I forgot, my bone mineralist specialist said it is very hard to interpret bone density by going to one clinic to another. He said there is a lot of variance from one bone density machine to the next , so the best way to interpret is staying with one clinic (if possible) to look for improvement in bone density from one year or two to the next (Jane)\n1\n"},{"author":"carolynem","resp_time":"over 1 year ago","resp_title":"RE: re: low bone density...from Jane , age 65","resp_content":"Yes, I agree. I was told to take Actonel. No way! A friend of mine was on that and developed swallowing problems and started drooling. Another friend developed jaw problems. I am just staying with increased walking, staying on a plant based diet and taking vitamin D.\n1\n"},{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: re: low bone density...from Jane , age 65","resp_content":"Very good information. The parathryoid is very important in bone building (or loss.)\n\nOne thing I'd add - just for your information - don't expect too much from this next test. Bone is very slow to respond to change. That's why testing is recommended at 2 year intervals. Also at our age (postmenopausal) bone recovery is not common. The aim is not to increase numbers, but to avoid fractures. This is done by strengthening existing bone. The medications do this.\n\nAlso some information for you - sometimes when bone density appears to be greatly increased, it's a false positive. The reason being that arthritis in the spine and/or hip make the bone appear denser than it really is. We see this often when we do DXA scans. If the spine appears red flag better, we scan the forearm. That's because it has the same trabecular bone as the spine and can give us a better indication of your bone density. The forearm is not scanned at each visit as it doesn't really respond to medication It is what it is.\n\nContinue with your calcium intake (1200 mg/day. No more than 600 mg can be absorbed at a time). Exercise..we recommend at least 30 minutes a day, 3 days/week. No running (pounds the spine) and not bending or twisting of the spine.\n\nGood for you being proactive. So many aren't or just believe whatever they read on the internet. Also testing is really controlled by required certification of DXA technicians or clinical interpretation. It's important to find someone or some place that is Certified by the ISCD in order to get verifiable results. The clinic in the hospital where I worked for 21 years was one of the first (in 2009) to be accredited. We were one of 40 internationally accredited osteoporosis centers. To show you rare that is even now - there is not one in the state of NY, GA or SC. Just off the top of my head. There are 6 in NC where I live. The ISCD website can give you a list of technicians who are certified and doctors who are certified to interpret results.\nwww.iscd.org. Play around with the site. Lots of info as well as the National Osteoporosis Foundation, www.nof.org.\n"},{"author":"dja1953","resp_time":"over 1 year ago","resp_title":"To bonebabe: Thank you for your reply. And I see from the info you provided -you are somewhat of an authority in this field. I have not started taking any bone building meds like Actonel or Fosamax again since my successful surgery to remove the parathyroid gland that was out of control. I skipped a bone density scan in 2017, same year as my parathyroid surgery and my 2018 BMD scan was comparable to my 2016 BMD. I was VERY disappointed but then I reviewed the norman parathyroid center web site and they (MDs) said some bone matrix recovery can be slow @4% a year. So maybe I had improved. I have not broken any bones and my aches and pains have declined. I exercise on the elliptical and do weight lifting exercises, stretches. I will redo my BMD test in 2019 if the Dr will allow it. I am still in osteopenia/osteoporosis range. But my blood calcium level is in the 9's and my parathyroid level is much lower since my surgical correction. So I am hoping to make small bone recovery every year and not be expecting a quick return to normal levels. And I was asked by my GYN dr to consult with an endocrinologist after my BMD is still suboptimal which I tried to carry out, but UTSW /Dallas said they would contact me when they got the referral, and my Dr's office said they sent the referral, yada, yada, So I just dropped OUT of THAT loop. And I really don't think an ENDO dr consult is Necessary. I am doing fine, I just have to be more patient with my bone density improvement, 4%/year. And I am so grateful, someone like bonebabe, who apparently knows more @bones density testing than my GYN dr, agrees that bone matrix increase is a slow process and if you are not having any FXs, basically, that is the goal! Makes me happy. :) :) :) peace, out.","resp_content":"Reply\nbonebabe\nover 1 year ago\nI'm glad I could help you out. And, yes, fracture is the goal. Also, please understand that there is no osteopenia/osteoporosis range. If you have one T-score that is -2.5 or greater or you've had a nonviolent fracture, you have osteoporosis. Also your bone density will never return to normal. That should not be an expectation. You can and should, expect your bones to strengthen due to medication, calcium and exercise, but don't be looking for a normal reading. If you do get one, it is either one of two things - arthritis or incompetent testing.\n\nI also agree, at this point, you probably don't need to see an endo. I would caution you about weight lifting though. Anything more than 10 lbs is not recommended. Also please, please keep your back straight. Weight lifting is not what we consider to be weight bearing. So many people get that confused. Weight bearing (recommended) is what you do while on your feet. Walking is optimal.\n\nI wish a healthy and fracture free new year for you!\nReply\ndja1953\nover 1 year ago\nOk, thanks. and there are no nationally accredited DXA centers in TEXAS, wow. Good to know. I have been told by the drs from the Norman parathyroid center to my face as I was their patient in Tampa, FL in 2017, that my bone density can return to normal, so I will keep my hopes up. I was not warned to refrain from weight lifting and I have been doing it for years. I am not a weak person, my bones were weakened by my hyperparathyroid DZ, which I do not have any more. I will report my next BMD score / change in 2019 so truth will be tracked!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/48130/re-low-bone-density-from-jane-age-65"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Osteoporosis","post_content":"I have had osteoporosis for about 10 years was diagnosed after I fractured my spine from trying to keep my mother in law from falling. I lived a healthy lifestyle or at least I thought. However I did learn I was at a greater risk because I had a hysterectomy at the age of 27 due to bleeding problems with my period and went through menopause early. I couldn't take hormones due to risk of breast cancer. But I was at a greater risk because my mom broke both her hips which is something my rheumatologist used to get my risk factor, going through menopause early, plus the fact that I had fractured spine. If you decide to take meds be careful taking fosamax because if on it for more than 5 years can cause spontaneous fractured of the femoral bone. I am currently taking forte but can only take for 2 years daily injections that help rebuild bone. Good luck no matter what you are told I'm a disabled nurse and have been told there is no cure. Just live as healthy as possible but you don't build bone after the age of 35 unfortunately. Make sure that even after starting meds have DEXA SCAN repeated every 3 years as possible per my doctor recommend.","like_count":"1","tags":[]},"responses":[{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: Osteoporosis","resp_content":"Yes, unfortunately years ago we didn't have the info on osteoporosis that we now have. So much could've been done to prevent it. Do you know it is now classified as a pediatric illness that manifests later in life? That's because the age at which we reach our peak bone mass has been lowered to 21! due to changes in lifestyles of the young. Less dairy, smoking, hardly any PE classes anymore and staying indoors doing video games instead of playing outside.\n\nIn reference to your concern about spontaneous femoral fractures due to bisphosphonate use - that study is from a group in New Zealand who's made it their life mission to undercut the use of medications that can reduce your risk of fracture. It was not a controlled study and is not accepted as bona fide by healthcare professionals. It does make the rounds on the internet, however.\n\nThe 5 year use of bisphosphonates is also something that has been arbitrarily selected due to public concern arising from internet stories/fake news :) These meds stay in your system 10 years. Studies are going on now as to how long you can safely take them. They are still relatively new and because of the 10 year half life, it takes a while for studies to be complete.\n\nWhat our medical director recommends if there is concern, is IF your bone density test results are stable after 5 years - that means staying the same or no significant decrease (significant being defined as the LSC - lowest significant change - based on the machine's precision study results) try going off.\n\nAfter 2 years, have another DXA. Insurances pay for them every 2 years. If your results are still stable, continue what you're doing. However, if there's a significant decrease (again based on the LSC, NOT the T-score) go back on the medication and don't even consider going off again. Your risk of having an osteoporotic fracture is much higher than any possible side effects of a medication.\n\nAlso remember to take in 1200 mg of calcium a day in diet and supplements or any medication won't work effectively. 600 mg at lunch and 600 at supper.\n1\n"},{"author":"carolynem","resp_time":"over 1 year ago","resp_title":"I have been doing extensive reading on osteoporosis, as well as speaking with my friends. Here is what I have found:","resp_content":"The two friends taking bisphosphonates have had serious side effects. One, had trouble swallowing. It kept her up all night. She subsequently started drooling. This was after several months of taking Actonel. The doctor took her off of it. The other, developed jaw problems. Both have discontinued these meds.\n\nAfter reading about the fact that this is a normal part of aging...except in countries who do not seem to make animal protein a part of their diet...many doctors recommend walking, taking tums for calcium, getting out in the sun and take vitamin D and eating plenty of beans, seeds, dark leafy vegetables and staying away from animal protein.\n\nI am in the insurance field and let me tell you, the people I see who take medications for one thing after another look the sickest and can barely move. The people who tend to be holistic about their bodies and the ails that develop look healthy and seem vigorous.\nReply\nbonebabe\nover 1 year ago\nCarolynem, I wish you health and strong bones. I hope your genetic makeup is such that your bones will support you for life as you're taking a lot of risks. Osteoporosis is not a normal part of aging,nor are all meds bad for you. They save lives. Did you know from your reading that 1 out of 2 women over the age of 50 will have a nonviolent fracture (which gives them an automatic diagnosis of osteoporosis), that half of those who fracture a hip will die within a year of that fracture? Something to think about. Also after age 50, our bodies don't make enough Vit D from the sunlight unless you live near the equator. You need a supplement. Tums are good for calcium. The body will only absorb about 500-600 mg. Anything more is excreted in the urine. You need 1200 mg a day.\n\nI hope you don't decide later on that you should've taken a medication and were afraid to because of conversations with friends or unverified news articles. Bone that is lost is not recovered. By age 30, you have all the bone you're going to have. You need to preserve it. Medications, when needed, do that.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/50677/osteoporosis"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Is it safe to get pregnant with osteoporosis?","post_content":"Hi, I'm a 29 yrs old woman with osteoporosis and I was diagnosed at the age of 21. My t-score is -3.4. Is it safe for me to get pregnant with my condition? Will I be able to carry the baby full term?","like_count":"0","tags":["Bone Density","Living & Managing"]},"responses":[{"author":"anonymousa","resp_time":"over 1 year ago","resp_title":"RE: Is it safe to get pregnant with osteoporosis?","resp_content":"Hello, I am a 22 year old female with the same condition and a T-score of -3.3. I was diagnosed back in February of 2018 and I have had the same question ever since, however none of the doctors I've been to seem to know. If you happen to come across the answer, I would also like to know.\n"},{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: Is it safe to get pregnant with osteoporosis?","resp_content":"At 29, you'd look at z-scores, not T-scores, but with your numbers, the Z-score won't be much better. Why did you have a bone density test? Diagnosing someone your age is tricky because true bone loss would most likely be due to an underlying condition. Ex: ulcerative colitis or some other inflammatory illness that necessitated long term prednisone treatment. Most people your age test low because they haven't formed all the bone they'll eventually have.\n\nAs for pregnancy....No way will I say yes or no. I will say that if you truly have weak and porous bones, being pregnant AND raising a child will greatly increase your risk of having a life altering fracture. Also osteoporosis medications are not recommended for women considering pregnancy. No data that I'm aware of, is known for birth defects.\n\nAll in all, I'd say talk to an osteoporosis expert about this, verify that you truly have osteoporosis (although that diagnosis isn't given to women who haven't gone through menopause) and, if it's so, consider another route to having children.\n\nIf you do have children, I'd strongly suggest that you have some physical therapy for balance and ADL's (activities of daily living.) You'll need to know what movements to avoid and to do. For instance - even now - NEVER bend forward at the waist or side to side twisting of the spine. If you pick up anything more than 10 lbs, hold it close to your chest. Wear a backup instead of carrying a purse - this naturally aligns the spine and leaves the hands free to break a fall and hopefully avoid breaking a hip.\n\nGo to the NOF website - national osteoporosis foundation - www.nof.org, for a lot of good information.\n\nI hope what little I've relayed to you is helpful.\n1\n"},{"author":"tealcoral","resp_time":"over 1 year ago","resp_title":"bonebabe: great information here!","resp_content":""},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Is it safe to get pregnant with osteoporosis?","resp_content":"At the she of 12 I was diagnosed with osteoporosis. I've broken/fractured well over 13 different bones. I feel as if my bones have become rearranged inside to where I'm starting to look as deformed as I feel. Has anyone been diagnosed that young and can share with me how they survived though the pain and challenges this kind of life gives you? With each new injury I become even more discouraged about living a normal life.\n"},{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"So sorry to hear this. As I said above, premenopausal women are not given the diagnosis of osteoporosis. If you were diagnosed at age 12, it's most likely due to another condition with osteoporosis as secondary to that - like Rheumatoid Arthritis. You don't say how old you are now, but if you're postmenopausal (either surgical menopause or no period for a year) I'd talk to my doctor about taking Forteo. It's a treatment of 2 year daily injections of the parathyroid hormone. To date, it's the only drug that actually grows new bone. After 2 years, you'd go on a drug like Boniva, Prolia, Fosamax or Actonel to strengthen the new bone.","resp_content":"\nSo much to say.....if you are unaware or haven't been tested for a primary cause of bone loss, that should be done. Until that issue is addressed, you're putting a band aid on the osteoporosis.\n\nAlso it is critical that you consume 1200 mg of calcium each day. Because the body only consumes 600 mg at a time, do this twice a day. Read your labels carefully. The dose on some supplements is 2 pills (calcium citrates) or 1 pill for calcium carbonate. There is no good or bad calcium. Higher cost or health food store isn't any more effective than Tums. Get a supplement with Vit D. Best absorbed with food. I take mine at lunch and supper.\n\nWith a fracture history it is very important that you avoid falls, never bend forward at the waist or twist side to side. Best exercise for you is walking. At least 30 minutes 3x/day. No sports. Also wearing a backpack would be good so that your hands are freed up in case of falls.\n\nI'd recommend you go to the NOF website (www.nof.org) for illustrations on body movements to do and avoid. A wealth of information for you. Also a good Q&A section.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/57558/is-it-safe-to-get-pregnant-with-osteoporosis"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Osteoporosis","post_content":"At the she of 12 I was diagnosed with osteoporosis. I've broken/fractured well over 13 different bones. I feel as if my bones have become rearranged inside to where I'm starting to look as deformed as I feel. Has anyone been diagnosed that young and can share with me how they survived though the pain and challenges this kind of life gives you? With each new injury I become even more discouraged about living a normal life.","like_count":"0","tags":["Living & Managing","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/80020/osteoporosis"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"grateful","post_content":"God is be really good to me in my life, before people said there is no cure for Herpes, but today many people have now believe that there is a cure FOR HERPES can be cured through Africans root and herbs, our great doctors have finally found the cure of Herpes, many have get cured with the help of a great spell caster known as Dr.usman he's the one of the great spell herbal doctor in Africa and he has the cure on this disease H.P.V/TYPE 4 TYPE 1 TYPE 8 AND TYPE 10. TYPE 913, human papilomavirus, genital warts, herpes, syphilis, cancer, hepatitis a b and c. high blood pressures, body disease, diabetics, epilepsy, HIV aids, pregnancy,ALS and parkinsons disease many difference kinds of diseases, last month he share is Herbal medicine in some medical hospital and now he is well recognize as one of the best spell caster in Africa, you don't have to be sad any more or share your tears any more on this disease when the cure have already be found. in 2009 the total number of people living with H.P.V was 13.8 million but today the total number is now 2.0 million, if you want to get in touch with him in private contact him on his whatsapp No.+2348064080208,or Email:dr.usmanspellcaster@gmail.com","like_count":"0","tags":["Exercise","Bone Density","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: grateful","resp_content":"Don't hide your problems, because the Proverbs says \"problem share is a problem solve\" contact dr.usman on No.+2348064080208,or Email:dr.usmanspellcaster@gmail.com\nfor..... dr.usman HERBALIST AND NATIVE DOCTOR. Life is too short for you to be poor.... You deserve a comfortable life.... We will make your dreams come true.\nOnly the wise will make money in life. We will give you powers to control the wealth.\nCALL THIS NUMBER IF YOUR PROBLEMS TO BE SOLVE:: +2348064080208\nGet your lover back,\nFruit of the womb,\nBusiness boom,\nFinancial breakthrough,\nGet rich without ritual,\nDo as i say,\nBad Dream,\nPromise and fail,\nEpilepsy,\nFibroids,\nSpiritual attacks,\nLand/court case,\nMental disorder,\nPolitical, appointment, visa approval,\nCancer,\nExamination success,\nSpend and get back,\nGood luck,\nNatural health,\nCharm,\nHypertension,\nDiabetes(diabetic+obesity)\nStroke,\nHIV AIDS\nStomach ulcers,\nInfections,\nTuberculosis,\nImpotency,\nPromotion at work,\nCommanding tone,\nProtection,\nMarriage success,\nLove ring,\nFavour ring,\nRecover lost glory.\nor contact him on whatsapp No.+23480c64080208,or Email:dr.usmanspellcaster@gmail.com\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/79074/grateful"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Multiple compression fractures","post_content":"I have recently been diagnosed with severe osteoporosis with 7 compression vertebral fractures within an eight week period. I am post menopausal but also a long time user of prednisone. I’ve been on Forteo for five weeks. How long does it take to hope for bone strengthening since on this med.","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/75150/multiple-compression-fractures"},{"post":{"author":"shackadelic","post_time":"over 1 year ago","post_title":"Looking for cervical spine MRI feedback","post_content":"Cervical Spine MRI Results\n\nBackground: Severe neck pain, numbness in arms and hands, I get what I call neck headaches. I've already had back fusion 360 surgery (in 2010).\n\nMRI Results\nFindings: There is straightening of the normal cervical lordois, which may be seen with positioning or muscle spasm. Modic Type I and Type II endplate changes at C4-C5. \n\nC2-3: No significant findings.\n\nC3-4: Disc desiccation with severe disc narrowing. Moderate uncovertebral spurring and mild facet hypertrophy. 2mm disc osteophyte complex with mild spinal canal stenosis and moderate bilateral neural foraminal stenosis. Residual AP diameter the thecal sac is 8.9mm.\n\nC4-5: Disc desiccation with severe disc narrowing. Moderate uncovertebral spurring and mild facet hypertrophy. Posterior disc osteophyte complex and broad-based left paracentral disk protrusion with associated osteophytic spurring. This measures up to 3.5mm in AP. Material contacts and flattens the left ventral contour of the spinal cord. Moderate to severe spinal canal stenosis with reidual AP diameter the thecal sac measuring 6.8mm. Severe left and moderate right neural foraminal stenosis.\n\nC5-6: Disc desiccation with moderate disc narrowing. Posterior disc osteophyte complex with broad-based left paracentral disc protrusion measuring 3mm in AP extent. Moderate spinal canal stenosis with residual AP diameter the thecal sac measuring 7.2mm. Severe left and moderate right neural foraminal stenosis.\n\nC6-7: Disc dessication with moderate disc narrowing. Mild uncovertebral spurring and mild facet hypertrophy. 2.5mm disc osteophyte complex with mild spinal canal stenosis and moderate bilateral neural foraminal stenosis. Residual AP diameter the thecal sac is 8.9mm.\n\nC7-T1: Mild facet hypertrophy. No stenosis.\n\nIMPRESSION:\n1. Advanced multilevel spondylitic and facet degenerative changes throughout the cervical spine. The findings are most pronounced at C4-5 where there are moderate to severe spinal canal stenosis, severe left neural foraminal stenosis, and moderate right neural foraminal stenosis.\n2. Other levels as detailed above.","like_count":"0","tags":["Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/71322/looking-for-cervical-spine-mri-feedback"},{"post":{"author":"staceytstreasures","post_time":"over 1 year ago","post_title":"looking for feedback for MRI results","post_content":"these are the impression notes of my Ankle MRI yesterday.\nI got to see my Dr on Tuesday the 23rd. Any opinions would be appreciated.\n\nsubtalar impingement as suggested by subcortical cyst at teh angle of gissane\n\nearly split tear of the peroneous brevis tendon\nchronic full thickness tear of the anterior talofibular ligament\nchronic sprain of the calcaneofibular ligament\nfull thickness articular cartilage defects in the tibiotalar joint\nimaging findings suggestive of subtalar impingement\nthank you\nStacey","like_count":"0","tags":["Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/69240/looking-for-feedback-for-mri-results"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"Boniva","post_content":"I have a boniva pill to take once a month but I have read some bad side effects. I was wondering if anyone is taking it and if they have any problems with it.\nThank you!","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/64305/boniva"},{"post":{"author":"GIGI100806","post_time":"over 1 year ago","post_title":"FORTEO","post_content":"Has anyone else taken the daily Forteo injecctions?","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/61813/forteo"},{"post":{"author":"tremmy","post_time":"over 1 year ago","post_title":"HAS ANYONE TAKEN PROLIA","post_content":"My mom is 78, has had osteo for 20+ yrs. She takes D3 & calcium & tests have been o.k but last year it show great loss. She saw an Endocrinologist & she wants her to go on Prolia (says she is at VERY high risk of fracture). She is very afraid of the side affects. When she was first diagnosed she went on one of the daily Rx but stopped because of side affects. It is so hard to decide what to do? I would love to hear from anyone good or bad that have taken it.","like_count":"1","tags":["Bone Density","Living & Managing","Treatment","Diagnosis"]},"responses":[{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: HAS ANYONE TAKEN PROLIA","resp_content":"If your mom is at high risk for fracture and her doctor wants her to take a medication, take it. The resulting life altering effects of a fracture are much much worse than any possible side effect she'd have from an RX. Prolia is a good medication. All the osteo drugs are. Sometimes you just have to try more than one to get a good fit. Go on the National Osteoporosis Foundation website, www.nor.org, for a lot of information on and comparison of all the available drugs. There's also an excellent Q&A section. Don't be afraid. Once you fracture, there are no do-overs.\n2\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/57286/has-anyone-taken-prolia"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"TScore -3.7","post_content":"My T-Score is -3.7 in my lumber spine and slightly better in my hips. I am extremely sensitive to all kinds of drugs - I am one of that handful of people the drugs ads talk about in their warnings of dire reactions. I am seeing an endocrinologist in two weeks to discuss options. Any advice?","like_count":"1","tags":["Treatment"]},"responses":[{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: TScore -3.7","resp_content":"I assume by now you've seen the endo. As you only reported your T-score, I can't really assess your situation. Age? Menopause? Hormone therapy? Fractures? Family history of hip fracture? Drink more than 3 alcoholic drinks a day? Prednisone use for more than 12 weeks? On your feet less than 4 hours a day? What you're looking for is your risk for fracturing. All of these questions indicate a risk. When evaluated, along with your T-score, your doctor can recommend a treatment plan. That said - I would predict that you would be put on a medication with a T-score of -3.7.\n\nIf so, be sure to get 1200 mg of calcium each day. Take 600 mg at lunch and 600 mg at supper. Also 1000 IU of Vit D. The medication you take needs these \"helpers\" to work.\n\nAlso walk at least 1/2 hour a day 3x/week. No running. No bending forward at the waist or side to side twisting of the spine.\n\nThe National Osteoporosis Foundation (www.nof.org) has a wonderful website with all kinds of good verified information.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/55484/tscore--3-7"},{"post":{"author":"jennysu1","post_time":"over 1 year ago","post_title":"Comfy shoes for borderline osteoporosis","post_content":"I just want to share about some fabulous shoes I found for serious walking, even with my borderline osteoporosis. My last Tcell count was -2.5. I am age 64 and weigh 115lbs. I had 3 metatarsal stress fractures (both feet involved) in the 4 years leading up to this diagnosis, each episode caused just by walking too many hours in the mall or on pavement in medium-supportive shoes (Skechers and others).\n\nI was scared to death to go on an 8-day London vacation this past June, which was to include a lot of walking. First I packed my giant orthopedic boot, which took up a third of my suitcase (I didn't want to be shopping for one in London while in extreme pain from a broken foot). Then I tried on an entire store full of women's \"walking\" shoes, also many other expensive walking shoes in other stores, with and without various inserted arch supports. I didn't find anything any better than my existing walking shoes with added arch support which, while comfortable enough just for standing, always made the metatarsal area of my feet feel dangerously achy-breaky after any serious walking.\n\nLong story short: the dream shoes I finally found are Hoka One One brand running shoes, their model called Clifton 4. They have the most marshmallow-cushy sole I've ever felt, with a slightly rounded rocker-like bottom surface that prevents the \"slap-down\" motion of the front part of my foot that happened when I walked in all those other shoes. But most noticeable was the unique amount of extra cushion precisely under my metatarsal bones, that I had felt in no other shoe I tried on. I bought them in a half-size larger than my street shoes, in Wide width that gave my toes plenty of room to stretch out side to side and up and down. I laced them very loose over the metatarsal area, and tight at the top to prevent slipping on the heel. The shoestrings stayed loose and tight where I needed them to. I walked my legs off in London, and felt like I was bounding along the whole time. At the end of a day, my leg muscles were sore from more walking than I'm used to, but my actual feet were not sore at all. And that has NEVER happened to me. These shoes are literally worth their weight in gold!\n\nSo if you're in my boat, I recommend looking in shoe stores dedicated to serious runners. I've read there are other runners' brands now offering the same sort of extra cushion and rocker motion.","like_count":"2","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/56972/comfy-shoes-for-borderline-osteoporosis"},{"post":{"author":"mafasa73","post_time":"over 1 year ago","post_title":"Foot pain","post_content":"I have severe pain on bottom of my foot by my last 3 toes. It usually flairs up when I am barefoot on tile, wood floors. Sometimes it gets to where I can’t hardly walk on foot. What is this and any solutions to help treat it?","like_count":"0","tags":["Symptoms","Treatment"]},"responses":[{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: Foot pain","resp_content":"Sounds like Plantar Fasciitis. Stretching the calf and muscle will help. Google it and see what info you can get.\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Foot pain","resp_content":"AFTER SUFFERING WITH JOINT PAINS FOR MANY YEARS AFTER MY TIME IN THE SERVICE MY DAUGHTER RECOMMENDED THIS PRODUCT TO ME AND ITS BEEN A GOD SEND . I CANT DESCRIBE HOW THANKFUL I AM TO HAVE FOUND A SOLUTION , IF YOUR STORY IS ANYTHING LIKE MINE YOU OWE IT TO YOURSELF TO ATLEAST CHECK THIS HEAVENLY PRODUCT OUT\n<< https://bit.ly/2KSQpak >>> CHECK IT OUT NOW !!!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/50911/foot-pain"},{"post":{"author":"rmkrevitz","post_time":"over 1 year ago","post_title":"Reclast or Prolia? Have to decide in the next few days....help!","post_content":"Hi there, I am 54 years old and was diagnosed with Osteoporosis 3 1/2 years ago. I didn't take any meds (I was afraid) for the first year, then I took Evista for 2 years. I recently had a second dexascan and my numbers did not improve and some got a bit worse. My Gyno sent me to a Rheumatologist and this doctor suggested discontinuing the Evista and instead taking Reclast or Prolia. I have severe acid reflux and cannot take any of the other oral drugs. My T scores for my last scan were Lumbar - 2.1, Proximal femur - 2.7, Right femoral neck - 2.9. I am active and otherwise healthy. I am reading all about both drugs and could use some help deciding on which is best for me. One thing that concerns me is that, if I have some severe side effects, I have this drug in my system for 1 year. What happens if I want to taper off? How do you do that with a transfusion or injection? Since Prolia is newer, does anyone have any concerns for long-term effects? Any advice is greatly appreciated!","like_count":"2","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: Reclast or Prolia? Have to decide in the next few days....help!","resp_content":"Hello. I've been on the Prolia injections for 3 yrs, (every 6 mo.). My #'s are improving and no noticeble side effects. All that's needed is a blood test beforehand, to make sure vit D and calcium levels are up.\nHope that helps.\n2\n"},{"author":"bonebabe","resp_time":"over 1 year ago","resp_title":"RE: Reclast or Prolia? Have to decide in the next few days....help!","resp_content":"Both are good drugs. It's really up to you which one you'd rather do. They work differently, but are effective in reducing your chances of fracturing. You're awfully young to have been diagnosed with osteoporosis. Did your doctor determine why? Did you have an early menopause without hormone replacement? Do you have a family history of hip fractures? Do you have an illness that requires regular prednisone treatment? Have you fractured a bone (from a standing position)? Whichever RX you take, it is imperative that you consume 1200 mg of calcium each day in order for the RX to work effectively. The body can only absorb about 600 mg at a time, so spread it out. We usually suggest that out patients take a supplement at lunch and at supper - 600 mg each. Also walk - at least 30 minutes a day, 3x/week. Don't sweat the side effects so much. I can guarantee you that any side effects you MIGHT have from a medication pale in comparison to side effects from an osteoporotic fracture.\n2\n"},{"author":"rmkrevitz","resp_time":"over 1 year ago","resp_title":"Thanks for your replies! I ended up rescheduling my injection appointment to give me time to get my calcium and vit. D checked. Waiting for those results now. I think I'm going to go with the Prolia, since my insurance approved it. As for the reason for this, I have no idea. I am very small boned and have always been thin, but not anorexic of anything like that. Menopause at 47, no hormone replacement, lactose intolerant so not much dairy in my diet. Nobody in my family has osteoporosis or hip fractures, including my 82 year old mother. Never broke a bone, standing or otherwise. No prednisone for more than 5 days at a time, just a few times in my life. No thyroid issues. I have arthritis too, in my neck/spine, hip and toe. I have always been quite active, and I walk all the time. Not sure where this came from, and wonder if I have some underlying, undiagnosed, condition that caused the arthritis and osteoporosis.","resp_content":"Reply\nbonebabe\nover 1 year ago\nWell, of course, go with what the insurance will pay! Good to have Vit D levels checked. Most everybody over 50 is low because the body doesn't turn the sunlight into Vit D as easily as it did when we were young :( As for blood calcium levels - don't use them to determine if you need a calcium supplement. You do. The body does not make its own calcium. It only has what you put in. If there's not enough in the blood to take it to the areas of the body that need it (for blood pressure, heart regulation, wound healing, etc) it will take it from the bones. Having a normal or even high blood calcium level doesn't tell us how much is in your bones. Replace it!\n\nMenopause at 47 with no hormone replacement will certainly decrease your bone density. In fact, the 5 years leading into and through menopause can cause us to lose 20% of our bone mass. So, if you never really built up your bone mass during your bone forming years and then went through menopause with cushion of HRT, yes, that could put you into the low bone density area.\n\nSo take your Prolia, get your calcium and 1000 IU of Vit D. We prefer our patients to get as much calcium from diet as possible and then supplement with, duh, supplements. Remembering that you can only absorb 500-600 mg at a time, read your food labels carefully. Usually the calcium content is given in %. When you see that, drop the % and add a 0. Ex: 25% = 250 mg. See what a serving is and calculate from there. As for supplements, there are no calciums that are better than others. Don't be spending a lot of $$ in a health food store or online. It's a mineral and isn't broken down. Tums and a multivitamin are even fine. When looking for a supplement, there are two kinds - calcium citrate and calcium carbonate. Look at the dose. Calcium carbonate is denser than calcium citrate. Usually a dose is one pill. Calcium carbonate is usually 2 pills. So you'd need 4 a day if that's all the calcium you were getting. Calcium citrate is what we recommend for our patients who have tummy issues, such as gas and/or constipation.\n\nAs for your activites - be careful not to bend forward at the waist or twist your spine side to side. This can cause the tiny struts within the vertebra to break. You don't feel this until there aren't enough to hold the vertebra upright and it collapses. That's a compression fracture and there's no do-over.\n\nFor a lot more information and an side by side comparison of the osteo drugs, go to the National Osteoporosis Foundation website. www.nof.org\n\nThey also have a list of foods that naturally contain calcium in addition to illustrations of move to make and to avoid.\n\nWishing you well!\n2\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/53753/reclast-or-prolia-have-to-decide-in-the-next-few-days-help"},{"post":{"author":"phoebe44","post_time":"over 1 year ago","post_title":"Osteoarthritis of back and knee","post_content":"I have osteoarthritis where one lumber vertebra slipped forward over another and the disc is bulging. I have osteo of the knee and doctor wants to do knee surgery. So far I've managed without surgery. I also have fibromyalgia. I am going to see another specialist in May for an injection in the lumbar region of the spine. My question is: I just don't have the umph to do my regular daily chores. I may get one or two done, but that's about it. I'm on thyroid med, low dose of high blood pressure med, cymbalta for fibro, and cholesterol med. My blood tests are good. I have motrin for pain. Do you find that the pain of osteoarthritis zaps your normal energy?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/50312/osteoarthritis-of-back-and-knee"},{"post":{"author":"tyler1994","post_time":"over 2 years ago","post_title":"Landed on foot","post_content":"Long story short I was sneaking out of my house, hopped a 6 foot fence and landed on my ankle in a twisted position. What does this look like, a sprained ankle? Or should I be concerned and seek medical attention. I got good insurance but don't want to seek help if unnecessary. Thanks","like_count":"0","tags":[]},"responses":[{"author":"tyler1994","resp_time":"over 2 years ago","resp_title":"RE: Landed on foot","resp_content":"Picture of injury : http://tinypic.com/r/2en2dqd/9\n"},{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"tyler1994: In my opinion, I think you should, just in case.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/39444/landed-on-foot"},{"post":{"author":"sewwanju","post_time":"over 2 years ago","post_title":"Osteopetrosis tarda??","post_content":"Im a radiography student and came across this radiograph (which is not taken by me), had a hard time resolving what this bone disease is.\nany ideas, except the inguinal scrotal hernia?","like_count":"0","tags":["Bone Density"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/42146/osteopetrosis-tarda"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Osteoporosis and Hypothyroidism","post_content":"I've been living with Hypothyroidism since the 80's. I'm 56 now and have now developed a torn rotator cuff and bone separation in my shoulders and wrist. My doctor suggested surgery replacement for the shoulder and\ninjections for my wrist. I feel I'm doomed to a life of pain. Are there any options.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/40427/osteoporosis-and-hypothyroidism"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"What is wrong with my pinky toe","post_content":"I have had this horn shaped hardness on the end of my toe now for a year. I have tried everything but surgery to remove it. I have no clue what it is can someone please tell me. It hurts it is big and pointy and hard.","like_count":"0","tags":["Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/40028/what-is-wrong-with-my-pinky-toe"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Orthopeadic question","post_content":"My question is my grandfather has tripped and suffered a fracture in the pelvis which is he's suffering cause its too painful and his toe is already numb and squishy can feel them but he can feel the other parts except his toe which is already swollen","like_count":"0","tags":["Exercise","Bone Density","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Orthopeadic question","resp_content":"I mean he cant feel his toe but other areas are fine but his suffering in his pelvis injury cause it hurts\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/36527/orthopeadic-question"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Dexa bone density scan and VFA, 2 spinal compression fractures","post_content":"I am 60 yo, post-menopausal woman. Long time RA (possible AS?) patient and long time prednisone user, plus lung cancer survivor. Had a bone density scan and results were osteopenia (-0.9, -2.1, -1.1 for total femur mean, femur hip, and AP spine). The tech said I was a candidate for the new VFA and it showed two fractures - grade I in T5 and grade II in T6. I have had neck, back and hip pain for more than a year. Cervical MRI done 9 mos ago showed bone spurs and compression in C5-6 and C6-7. I am worried about the spine fractures. Any advice?","like_count":"1","tags":["Bone Density","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/35675/dexa-bone-density-scan-and-vfa-2-spinal-compression-fractures"},{"post":{"author":"kallisto","post_time":"over 3 years ago","post_title":"Age 51, T score -5.5","post_content":"I just got my dead scan results and my t score is -5.5 for both hip and spine. Now what? I had a sever reaction to fosamax years ago and have tried forteo also years ago. I'm afraid to even move. Running and fitness was always my passion. Now I'm afraid I'm going to crumble. Help? Thanks in advance.","like_count":"0","tags":["Bone Density"]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Age 51, T score -5.5","resp_content":"While your score is low, it's not as bad for a 51 year old as it would be for someone older.\n\nHave you gone through menopause? A score that low is extremely unusual for someone your age. Has your doctor examined you for a reason for this? Maybe hyperparathyroidism or prednisone use for an inflammatory illness? Seizure meds?\n\nYou certainly need to be on a medication. How long were you on Forteo? That is the big guns of osteo medications. It's normally given for 2 years then followed by a bisphosphonate to strengthen your new bone.\n\nWhen taking a medication, it's very important to consume 1200 mg of calcium or the medicine won't work. Don't take more than 600 mg at a time. Anything more than that will be excreted in your urine.\n\nNo running. It pounds the spine and can cause vertebral fractures. Avoid bending forward at the waist or any twisting of the spine. Walking is excellent.\n\nGo to the NOF (National Osteoporosis Foundation) website now to see illustrations of moves/exercises to make and to avoid. www.nof.org.\n\nIf you haven't had your Vit D levels checked, ask your doctor about that.\n\nIf you haven't fractured, that's good news. It's entirely possible that you live your whole life without breaking a bone. You have time to get into a good routine.\n\nYou might also want to consider some physical therapy for ADL's. That's Activities for Daily Living. It will help immensely with your day to day routine to avoid fracturing.\n2\n"},{"author":"kallisto","resp_time":"over 3 years ago","resp_title":"I took Forteo for two years. They said I couldn't take it any longer than that. I feel like I have been handed a death sentence. I had a total hysterectomy just last year and had not been in menopause before that. I'm afraid to breathe or I might crumble. Running was my passion. My doctors have not been the least bit interested in this. A year ago my score was only -3.2 and even that was horrible. I appreciate your response and I like the idea for physical therapy for ADL. They just started me on a vitamin d this week.","resp_content":"Reply\nnikschagtown\nover 2 years ago\nHi Kallisto,\nI am 65 and just received my results from a recent scan and I feel the way you do. I'm scared to death. I'm doing a lot of research and putting a journal together of all the things I need to do.\nOne thing that I might suggest to you is to get a book, \"The whole-Body Approach to Osteoporosis\", by R. Keith McCormick, DC. He is a chiropractor who was an athlete and at the age of 45 was diagnosed with severe osteoporosis. His T-scores were-4.3 with multiple fractures. He was on a mission and put this book together as a manual to help others. It is very good and has a tremendous amount of helpful information. Hope this helps.\nReply\nmariajasminefreeman\nover 2 years ago\nJust a small note to add to bonebabe. Remember, intake of vitaminK is v crucial in bone health, and an intricate balance between vit K and vitaminD allows for prevention of osteoporosis. In fact recent findings reveal increased fracture risk in the elderly with v high vitD doses, and increased cardiovascular risk with v high calcium intake.\nVitaminK-rich foods are green and cruciferous vegetables; eat a lot of those, and of corn as well.\nMaria Jasmine Freeman.\nReply\nbgillis\nover 2 years ago\nThank you for your comments. I eat many vegs...all my blood numbers are perfect. I live in a CCRC in a villa...most here have issues. My father lived until he was 97. I am planning the same!\n"},{"author":"bgillis","resp_time":"over 2 years ago","resp_title":"RE: Age 51, T score -5.5","resp_content":"I am 77 with severe osteo (supposedly). I, too, took Fosamax for a couple of years with no results, so I dropped it (a good thing!) I continue with my life, not looking back. Have never fractured...my tests have always been in the 4s. I have tripped while walking with no results...just got up! I take no pills...have great health...thin...now 102, 5'2\". Walk 5 miles daily along with other exercises. Hope when I die that I have the same regime! Never want to stop! Ran for 15 yrs, 43 mi wk. Miss that but had an injury that wouldn't go away. Walking daily for almost 30 yrs! No health issues. KEEP MOVING IS MY PHILOSOPHY!\n"},{"author":"kat2017","resp_time":"over 2 years ago","resp_title":"I am 60 with hip t-score = -2.6. It was -2.5 in 2014 and had been deteriorating rapidly since 2010. I have been taking Calcium, D, & Strontium Nitrate for the past 1 year and hope it is helping. I started taking supplements after a leg stress fracture in 2016. I too was a runner; but only 6-10 miles a week. I recovered quickly (6 weeks) and went back to running. I continued horseback riding while I had the stress fracture (I was allowed to remove my boot for none weight bearing activity). 9 months later I fell off a horse and broke my arm. Again, I healed quickly; so even with osteo, bones can heal. I agree that staying active is the key. I also gave up diet soda 2 years ago. I have heard we can reverse this condition and am trying everything!","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/1274/age-51-t-score--5-5"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"osteoporosis information","post_content":"I have been diagnosed with very severe Osteoporosis 20 years ago and now that I am post menopausal it is getting worse (6.2) if that is even possible. I had for the first time 2 fractures last year which was devastating. I have declined meds and Forteo because of my medication sensitivities and fear since it is black boxed for causing cancer in mice after two years. My family is riddled with cancer and I did not want to take any chances.\nI recently heard about a new option for exercise using what is called a\nBio Density machine to increase bone mass for patients with Osteoporosis along with power plates. Can you tell me if this might be helpful for me.\n\nThank you","like_count":"0","tags":[]},"responses":[{"author":"jalexandersimmons","resp_time":"over 2 years ago","resp_title":"RE: osteoporosis information","resp_content":"BioDensity does allow you to use compressive forces strong and safe enough to increase bone density effectively. For individuals that comply with recommended usage, the success right I have seen is greater than 95%. We have used BioDensity for 6 years and helped hundreds of people successfully treat osteoporosis: www.wholebodysystems.com\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/32929/osteoporosis-information"},{"post":{"author":"dianerio","post_time":"over 2 years ago","post_title":"Bone density","post_content":"What are the benefits or drawbacks to a 90-year-old female with no history of osteopenia or osteoporosis having a bone density test? Or would a test be recommended at this age?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/33983/bone-density"},{"post":{"author":"nikschagtown","post_time":"over 2 years ago","post_title":"Osteoporosis","post_content":"I recently had a bone scan and have full blown osteoporosis. I've been trying to read a great deal. It is very scary because I don't think there is truly a good treatment for it. I am about to make an appointment with an endocrinologist to see what they have to say. A few years ago a doctor wanted me to take Forteo but I refused but now my T scores are worse and I am at high risk for fractures.\nAny information would be helpful if you are willing.","like_count":"1","tags":[]},"responses":[{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: Osteoporosis","resp_content":"How old are you? Have you gone through menopause? What were your numbers? Have you fractured a bone? All these will play into how severe your osteoporosis is. Why did you refuse Forteo? It is normally given only to those people with the most fragile of bones and the highest risk of fracture. Without RX intervention, your risks for fracturing will only increase. If the endo doesn't suggest a medication, you bring up the subject. Do not avoid it because of something you read about side effects. It sounds like your chances of having a life altering fracture are much greater than any possible side effect you'd have from a drug. Everything you put into your body has the possibility of side effects. You have to weigh your risks for fracture against anything a medication might cause.\n\nIn the meantime, do avoid any forward bending or side to side movements of the waist. Walking would be your best exercise - at least 3x/week. Also you need calcium - 1200 mg/day taken in 600 mg increments several hours apart.\n\nGo to the NOF website, www.nof.org, for a lot more reliable information. And remember - despite what you may read - there is NO natural remedy for osteoporosis once you've lost a good amount of bone. Only Forteo will rebuild bone, then a bisphosphonate to keep that new bone strong.\n"},{"author":"nikschagtown","resp_time":"over 2 years ago","resp_title":"Hi bonebabe. Thanks for your response. I turned 65 this summer. My scores in the lumber total -3.6, neck -3.4, hip -3.5, forearm -3.8. You are right about Forteo side effects vs the effects of not taking it. When it was first recommended to me, I was so scared to take it because of what I read and didn't know anyone that had taken it. I'm still scared to take it but at this point I don't have much choice. I go to the doctor on Tuesday the 28th of Nov. I will let you know what treatment he suggests for me. I took Fosamax and Actonel some years back so I wonder if when I'm done with Forteo if I'll even be able to take it again. I'm very worried about this.","resp_content":"Reply\nbonebabe\nover 2 years ago\nYes, take the Forteo for the full 2 years. After that you'll have to take Actonel, Foxamax, Boniva or Reclast to strengthen the new bone that Forteo made. Continue your calcium and Vit D, otherwise none of the medications will work. You're doing the right thing. Go for it.\nReply\nnikschagtown\nover 2 years ago\nThanks for your response once again. I went to the doctor today and he recommended either Forteo or Tymlos. He said they are both very effective, Tymlos is a newer drug than Forteo. He believes Tymlos is a little more effective than Forteo but has not been on the market that long and can only be taken for 18 months versus 24 months for Forteo. So he is leaning more towards Forteo. He has ordered some blood work and x-rays of my back before proceeding. This doctor came highly recommended so I hope he can help me. One concern I have is the cost. I know it's very expensive and I'm on Medicare and in the process of finding how much they will cover.\nOne other thing, can you tell me what form of calcium do you take, carbonate, citrate, etc. ? Appreciate the help and info.\nReply\nbonebabe\nover 2 years ago\nYes, a medicine definitely. I agree with the Forteo as it has a proven track record. The cost is high, but if your Part D doesn't cover it, contact Eli Lily. They used to have a program to help patients with the cost. I don't know if they still do.\n\nAs for calcium - there's no good or bad or one more effective than another. Calcium is a mineral and can't be broken down. What I would suggest is that if you have a problem with gas or constipation, take the calcium citrate. Be aware that you'll have to take 2 pills at one time for a single dose. That means 4 pills a day. I'd take a dose with lunch and a dose with supper. If you don't have a problem with the above, take the calcium carbonate. It can be as simple as Tums. Just be sure you read the label carefully and see what a dose is and how many pills = a dose. You'll also need 1000 IU of Vit D. You can take it separately or in a calcium pill.\n"},{"author":"roy555","resp_time":"over 2 years ago","resp_title":"RE: Osteoporosis","resp_content":"I learned I had osteoporosis 09/2012. Spine -5.2, Femur -3.8 and Left Forearm -4.3. I have not had any breaks. The bone density was performed because I have taken Dilantin for many years and I was very ill. I was a 62yo male. As it turns out, I was essentially dying of malnutrition due to undiagnosed Celiac Disease. After diagnosis I went gluten-free and 3 months later I started regaining my weight. I had lost 35 pounds. I then bought a vibrating platform and weights. The vibrating platform was originally developed (afaik) to keep bone density up while astronauts were in space. My doctor and I decided against medication at the time. My latest bone density was performed 4/2016. Spine -3.4, Femur -2.9, and Left forearm -2.7 but I have plateaued. Nine months ago I started Forteo. Injections at bedtime made me hurt so bad in the morning that we switched to injections in the morning. Worked for me. This hasn't been an easy 9 months but I am now 67yo so I don't know if all my aches and pains are Forteo related or not. \"bonenane\" gave you good advice, imo. I plan to ask my new doctor (I moved) to perform a bone density soon so I can evaluate Forteo's affect on my bones. Oh, I have been taking 1200mg calcium (w/D3), 500mg magnesium, 90mcg K2. I chose Forteo because it was supposed to help one build bone. However, depending on my bone density results, and my \"fear\" of medications, I may stop the Forteo after 1 year. That stuff is too expensive. I might exercise more if I feel better. Good luck.\n"},{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"Don't stop the Forteo after one year. It takes bone at least 2 years to respond to change. That's why DXA's are recommended every 2 years instead of earlier. You just won't be getting the most reliable information.","resp_content":"\nAs for your scores, it definitely looks like improvement. I must tell you though, that change is not measured by T-score. It is entirely possible for your T-score to increase or decrease but your bone density actually moved in the opposite direction. Change is calculated by a very specific formula based on BMD numbers and the results of a precision study done by your testing facility.\n\nAbout the precision study - most places don't perform one because it is very time consuming. However if they don't you really don't know if or how much your bone density is changing. What a precision study does is determine how accurately a DXA can be repeated. This is done by getting 30 people to get on the table, have a DXA, have them get off and get back on. After the 2nd DXA a formula is used to calculate the rate of change. THis is basically, in laymen's terms, a margin of error. On our machine it is 2.8 for the spine and 2.9 for the femoral neck. That means any change within those numbers is consider no change, or stable. Greater than those numbers, whether increase or decrease, means significant change. That's the ONLY way you'll know how your medication is working.\n\nAsk the person doing your test what their LSC is (Lowest Significant Change) If she looks at you blankly, you'll know you're not getting reliable test results. I work in an internationally accredited osteoporosis center where we have to jump through hoops and do all manner of testing procedures in order to insure that our patients get the best results possible. Even a slight variation in how you're lying on the table can make the difference in whether you've \"improved\" or not.\n\nYou can look at the ISCD.org website. This is the governing body of all things osteoporosis. You can look on their site for accredited osteo centers and certified technicians. I'd recommend you go to one of them for your future testing. Your doctor gives you a prescription for a test. You can have it filled anywhere.\n\nAgain, do not stop your Forteo. It's the only chance you have to improve your bone density. Complete the recommended length of treatment.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/31423/osteoporosis"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"38 yr old male. Osteoporosis. Lyme disease??","post_content":"I was diagnosed with osteoporosis when I was 34. I am very active and in good shape. While struggling to find answers and never getting a root cause, I feel like I should be tested for lyme disease. Many of the symptoms I have had for many years fit into lyme disease symptoms. They include joint pain, fatigue, memory problems, brain fog, anxiety, depression. Has anyone had experience with lyme disease and where the best place is to get tested? I read that 56% of people that have lyme disease test negative. I feel like most doctors would blow this off.","like_count":"1","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: 38 yr old male. Osteoporosis. Lyme disease??","resp_content":"34 year old men do not get a diagnosis of osteoporosis. That doesn't come until you're 50. It's possible you're still growing bone to reach your maximum bone mass and you'd show low when tested. If you do have low bone density now, it would be secondary to something else going on.\n\nThat could very possibly be a suppression of testosterone during your younger years. Alcohol would do this. We're seeing an increase in young men in our osteoporosis center who were big partiers during their high school and college years and now have low bone mass as a result.\n\nOr it could be that you were on a medication that has bone loss as a side effect - like prednisone, inhalers, anti seizure drugs or some diabetic drugs.\n\nIf none of those are the case, I'd consult an endocrinologist for further testing.\n\nWhy did you have a DXA in the first place? Have you fractured? Are you taller than 5'8\"? Did your mother or father break a hip?\n\nAt the very least, you need to consume 1000 mg of calcium a day, taken in two doses. You also need to have your Vit D levels checked and take a Vit D supplement.\n\nIn your activities, be sure to keep your spine straight. No crunches, twists or running. All those movements cause stress on the spine which can eventually result in a compression fracture.\n\nIf you want more info, go to the National Osteoporosis Foundation website, www.nof.org. You'll find the most reliable and verifiable information there.\n1\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: 38 yr old male. Osteoporosis. Lyme disease??","resp_content":"What about hyperparathyroidism? Check website www.parathyroid.com. The symptoms fit perfectly to hyperparathyroidism.\n"},{"author":"TumbleweedInertia","resp_time":"over 2 years ago","resp_title":"Your symptoms could also be Lupus it any of a number of autoimmune diseases. I am a 39 y/o female diagnosed with osteoporosis. It's possible, but rare. I'll see an endocrinologist soon. For now, I'm a mystery case.","resp_content":""},{"author":"basketweavver","resp_time":"over 2 years ago","resp_title":"RE: 38 yr old male. Osteoporosis. Lyme disease??","resp_content":"I'm 69 but I've backpacked and camped for 30 some years. I have had the same symptoms since June. I've had to request all the tests that I wanted because my doctor didn't do anything but recommend PT which I did for 6 weeks. I finally requested a blood test which showed me very low in B12. I took b12 vitamin but still had symptoms. I finally requested lyme's test along with neurology appointment. My lyme's test was positive. They did the initial test and if that is positive then they do the western blot test. The neurologist did a MRI and found signs of lymes. I now have an appointment with infectious disease MD. I understand by all my readings that blood tests may not show anything and still you have it. MDs are often sceptical about the disease and some places say you need to see a lymes literate MD. I'm a little nervous as to whether the doctors have enough experience to treat me, but I'll wait til my appointment.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/9671/38-yr-old-male-osteoporosis-lyme-disease"},{"post":{"author":"ornery47","post_time":"over 2 years ago","post_title":"osteo","post_content":"what are the \"long term\" effects of taking fosamax","like_count":"0","tags":[]},"responses":[{"author":"WebMD Addie","resp_time":"over 2 years ago","resp_title":"RE: osteo","resp_content":"Hi ornery47,\n\nThis would certainly be a good question to discuss with your doctor at your next appointment. In the meantime, here is some information about Fosamax that includes possible side effects and precautions: http://wb.md/2sxFtp8 . However, it does not talk specifically about possible long-term effects.\n"},{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: osteo","resp_content":"In a nutshell - reduced chances of fracturing. The bisphosphonates stay in your body ten years. There are reported claims of jaw necrosis, trochanteric fractures and stomach distress. Of those three, only stomach irritation has been validated to be caused by bisphosphonates. The jaw necrosis has been shown to be only in cancer patients who were on IV Fosamax. The trochanteric fractures occur in people who don't take Fosamax as often as those who do.\n\nIf you are at a high risk for fracture - the only thing that will lower your risk is a medication. Every medication has side effects. You have to weigh your risk of fracturing which will dramatically change your life and take away your independence against the possibility of a side effect that you may never experience.\n1\n"},{"author":"codyandskye","resp_time":"over 2 years ago","resp_title":"I just had IV infusion of Reclast. The side effects lasted three days, and returned a week later. I finally feel better. I guess it is better than suffering daily with pills. There is no choice, as I view it. I woke up freezing cold, as if stuck inside a freezer. I had extreme fatigue and loss of appetite. It then moved to pain, so I put a heating pad under my back. I get headaches and stomach issues without this medication, so it made that worse.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/8522/osteo"},{"post":{"author":"67violet","post_time":"over 2 years ago","post_title":"Which drug should I use? Prolia or Reclast","post_content":"I have been Breast Cancer free for 1 1/2 year. No Chemo or radiation but I do have to take Exemestane 25 mg for the next 5 years. I already have osteopenia, so my Oncologist wanted to give me Prolia for 2 years. The first shot was fine, but after the 2nd shot, my body didn't react well, especially the pain levels in my joints. Felt 100 years old. I'm 67 and have always been very active but after refusing the 3rd Prolia shot ,I know I'm going to have to have some kind of Protocol for my bones while taking this Exemestane, which does a number on a women's bone health. Is Recast still around and is there anything else that may aid me with my bone health while on these Aromatase Inhibitors?","like_count":"1","tags":[]},"responses":[{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: Which drug should I use? Prolia or Reclast","resp_content":"Prolia is not usually the drug of first choice. It is not a bisphosphonate and is normally given if bisphosphonates are not well tolerated. Yes, Reclast is still around and is an excellent drug. Especially if you travel or are not able to take an oral medication. Be aware that you need to continue calcium intake of 1200 mg/day or the medication will not work. Also 1000 IU of Vit D.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/25678/which-drug-should-i-use-prolia-or-reclast"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Ultrasound of heel","post_content":"I had an ultra sound of my heel for osteoporosis. T- score was 2.89= osteoporosis.\n\nI had a Dexa Scan that showed a 10 year risk for a major fracture is 7.3 and for a hip fracture 0.39.\n\nOsteopenia of the Lumbar spine ( i had lumbar surgery). This region has a slight increased risk of fracture.\n\nMy conclusion is that the heel ultrasound is worthless and far from accurate.\n\nAnyone have a similar story??/","like_count":"0","tags":[]},"responses":[{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: Ultrasound of heel","resp_content":"The heel ultrasound is not a diagnostic test. It is a screening tool used for women ages 40-65 who do not have any risk factors for osteoporosis. It is not something you would take or not take a medication for based on the results. It is primarily designed to see if you need to have a DXA. A score of 2.89 is a normal score. A score of -2.89 would be osteoporosis. But again, a diagnosis is not given based on a heel test.\n\nIf you've had lumbar surgery you should not have had a scan of your spine. It will artificially elevate your numbers.\n\nAccording to your FRAX score, you are at a low risk for fracturing and that's a good thing. You'll want to repeat your DXA two years after this last one. You will never repeat the Sahara heel scan. It's not made for followup.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/30578/ultrasound-of-heel"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Have or have I've not got osteopenia/Osteoporosis?","post_content":"Hi,\nI don't know what's going on? Over a yr ago I went for a bone density test (according to the lady whom did the test said that although it's not 100% but it looks normal). But I because I cannot lay flat the test was done on my wrist. I heard nothing until a year later, I received a later from the doctors stating the I've got the above, I was totally confused and went to se my GP. My GP had not seen this result (it must of been filed away), but because of my back pain was getting worse, I'm now stooped over, also my toes are all bending over a a claw and the big toe is now calcified, also the same in my hand. My GP gave me medication for the above without any hesitation, but I've not taken it because the effect, secondly, I don't really know it I have it or not, please help ?","like_count":"1","tags":["Exercise","Bone Density","Diet"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Have or have I've not got osteopenia/Osteoporosis?","resp_content":"Have you been tested again? That might be the first place to start. That and an open conversation with your doctor about your bone health and what you can expect down the road. You might also want to talk to your doctor to see if there's another medication that could help you without the side effects that are keeping you from taking the first.\n"},{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: Have or have I've not got osteopenia/Osteoporosis?","resp_content":"What was your T-score. If it was between -1.1 and -2.4, that's in the low bone density or osteopenia range. Osteopenia is not a diagnosis. If it is below -2.5, that gives you a diagnosis of Osteoporosis. That said, osteoporosis will not give you the symptoms you describe. It sounds like something else is going on. If your GP gave you medication, you should take it. If you're not, you need to have a conversation with him/her about why you don't want to.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/27726/have-or-have-i-ve-not-got-osteopenia-osteoporosis"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Lifelong chronic symptoms rapidly reduced after taking potassium. Unknown cause. Would appreciate any theories or ideas!","post_content":"I’m very interested in your theories for my undiagnosed condition.\n\nI’m a 30 year old male that has suffered from a long list of chronic severe symptoms for most of my life. Dozens of specialists consultations and different tests and treatments have yielded no results.\n\nRecently, I tried a potassium gluconate supplement. I experienced rapid and dramatic reduction in all of my symptoms. This effect has been repeatable for 2 months. If I stop the supplementation, the symptoms return within a day.\n\nSevere, chronic symptoms improved:\n\n• Asthma and respiratory issues.\n• Nasal congestion.\n• Constipation.\n• Headaches.\n• Muscle cramping, weakness and pain.\n• Insomnia.\n• Palpitations.\n\nI’ve also suffered from unexplained osteoporosis since my twenties.\n\nIt would be life-changing to finally know what has caused me so much suffering throughout my life. This potassium effect is my first piece of evidence that might help me solve the mystery. I would appreciate any opinions and theories!\n\nI’m booked to see an endocrinologist. Suggestions of other recommended specialists are welcome. I’m taking 400mg to 800mg of potassium gluconate per day. I understand that this is within a safe dosage range. Previous years pathology show low but not out-of-range serum potassium levels.\n\nThanks! :)","like_count":"0","tags":["Bone Density","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: Lifelong chronic symptoms rapidly reduced after taking potassium. Unknown cause. Would appreciate any theories or ideas!","resp_content":"Nobody on this board will address your symptoms if you've been to many doctors with no conclusions. This is not the place for that, as what we'd offer would be suggestions and opinions. I think the endo is a good idea and he/she can point you in the right direction. Potassium is not something you want to play around with on your own.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/31303/lifelong-chronic-symptoms-rapidly-reduced-after-taking-potassium-unknown-cause-would-appreciate-any-theories-or-ideas"},{"post":{"author":"sadperson2","post_time":"over 2 years ago","post_title":"I got chondromalacia patella after month of treadmill workout","post_content":"Hi my problem starts when I first bought a good high priced treadmill when I started using it felt bit pain in my knees i ignored it\n\nBut then after 1 month felt pain in my back of both knees and also the right knee I couldn't fully stretch it with tiny barley noticeable fluid in the upper part of the knee\n\nAfter 2 weeks i decided to check on a doctor after check up he said I have chondromalacia patella\n\nI don't feel much pain on the right knee unless i take a good walk or climbing long stairs ,the pain in the upper knee where the fluids is with little warmth and sometimes in front knee part ,it get better when I rest or sleep\n\nBut then I did uric acid test turns out my uric is 8 the doctor gave me No uric I have been used it for a week and did the test it dropped to 4.9\n\nAm really worried if I have a gout even though it's been a month since I got the knee issue , I have been reading about gout and I get very depressed that I might have one . even though it's been month and I didn't feel that intense gout pain that everyone talking about\n\nAm 26 and my weight is 111 since that happened at least month ago .now with heavy depression my weight is 104 ofcourse am happy with the weight but sad to know I might have gout ):","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: I got chondromalacia patella after month of treadmill workout","resp_content":"If you think you have gout I'd go to the doctor for more testing. You might need some more medicine. No need to stress and stay in pain if your doctor can help.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/22944/i-got-chondromalacia-patella-after-month-of-treadmill-workout"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Broken wrist swollen fingers","post_content":"Four weeks ago I broke my wrist which is now in a cast which doesn't feel tight. My fingers are slightly discoloured and swollen. Should they still be swollen? I've put a pic of swollen fingers and normal fingers.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Broken wrist swollen fingers","resp_content":"It can take as many as six weeks to fully heal. The next time you see an orthopedist, mention it.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/21543/broken-wrist-swollen-fingers"},{"post":{"author":"songbird1178","post_time":"over 3 years ago","post_title":"Do I need to get a bone density test?","post_content":"I'm nearing menopause age and am wondering if I should be asking my doctor about getting a bone density test. Or is this something that they just schedule when the time is right? I know that menopause can speed up bone loss and I want to catch any problems that I might have in the beginning so I can do something about it. I definitely don't want to wait until I break a bone. Are there other things I should be asking my doctor about now?","like_count":"1","tags":["Bone Density"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Do I need to get a bone density test?","resp_content":"Hi songbird1178 I'm glad to hear that you are thinking about your future health and are asking questions about how to best prepare and interact with your doctor. This article has some really good information about bone density tests that you may find helpful: http://wb.md/2d0rHUo\n\nIt talks about who should get a bone density test, what types of bone density tests may be available to you, and insurance coverage questions you may need to consider. The article does list postmenopausal women below the age of 65 who have risk factors for osteoporosis and women with medical conditions associated with osteoporosis among those who should consider bone density testing.\n\nHere is some more information about bone density tests that you may also be interested in: http://wb.md/2deqgHp\n\nAs the article above says, knowing the strength of your bones can help your doctor recommend prevention steps and any other necessary treatment, so I think it would be a good idea to bring up the idea of getting a bone density test at your next appointment and see what your doctors thoughts are on the subject.\n\nI hope you'll check back in soon!\n2\n"},{"author":"songbird1178","resp_time":"over 3 years ago","resp_title":"Thanks! I will take a look at those articles. I don't think I currently have any risk factors (I'll have to read to find out), but I think I'll talk with my doctor at an unrelated appointment I have coming up about steps I should be taking now. Thanks again!","resp_content":""},{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Do I need to get a bone density test?","resp_content":"You're smart to be thinking about being tested. Normally you wouldn't have a test until after you've completed menopause (one year without periods) and are not on hormone therapy - unless....you have another risk factor, like long term steroid use or a history of nontraumatic fracture.\n\nWhat you could do barring any other risk factors, is to ask your doctor about having the ultrasound heel test. It's not diagnostic but is designed to test those women aged 40-64 who don't present with any risk factors for fracturing. It is a simple test that uses ultrasound to check your heel. If your reading is below -1.0, that is a reimbursable reason to have the complete bone density test or DXA. The ultrasound screening test is something that you would do only once in your lifetime. It is not formulated to measure change or accurately give you follow up information.\n\nYou could also ask your doctor to have your Vit D levels checked. If it is in the normal range, you should take about 1000-2000 IU each day. If it is low (and most people have a low result) he will probably prescribe a booster dose of 50,000 IU for about 12 weeks, then maintain with 2000 IU/day.\n\nYou should be consuming 1200 mg of calcium each day. The body can only process about 500-600 mg at a time so spread it out. Check your labels carefully if taking a calcium supplement. Some, like Citracal, require two pills as a dose, others only one.\n\nAlso food labels should be read as dropping the % and adding a zero. For example - if your OJ says 35% calcium - that's 350 mg. If bread is 10% per slice, that's 100 mg.\n\nStrive for 4 hours a day on your feet. We advise all our patients to avoid movements that require bending forward at the waist or side to side twisting of the spine. These repetitive movements can cause the tiny honeycomb bones within the spine to break if your bone density is low, resulting in a compression fracture over time.\n\nHope this answers your question.\n1\n"},{"author":"songbird1178","resp_time":"over 3 years ago","resp_title":"Thanks! To my knowledge I don't have any risk factors for osteoporosis (other than the menopausal age). I think I will bring up the heel test at an doctor appointment for something unrelated I have coming up. Thanks for suggesting that. I am a vegetarian so my doctor does currently have me on vitamin D, b12, and calcium supplements. I will have to talk to her to see if my doses need to be adjusted. Thanks again!","resp_content":""},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Do I need to get a bone density test?","resp_content":"I have had osteoporosis diagnosed via bone density tests since my 30's. I took calcium and other drugs (per dr) and only got worse over many years UNTIL I changed my diet (now healthy vegan food), gave up the drugs, exercise every day, get enough sleep, and have little stress. I get calcium from my diet (dark leafy greens are great), a little fish (not totally vegan), and tons of colorful vegetables. I take D3 (5,000 IU), K2, and magnesium (all important for bones). I stopped getting bone density tests -- keep in mind this test was created by the pharmaceutical companies to make money and sell their drugs. I am now almost 72 years old and have never been healthier or better since I gave up the dr. orders.\n"},{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"Just curious. You're 72 now and have been diagnosed via bone density testing since your 30's - what kind of testing? To my knowledge, and I've been doing bone density testing for 21 years, it wasn't available 40 years ago. Also, unless you had an early menopause (before age 40, and you very well may have) no diagnosis of osteoporosis is given. What kind of drugs did the doctor have you on that you gave up? Is it possible that your bones have been healthy all along since your testing was so long ago and testing has evolved since then? I don't think I've ever encountered anyone who was tested so long ago and given a diagnosis at an early age. I'd really like to know more about it. If you've not had a fracture and are healthy now, I'm leaning towards the healthy bones theory. Congrats to you","resp_content":""},{"author":"spork78","resp_time":"over 2 years ago","resp_title":"RE: Do I need to get a bone density test?","resp_content":"a bone density test is always a good start for a diagnosis\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/505/do-i-need-to-get-a-bone-density-test"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"What You Should Know About Osteoporosis","post_content":"May Is Osteoporosis Awareness and Prevention Month. More than 10 million Americans have osteoporosis, and about half of women 50 and older will have an osteoporosis-related fracture in their lifetime.\n\nSo, what exactly is osteoporosis? Are there any steps you can take to prevent it? What can you do to boost bone health if you’ve been diagnosed with osteoporosis? Find out the answers to these questions and more, here: http://wb.md/2oQdxKM","like_count":"1","tags":["Exercise","Bone Density","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"afroprofesor","resp_time":"over 2 years ago","resp_title":"RE: What You Should Know About Osteoporosis","resp_content":"i have pain in my bones yet I have not been diagnosed with osteoporosis. I recommend natural healing treatments of all types such as message and rest. hot and cold treatments are good. keep searching and find what works for you. if that does not work, surgery should be the last option.\n"},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"Have you been tested or thought about getting tested for osteoporosis?","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/7482/what-you-should-know-about-osteoporosis"},{"post":{"author":"jaw52284","post_time":"over 3 years ago","post_title":"Esophagus burning and taking Fosamax as directed, what should I do?","post_content":"My mom is taking Fosamax [Alendronic Acid], she is taking it exactly as directed and is still getting terriible burning in her esophagus. She is really suffering. She says there are no alternative medications she can switch to.\n\nAre there any remedys she can take to help ease the burning in her esophagus? Supplements, Vitamins, anything like that?\nAny help anyone can give me would be greatle appreciated, as i Said, she is really suffering\nThanks in Advance!!","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Esophagus burning and taking Fosamax as directed, what should I do?","resp_content":"Unfortunately that's a common side effect of the oral bisphosphonates. She could try Tums or another acid reducer, like over the counter Prevacid, etc. The problem with that though is that they reduce the amount of calcium absorbed.\n\nAnother alternative she could do would be to switch to the annual IV infusion medication, Reclast. It's given in a medical setting, therefore comes under her medical, not drug, reimbursement. Like Medicare Part B or her supplement.\n\nAs long as she's on the oral med, make sure she drinks a full glass of water after taking the Fosamax and remains upright for at least an hour in her case. If she's taking the daily medication, she might want to try switching to the weekly.\n\nThat's the only solution to her problem. I wish there were another.\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Esophagus burning and taking Fosamax as directed, what should I do?","resp_content":"Severe pain in the esophagus is a serious side effect that requires immediate attention. Don't mess around with this. Her doctor needs to be contacted. Perhaps you can accompany her to the doctor so you can have a better understanding of the problem and ask the appropriate questions. Hope everything goes well.\n"},{"author":"cherylrud","resp_time":"over 3 years ago","resp_title":"I have had the same issues for many years and have taken prescription medications. Recently I tried apple cider vinegar. It has been a miracle for me. I first tried a tbsp in warm water and although it worked for me it also caused burning so I switched to 3 pills in the a.m.and 3 before bed. I have now been off prescription medication for 9 months","resp_content":""},{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Esophagus burning and taking Fosamax as directed, what should I do?","resp_content":"I take a product called Grow Bone and feel like it is making a difference in my bone density. It has been proven through research to do so and involves taking 2 pills at breakfast or lunch, 2 at the next meal, and 3 of a different pill at bedtime. I get it through the Vitamin Shoppe and a month's supply is about $40. The calcium is from algae as its source rather than from rocks which most calcium supplements are composed. No digestive issues and another source for information is the website for Algae Cal. I'm doing this because I do not like the potential for severe side effects with the prescription drugs for osteoporosis.\n"},{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"I'm curious as to how you feel it's making a difference in your bone density as bone loss is without symptoms until a fracture.","resp_content":"\nThe Grow Bone System is a great system for making money for the manufacturer. Calcium is a mineral and cannot be broken down or changed. Raw calcium is a gimmick phrase. There is no calcium that is better for you than another. If you follow their instructions,you are consuming 756 mg of calcium. You need 1200 mg a day. I assume you are getting the other 500 or so in your diet. Your body cannot absorb more than 500 mg at a time, so any you take over that at one time will be excreted in your urine.\n\nHere's the thing about Grow Bone. The pill you take at night is Strontium. That's why you can't take it at the same time as the calcium. Your body doesn't need any more strontium than you have already. Strontium is a mineral like calcium. The reason they can say your bone density improves with their product is that the strontium gives you an artificial increased reading on your DXA test.\n\nThe DXA machine measures calcium only. This is very important to know. When you ingest strontium, it screws up the readings on your test. It is not increasing your bone density, just making it look like it is.\n\nThey get away with this because the supplement industry is not regulated. So what you're doing, is spending a lot more money than you need to and potentially not halting your bone loss.\n\nI don't know how long you've been taking this, but in order to get an accurate picture of your bone health, you'd have to stop, wait 2 years, then have a bone density test that was compared to the last one you had before you began taking Bone Growth. That's a lot of time for your bone density to continue to weaken.\n\nYou'd be better served to take a calcium supplement with the USP symbol on the bottle, like Citracal, Oscal, Viactive or their generic twins and take an approved medication.\n\nYou'll never escape side effects of anything as long as you're alive. It's totally possible you won't have any side effects. They're certainly exaggerated in blogs. People are more prone to talk about how bad they have it than how good something was. Get more attention that way.\n\nThe bottom line is that the US practices EBM, Evidence Based Medicine and the evidence is that the osteo drugs do reduce your chances of having a life altering fracture.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/3302/esophagus-burning-and-taking-fosamax-as-directed-what-should-i-do"},{"post":{"author":"michaellynnmiller","post_time":"over 2 years ago","post_title":"Hip Replacement Surgery","post_content":"I have been scheduled for hip replacement surgery in November. My surgeon ordered a bone density scan & it was discovered that I have osteoporosis. I've been started on Prolia injections & Calcium & Vitamin D3 supplements. My question is this: How will osteoporosis have an effect on my hip surgery - and more importantly - recovery afterwards?","like_count":"0","tags":[]},"responses":[{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: Hip Replacement Surgery","resp_content":"Osteoporosis means porous bone. When bone is porous, it is fragile and breaks easily. It also doesn't heal quickly or easily. It's good that your doctor has started you on Prolia. You need 1200 mg of calcium a day. Do not ingest more than 600 mg at a time. Your body cannot absorb more than that and will excrete the excess in your urine. If you take a calcium supplement, look at the dosage carefully. Calcium carbonate is one pill = 600 mg and calcium citrate is two pills = 600 mg. Take a dose with lunch and another with supper. Did he check your Vit D levels? If not, ask him to. It may be that you need a booster dose of 50,000 IU and then maintain with 2000 IU a day.\n\nAs for your recovery, you'll continue the above treatment plan. Walking will help those bones knit as the motion of muscle pulling on bone stimulates new bone growth.\n\nIf it's not too painful, I'd suggest you start walking now to get those bones making new bone.\n\nGood luck with your surgery.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/8178/hip-replacement-surgery"},{"post":{"author":"alpha112378","post_time":"over 2 years ago","post_title":"Numbness after Sprain","post_content":"I sprained my ankle about two weeks ago. The hospital told me it was a grade 3 sprain and took a chip off the bone when it stretched. Two days ago I awoke and my entire leg from my knee to my ankle on the side of the sprain was numb. I can tell that it is being touched but feels like it is asleep. At a follow up appointment with my ortho yesterday, he kinda just dismissed it. It is still numb today. Is this something I should be concerned about? What causes it? What can I do?","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Numbness after Sprain","resp_content":"Did you ever find out what was causing the numbness? To me that doesn't seem like something to just shrug off, but I'm also not a doctor. Hoping you're back to normal and doing well!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/7541/numbness-after-sprain"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"What Foods Should You Eat for Healthy Bones?","post_content":"Nothing beats calcium for your bones, but did you know that you can find it in much more than milk?\n\nTake a look at this slideshow to learn all of the best places to get your recommended amount of calcium, and which other nutrients and foods can help keep your bones healthy: http://wb.md/2qMNJnv","like_count":"1","tags":["Diet"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/8444/what-foods-should-you-eat-for-healthy-bones"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"Exercises to Boost Your Bone Health","post_content":"Exercise can be powerful medicine if you have osteoporosis. It helps reduce bone loss and builds stronger muscles to support you. The result is that you’re less likely to have a fall or fracture.\n\nBut not just any workout will do. Here are some of the best exercises to boost your bone health: http://wb.md/2pFPXRF\n\nDo you have a regular exercise routine?","like_count":"0","tags":["Exercise","Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/8070/exercises-to-boost-your-bone-health"},{"post":{"author":"WebMD Addie","post_time":"over 2 years ago","post_title":"How Can You Prevent Fractures?","post_content":"Falls and bumps that wouldn’t hurt a person with healthy bones can damage them when you have osteoporosis. All of your treatments, from diet to exercise to supplements and medications, focus on strengthening and protecting your bones.\n\nHere are some other tips to help you prevent fractures at home and on the go: http://wb.md/2pOtKTf","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/7781/how-can-you-prevent-fractures"},{"post":{"author":"southafricagal","post_time":"over 3 years ago","post_title":"thoughts On Fosamax!","post_content":"My MD told me I have osteoporosis and that he needed to put me on fosamax asap.\nWell I know a few women who take this drug and they have developed some medical problems that seem to be typical side effects for this particular drug. teeth falling out etc I read about them online some are super bad side effects.\nso I told him no thank you ,I am going to attempt to do my bone building the old fashioned way by doing some weight training with barbells for my arms and for my body I am using a weight vest for strengthening my bones nyknyc the diet\nI wont go into it you can look online to see foods good for your bone but cut out smoking if you smoke it is real bad for bones, a no no.\nI dont know if its any indication but I feel really stronger and look great too. I advise my method to everyone : workout with wts and eat a great bone healthy diet, you cant go wrong.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: thoughts On Fosamax!","resp_content":"At 65yrs old I was told I had osteoporosis and told to go on a biophosphate which I, like you, declined. I have opted to do weight resistance and other ways to build bones. I also am taking algaecal and Vit D 2000IU daily as well as other calcium enriched foods. I will have another dexascan done at 66yrs old to see if there are any changes. Are you taking any supplements along with your weight training?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/4508/thoughts-on-fosamax"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"What You Should Know About Osteoporosis Medications","post_content":"When it comes to osteoporosis meds, you have a lot of options, so it helps to know the landscape.\n\nHere’s a quick run-down on osteoporosis medications that are out there and how to work with your doctor to determine which (if any) may be right for you: http://wb.md/2lnjql1\n\nDo you have experience with any of these medications? We’d love to hear your story!","like_count":"0","tags":["Living & Managing","Treatment"]},"responses":[{"author":"marthama","resp_time":"over 2 years ago","resp_title":"RE: What You Should Know About Osteoporosis Medications","resp_content":"I have been on an annual Reclast infusion for a couple of years. So far, so good! My bone density increased so much that I no longer have osteoporosis. I haven't lost any height like my mother and grandmother did by my age. The only side effect I've noticed is that I can't take any magnesium supplements without getting painful \"shin splints\" since starting Reclast.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/4076/what-you-should-know-about-osteoporosis-medications"},{"post":{"author":"concernedmom45","post_time":"over 3 years ago","post_title":"seizures, depakote and diabetes","post_content":"My daughter is 45yrs old and is mentally disabled. Four yrs. ago she developed Type 2 diabetes. She has been on Depakote for seizures since she was 6yrs old. I feel as though it might have been the Depakene liquid that cause her to have the diabetes. It is a thick sugary syrup. She was on it for 39 years. My concern now is she needs to be on a diabetic drug but we have had a hard time finding one that is compatible with the depakote. Depakote is a dangerous drug and she can never come off it. And the drugs we tried for diabetes have caused her to have psychotic effects. She is only taking depakote and synthroid. Could I get some suggestions for some medicine for the diabetes. I am very uncomfortable trying new medicines.","like_count":"0","tags":[]},"responses":[{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: seizures, depakote and diabetes","resp_content":"I don't know about diabetes drugs that are compatible with Depakote, but I do know that anti-seizure meds can cause low bone density. She should have a DXA scan if she hasn't already.\n"},{"author":"concernedmom45","resp_time":"over 2 years ago","resp_title":"Thank You!!","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/6020/seizures-depakote-and-diabetes"},{"post":{"author":"shad0w229","post_time":"over 3 years ago","post_title":"Osteoporosis","post_content":"My Dr prescribed Forteo for me, but my Alk/phosphate is 129, and I was told that my bone density number was 55.65, how is this possible?","like_count":"1","tags":["Bone Density"]},"responses":[{"author":"bonebabe","resp_time":"over 2 years ago","resp_title":"RE: Osteoporosis","resp_content":"Medications are prescribed based on your risks for fractures. I have no idea what the numbers you posted mean. Your T-score and other risk factors will indicate a need for medication.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/5158/osteoporosis"},{"post":{"author":"shaunth","post_time":"over 3 years ago","post_title":"Dead muscles, originally bone dislocation.","post_content":"Hi, I am posting in great hope that a specialist may be able to help advise me. I have lived with the condition a little less than 5 years now after a motorcycle accident which at the time, only dislocated my left shoulder.\nNow I am a 24 year old male living with a dead left shoulder.\nBy dead I mean there is no muscle growth or response in my deltoid muscle, as far as I can tell anyway.\nI can always feel the outer muscles clearly with discomfort which I have grown to live with (collarbone/trapezius muscles being above, and biceps and under working perfectly.. I think.\nAfter the occurrence the doctors here saw to and tried to help my deteriorating condition of rapidly shrinking muscle mass and loss of strength (Once a month for 6 months; Noticeably expressions of \"WTF\" on their faces) they told me just to live with it, for the tissue is now useless (rough translation Thai to English), and I wouldn't mind it so much if I didn't feel ashamed at work wearing a suit and still clearly having one arm 1/4th the size of the other.\nStrength in the left arm has recovered some but my right arm has grown much larger to counter-weight the lifting and labor I do on a daily basis. Which is what makes my body look weird and even deformed.\nAs for my fitness, I eat well and maintain my ideal body figure for martial arts and try to get checked twice a year.\nAny advancements in medicine that could be suggested, or even just some way to hide my disability would be very greatly appreciated.\nOther than padded clothing please haha...","like_count":"0","tags":["Exercise","Living & Managing","Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/4886/dead-muscles-originally-bone-dislocation"},{"post":{"author":"southafricagal","post_time":"over 3 years ago","post_title":"NO MAGIC BULLET FOR BONE","post_content":"I was reading a comment where some person advises fortea\nor some such biophosphate for bones but lately I,ve read that they have some negative side effects.\nI do believe in the natural approach to health and so you must eat the right things to keep bones strong and healthy greens fresh veggies fruits and you must do weight workouts with either dumbbells or get a wt vest like I use , it has helped my bones very much to be stronger and its easy to use try the nyknyc vest it looks nice - no suicide bomber look either , the vest i got looks like clothing and it is comfortable to wear so try these natural ways to get strong bone - if you do like the medication way be sure to check out the side effects , but whatever you do you still have to work out with weights and eat well.","like_count":"0","tags":["Exercise","Bone Density"]},"responses":[{"author":"cars54","resp_time":"over 3 years ago","resp_title":"RE: NO MAGIC BULLET FOR BONE","resp_content":"I took Forteo for six weeks and had to stop due to severe side effects. The worst was heart palpitations that continued for six months after discontinuation. Then an injection of Prolia, which was almost as bad. Now I just eat healthy and exercise. Never again will I take any injection.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/3891/no-magic-bullet-for-bone"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"?broken hand","post_content":"I fell at work and landed on top of my right hand. Having broken my hand bones before i was sure it was broken with immediate excessive localised swelling and bruising. I still have extensive swelling and bruising from middle finger to wrist and out to little finger, bruising goes half way down all the 3 fingers and there is a large swollen lump between 4th & 5th metacarpal and underneath my ring finger & I can't bend 4th and 5th fingers but xray showed nothing. Likelihood of # not showing on xray?","like_count":"0","tags":["Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/3973/broken-hand"},{"post":{"author":"kargiro","post_time":"over 3 years ago","post_title":"Dexa scan images","post_content":"Diagnosed with osteopenia 3 yrs ago. Had second dexa scan 2 days ago and there were a lot of bright spots and bright linings on bone. Anyone know what the bright spots mean? I'm waiting for my results.","like_count":"0","tags":["Diagnosis"]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Dexa scan images","resp_content":"Not sure what you mean by bright. If you're seeing white(r) spots, usually that indicates high calcium concentrations. The DXA scan only measures the calcium in the bone and won't show anything else like a regular x-ray would.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/3261/dexa-scan-images"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Bone Density Scan","post_content":"I am only 35....I was diagnosed with osteopenia at around 23 by a bone density scan....2 months ago I tripped over a suitcase handle and twisted my ankle....Instead of my normal sprain or strain I usually do when I fall, I have poor balance, I snapped my tibia and fibula so bad I need pin, a plate and screws put in and 2 months later I am still non-weight bearing. I had another bone density test and it says I still only have osteopenia. I am now wondering though....Does the scan take in account that at only 35 I have already been through menopause? I am on a medication that I just found out today can cause low bone density and bone fractures? I currently have a severe bone fracture from a minor fall? Is any of this looked at when looking at results of the scan?","like_count":"0","tags":["Bone Density","Treatment","Diagnosis"]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Bone Density Scan","resp_content":"Short answer? It should. Depends on the machine, the software and the tech doing the test.\n\nWhy did you have a scan at 23? Your results would've shown osteopenia regardless of your bones' strength because you hadn't reached your maximum bone mass yet. We only do scans on people under 30 if they have an illness that is known to affect bone density.\n\nPrior fractures, as well as bone thinning medications, family history, prednisone treatment are factored into your final scan results.\n\nYou seem to be concerned that your scan is not showing osteoporosis. That really is irrelevant at this point. Having a nonviolent fracture as you did, gives you a clinical diagnosis of osteoporosis since you've been through menopause. T-scores are only one part of the total picture of your bone health. The weird thing is - more people with T-scores in the osteopenic range (and osteopenia is not a diagnosis, it's a risk factor - big difference when dealing with insurance and medical histories) will fracture than those with T-scores indicating osteoporosis.\n\nIs your low bone density caused by an illness or condition that you have? Are you on estrogen therapy? Did you have a surgical menopause? What were your T-scores? Osteopenia is having a T-score between -1.1 and -2.4. If your score was in the low range, that's more significant than if it were, say -1.2 which is closer to normal.\n\nDo you get your scans done at the same place each time? Is the tech certified by ISCD? Ask her to find out. If the techs at your testing place are not certified, go somewhere else for your testing.\n\nYou also need to be taking 1200 mg of calcium each day. Take no more than 600 mg at lunch and supper. The body won't absorb more than that at a time. You also should have your Vit D levels checked if you haven't already.\n\nGo to the National Osteoporosis Foundation website (www.nof.org) for a lot more information.\n\nI hope my answer clarifies some of your questions.\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Bone Density Scan","resp_content":"You should be under the care of a specialist who can answer your questions. You are too young for these symptoms. They should look at family history. Also, are you taking any of the meds? I've taken most of them and I'm hoping my scan will show that it has not progressed. Best of luck.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/2483/bone-density-scan"},{"post":{"author":"prizm2000","post_time":"over 3 years ago","post_title":"Osteoporosis","post_content":"69 y.o. male, discovered osteoporosis 2009. Taking calcium, Vitamin D, testosterone injections, alendronate, and still the density levels are decreasing. Being followed by primary physician and rheumatologist. Afraid of fracturing when attempting any exercise. Any suggestions?? Thanks!!","like_count":"0","tags":["Bone Density"]},"responses":[{"author":"jade1956","resp_time":"over 3 years ago","resp_title":"RE: Osteoporosis","resp_content":"I am a devotee of physical therapy. A therapist can get you into the most exercise possible without threatening a fragile spine. If you don't have a PT, do get one. They are trained to know how to keep the human body healthy while keeping it safe. For example, before my spine straightened, I used pulleys that my assistant started for me so it was really quite passive exercise, but it did help with strengthening spine muscles. Another was sitting with my hands in my lap, feet flat on the floor, lift each foot independently to six inches. That was a challenge for me because I have MS and my legs are weak. But that exercise is multi-purpose. It provides core strength, leg strength, and strength of the muscles supporting the spine. Again, if you don't have a physical therapist, I would strongly recommend that you get involved in PT. There, you can learn what you can do and how to do it safely. I hope this helps.\n"},{"author":"prizm2000","resp_time":"over 3 years ago","resp_title":"Thank you, Jade 1956. Worth consideration!","resp_content":""},{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Osteoporosis","resp_content":"What criteria is being used to determine density levels decreasing? Are you and/or your doctor just looking at T-scores? If so, it's entirely possible that T-scores can be lower and yet you're statistically in a no change/stable condition. This is a good thing.\n\nIf your bone density is truly decreasing, I'm sure your rheumatologist is checking for something else going on that would cause it. Low testosterone is one reason.\n\nIf you are at a high risk for fracture, your doctor may switch you to Forteo.\n\nAlso any calcium supplement you take should be taken in doses no more than 600 mg at a time. They should be taken with meals for best absorption.\n\nHave your Vit D levels been checked?\n\nHave you fractured in the past (as an adult)? If so, your chance of another fracture is doubled. Physical therapy would be something to look into. Ask your doctor about a referral for balance and ADL's (Activities of Daily Living.) This would help immensely with your daily routine.\n\nYou should at all costs avoid any forward bending of the spine. Pivot from the hips instead. Also avoid any twisting of the spine. These repetitive movements can cause tiny fractures within the vertebra which can eventually lead to a compression fracture.\n\nGo to the National Osteoporosis Foundation website for a lot more information and illustrations of movements to make and to avoid. www.nof.org\n\nHope this helps some.\n"},{"author":"prizm2000","resp_time":"over 3 years ago","resp_title":"Thanks for your reply. T-Scores are being used. Already taking testosterone injections, vitamin D and Calcium supplements. Had a hip fracture in 2009, femur fracture (@ knee) in 2010 and forearm/wrist fracture in 2015. NOF has very helpful info. My rheumatologist says alendronate (generic fosomax) is as effective as other more costly meds. I'm concerned about having been on alendronate since 2009, but he doesn't seem to be concerned. Still working, being careful in mobility, use cane for stability \"just in case\".","resp_content":""},{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Osteoporosis","resp_content":"Even though bisphosphonates work the same way, they don't all work the same on a person. Fosamax may not be working for you. With your history of fractures, I'd ask him about Forteo. It's the big guns of osteo meds and is the only one that actually builds new bone. It's a two year program of easy small injections of a medication made from the parathyroid hormone. After two years, you take a bisphosphonate to strengthen the new bone.\n\nIf you don't want to do that, you could ask your doctor to switch you to Reclast. Because it's a bisphosphonate that's given by IV annually, it's paid for out of your medical, not drug, insurance. You would still continue the 1200 mg of calcium a day as with the other meds. Without it, any medication you take won't work effectively.\n\nAs for T-scores, as I said, they can't be use solely to determine response to treatment.\n\nAre you getting your tests done at the same place each time? Is the tech doing the test ISCD certified? The answer should be yes to both of these questions in order for you to obtain the best most reliable results. Tests can't be compared from one place to another accurately. Also if the tech isn't certified, the slightest change in position or movement can make a world of difference in your scores.\n\nBalance is very important. Actually the more slowly and carefully you walk, the more likely you are to fall. Weird, huh? It's the confidence factor.\n\nHere's a link from the NOF with balance exercises and safe movements that might help you.\n\nhttps://cdn.nof.org/wp-content/uploads/2016/02/Moving-Safely.pdf\n\nhttps://cdn.nof.org/wp-content/uploads/2016/02/Balance-Posture-and-Functional-Exercises.pdf\n\nhttps://www.nof.org/patients/fracturesfall-prevention/\n"},{"author":"prizm2000","resp_time":"over 3 years ago","resp_title":"Very helpful information! Thanks! Doing the density tests at the same place, but found out that they have a new machine since two years ago. (doing density every 2 yrs. due to insurance coverage). That may account for the different readings. Not sure about the ISCD certification. Will check that out. Appreciate your time and information!","resp_content":"Reply\njade1956\nover 3 years ago\nbonebabe, I don't know if you saw my post about Prolia. Despite the amazing results I had with it, I can't have it again. Are you saying Forteo can do the job? Fosamax tore up my mouth so we quit that. And tell 500,000 MS patients that walking slowly causes more falls. We try to speed up and we increase our falls.\nReply\nbonebabe\nover 3 years ago\nJade, Forteo is the only osteo med that will actually grow you new bone. It's made from the parathyroid hormone and requires a daily (small/tiny) injection with a pen type applicator for 2 years. After that time, you'd strengthen the new bone growth with a bisphosphonate. If the oral ones tear up your mouth, you could do the Boniva quarterly injections or the annual Reclast IV infusion.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/1752/osteoporosis"},{"post":{"author":"xzel89","post_time":"over 3 years ago","post_title":"osteochondroma question","post_content":"Hi everyone. I'm a 15 year old male that has been diagnosed with osteochondroma for a while now. Since I was 13. I am almost 16 so its been 3 years. I have been to many MRI scans and x-rays. The last specialist that I went to said that it will go away in about a year or 2. Yet it hasn't gone away it has grown... Today I went to another orthopedic specialist and he recommended me to another mri and x-ray. I got my x-ray done and am waiting for Mri appointment. He said that after he takes a look at the mri he will recommend surgery. It hurts when I sit cross legged and run. Since I am 15 I play a lot of sports and it requires running so the doctor is concerned as well as me. He said the choice is mine if you want to do surgery so I am wondering if I should get it removed or not. It is a constant disturbance when ever I run and is super annoying. I am also wondering how long the recovery time is and what will be the procedures\n\nPlease tell me what I should do give me your opinions.\nIt would be great if you have experienced this as will thanks !\nPlease reply asap","like_count":"0","tags":["Treatment"]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: osteochondroma question","resp_content":"I don't think this board is the place to address this question as osteochondroma is not directly related to osteoporosis. I'd suggest talking in depth with your doctor. If it's interfering with your activities/sports it bears discussing pros and cons. I wish you well whatever you decide.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/2080/osteochondroma-question"},{"post":{"author":"prizm2000","post_time":"over 3 years ago","post_title":"osteoporosis and sexual activity","post_content":"Is anyone aware of any studies regarding restrictions to sexual activity (positions, etc) if one has osteoporosis?","like_count":"0","tags":[]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: osteoporosis and sexual activity","resp_content":"Yes. If your bone density is very low and/or you've suffered fractures, sexual activity can be tricky. You'll want to avoid the usual twisting of the spine and bending from the waist. Also you shouldn't be the partner on the bottom. Ribs can fracture easily with vigorous compression.\n\nThese tips from the National Osteoporosis Foundation for safe movement can help too. Especially the getting into and out of bed ones.\n\nhttps://cdn.nof.org/wp-content/uploads/2016/02/Moving-Safely.pdf\n\nIt's hard not to get too graphic here, especially not knowing anything about you, but having your partner sit in a chair and you sitting on him is easy on the spine.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/1890/osteoporosis-and-sexual-activity"},{"post":{"author":"chas58","post_time":"over 3 years ago","post_title":"Osteoporosis","post_content":"I was told I have osteoporosis and Ms. Right now I'm experiencing swelling in my legs. I was given 2 diuretics. Is this natural for osteoporosis. I'm supposed to see a rheumatologist soon. Is their anything to do before then?","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Osteoporosis","resp_content":"No, osteoporosis would not cause swelling at all. Your rheumatologist will guide you in your treatment. In the meantime, make sure you're getting 1200 mg of calcium (consumed several hours apart) Vit D and are avoiding any bending at the waist or twisting of the spine. You can go to the National Osteoporosis Foundation website for a lot more information and a great FAQ section. www.nof.org\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/1876/osteoporosis"},{"post":{"author":"jade1956","post_time":"over 3 years ago","post_title":"Osteoporosis","post_content":"Female, age 60, diagnosed age 58, but two doctors said, gosh your calcium is good so you're fine. By 59, Kyphosis and sclerosis. My spine had the classic dowager's hump and was actually turning so the back of my spine was face front. To say the least, this was not comfortable. My doctor prescribed Prolia, gave me the shot, and then gave me the patient information. There is some evidence that this drug is an immune system suppressant, which I cannot have, so for me, it was good news and bad news. Six weeks after the injection, I went to have my spine brace adjusted, as I did every two weeks. The orthotist said, What have you been doing? Not wanting to confess to everything, I said, about what? He said, your spine is completely straight. Your shoulders are even and no longer rolled forward. What have you been doing?\n\nSo, if you can withstand immune system suppression that may be the answer.","like_count":"1","tags":["Bone Density","Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/1874/osteoporosis"},{"post":{"author":"jro1","post_time":"over 3 years ago","post_title":"Trying to figure out why I can't get Strontium any longer","post_content":"When I had osteopenia I used to read these boards a lot and still have many pages of posts that I kept. I so appreciated all the information. Back in 2007 I had been prescribed Boniva but instead opted to try strontium citrate. I have now taken strontium for a number of years and my T-scores have greatly improved. I recently went to order some more strontium and found that the product I used was discontinued. Does anyone here know why?","like_count":"0","tags":[]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Trying to figure out why I can't get Strontium any longer","resp_content":"We've had many posts about strontium here. The strontium citrate that you get in the states has not been shown to have any effect on bone density. Now before you say that your scores have improved, let me explain how the test works.\n\nThe DXA machine measures the calcium in the bones. If you have strontium in your system, it will artificially elevate the T-scores. The only way to determine if the strontium is helping would be to test you as a special case.\n\nThis would involve recalculating the machine. This is not an easy thing to do. Some people think it involves a push of a few buttons, but it doesn't. A precision study is needed to determine the machine's accuracy before any testing. A precision study consists of the operator getting 30 people (volunteers) and putting them on the table, doing the test, taking them off the table, putting them back on and repeating the test. The goal is to see how closely a DXA can be replicated. Based on the results of testing, an LSC is obtained. That's the Lowest Significant Change. It tells us basically the margin of error. Any scores outside that LSC would be deemed significant change - whether an increase or a decrease.\n\nThen she would test your bone density with this information. Two years later, the process would be repeated and any change you had would be known at that time.\n\nThen....for people who are not taking Strontium, the whole process would have to be repeated for their numbers. I seriously doubt that this has been done in your case; therefore you don't really have any reliable data.\n\nIn addition, the strontium citrate isn't regulated. That means that what is listed on the bottle isn't necessarily what's inside. This doesn't take into consideration the time it spends in non-climate controlled environments like warehouses.\n\nThe strontium that has been used, but is now being discontinued, is Strontium Ranelate. This is a RX in England and the strontium is combined with other ingredients. Studies have shown that it has not been as effective as first hoped and has mostly been discontinued.\n\nIn my opinion, you'd be better served to use a medication that has been proven to reduce your risk of fractures. Strontium won't do that. Bone density testing is more than a T-score. You have to look at your FRAX score and other risk factors for fractures.\n\nThis is more than you asked for, but I hope it gives you something to think about. Once you fracture, there's no do-over and it doubles your risk of having another, possible life altering, fracture.\n"},{"author":"jro1","resp_time":"over 3 years ago","resp_title":"Thanks so much for your detailed post. I remember you from a few years ago and was grateful for your expertise then and now. I do recall the discussion about calibration but I'd obviously been mistaken thinking that if I used the same machine over a few years time I could rely on the trend. Now what you've told me feels disheartening as I thought I'd been doing something right and now I'm scared I might have made things worse. I think I will go off the strontium and see where I fall now in terms of T-scores. In January I'm due for another scan so now I wonder if my body will have cleared the strontium by then. Do you have any idea? I haven't just been using strontium all this time, I do take calcium with D and 4 years ago I began doing exercises with weights 3x a week. I try to get in a few good walks during each week as well. I am now 65 years old and a full time care taker for my husband so it's even more important that I maintain my own health. I have a yearly appointment with my Doc in January so will definitely talk to her. She knows I've been taking strontium but is not as aware as you are about this subject. I sure hope it's not too late for me.","resp_content":"Reply\nbonebabe\nover 3 years ago\nI really don't know how long it takes for the strontium to get out of your system because we don't know exactly what's in the strontium you were taking. That's the problem with unregulated supplements. If I had to guess, and this just my gut talking, I'd say by January you should be clear. There haven't been any studies to my knowledge on long lasting effects of strontium.\n\nI agree with you that you certainly need to take care of yourself in order to care for you husband. That's a tough situation for you and him. Do try to get in some kind of support for caregiver group if you can. The hospital where I work sponsors one. See if you can find one. It will help immensely.\n\nAlso, I'd ditch the weights. Weight bearing exercise is not exercise using weights. It's anything you do on your feet. Walking is wonderful. Just be mindful not to bend forward at the waist or twist the spine. That damages the tiny bones within the vertebrae and could lead to a compression fracture.\n\nGo online to www.nof.org. They're the gold standard of everything osteoporosis. They have really good illustrations of movements to do and movements to avoid.\n\nTalk to your doctor about a medication. There are lots of good ones there with proven histories. Don't believe all the bad press they get. Anything you put in your body has the potential to have a side effect for you. You have to weigh your risks of fracturing and changing you life against any possible, not guaranteed, side effect.\n"},{"author":"berniepv","resp_time":"over 3 years ago","resp_title":"RE: Trying to figure out why I can't get Strontium any longer","resp_content":"Despite what some skeptics write, Strontium Citrate has been shown to improve bone density and reduce fractures. There are few controlled studies, only because it can not be patented and there is no incentive for a manufacturer to pay for the study. Strontium citrate can be obtained from a number of reliable online suppliers including Vitacost and Swanson Vitamins.\n"},{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"I would greatly appreciate it if you'd post some links to these studies and verifications. I'd like to run it by our medical director and possibly pass on the info to the 4000 patients we see each year in our osteoporosis center. I do know that the Strontium Ranelate, which was patented in Europe, has been mostly discontinued because it was not effective. Do you have any info on dosage for various stages and risks of osteoporosis? Do you know if the people whose bone density improved were done on machines that were recalibrated? If not, their results wouldn't be reliable. I'm looking forward to sharing your response. Thanks.","resp_content":"2\nReply\nberniepv\nover 3 years ago\nStrontium Ranelate was not discontinued but was limited in its recommendations. It was effective, but a study showed rare but troubling side effects. It is suspected that the Ranelate rather than the strontium caused the side effects, or it may have been a statistical anomaly.\n\nThe COMB Study (Combination of Micronutrients for Bone (COMB) Study: Bone Density after Micronutrient Intervention) showed substantial improvement when Strontium was taken along with other nutrients. A link: https://www.hindawi.com/journals/jeph/2012/354151/\n\nTwo other links reference some recent studies and include recommendations by the authors:\n\nhttp://www.osteodigest.com/strontium-citrate.html\n\nhttps://www.algaecal.com/expert-insights/the-truth-about-strontium-supplements-side-effects-dexa-results-efficacy-and-more/\n\nThere is more anecdotal evidence than studies available. Numerous blogs and message boards report results of individuals. These are usually positive regarding lack of side effects, improved Dexa scores and apparent reduced fracture risk.\n\nAlso I believe the Dexa scores when not adjusted showed good correlation with fracture risk.\nReply\njro1\nover 3 years ago\nWith these succeeding posts am having a bit of a time figuring out which person I'm replying to so will just wade in. Thanks again bonebabe for the additional information you provided. I do intend to to update my Doc and ask for her suggestions when I see her the end of this month. To berniepv, FYI vitacost is not carrying strontium citrate by Doctors Best any longer and Doctors Best says it's because of the ranelate issue. If you check Amazon for that brand all of a sudden the price has gotten astronomical and I'm guessing that's because others who were out of the supplement are chasing the diminishing supply.\n"},{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Trying to figure out why I can't get Strontium any longer","resp_content":"The COMBS study was very interesting and shows promise in continued study of strontium for future use. The biggest problem here in the USA is that the supplements aren't regulated so you don't know if you're really getting what's advertised and also don't know what dosage is needed. I saw in the report that high doses of strontium would eventually replace the calcium and become a detriment to bone health. Until a standardization of dosage and content can be made, I'd be reluctant to experiment with this.\n\nAlso I wish the study had addressed the participants who were formerly on bisphosphonates length of treatment as those medications have a half life of 10 years. Anyone who discontinued treatment less than 10 years before starting this study would be suspect as to whether the remaining bisphosphonate was contributing to improved results.\n\nThere's a lot of stuff in this study to consider, and at this point, to randomly go to WalMart and buy a strontium supplement and self dose would not be smart to do, in my opinion. However, I do think there's a lot of promise for treatment such as this and hope a controlled study with absolute results is forthcoming.\n\nThanks for the info.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/1594/trying-to-figure-out-why-i-can-t-get-strontium-any-longer"},{"post":{"author":"jennjw","post_time":"over 3 years ago","post_title":"32 yr old Bariatric Surgery Patient with Osteoporosis","post_content":"Hi,\n\nI had a Duodenal Switch (weight loss surgery) 9.5 years ago (May 2007). This affects my ability to absorb vitamins, fats and minerals (I think I read somewhere with a 75cm common channel (the working bit of my small intestine) I will only absorb 25% of everything I orally take). I've lost 11 stone and I'll be on various supplements for the rest of my life including large doses of calcium and vit D. I have to have B12 injections every 3 months (looking forward to my \"fix\" on Tuesday - I always feel like a new person after it!)\n\nI have routine DXA scans (every 2 years) and my last one revealed I have been \"upgraded\" from osteopenia to osteoporosis. I can't tell you off the top of my head what my scores were.\n\nLast week I broke my toe, accidentally kicking the bed!\n\nI have my next DXA scan on Friday. I'm pretty sure it will reveal that the osteoporosis is worse. Since my blood work routinely comes back as bad, regardless of how well or how much of my supplements I take and my broken toe shows it must be worse as it's the first time I've ever broken a bone just stubbing a toe (low impact).\n\nI wondered what the future holds for me at 32 if this keeps getting worse? What will happen to my body? My GP has never explained the long term effects of worsening osteoporosis at my age. Is there anything that can be done? I have been looking at injectables and infusions but my GP (I'm in the UK) has never suggested such things. Are they available over here yet (privately or on the NHS)? Could I ask for them? Could I pay for them? Are they any good?\n\nI'm in no pain, have no postural issues, just a tendency to kick stuff and break bones it seems!! :)\n\nAny help would be good.\n\nThanks!\n\nJenn","like_count":"0","tags":["Bone Density","Living & Managing","Treatment"]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: 32 yr old Bariatric Surgery Patient with Osteoporosis","resp_content":"Have you gone through menopause yet? If not, the good news is that you don't get a diagnosis of osteoporosis until you do. At age 32, you're probably still building some bone - haven't reached your peak mass yet.\n\nWhy did they do an initial DXA on you in the first place - because of the surgery? Even so, to have a DXA at that young age - it would always show low bone density simply because you hadn't reached you maximum bone density. That usually happens around age 35.\n\nWhile a broken toe is painful, it's not counted as anything towards osteoporosis. Toes and fingers get a free pass.\n\nToo, unless you've gone through menopause, you wouldn't be prescribed a medication. They're only approved for post menopausal women.\n\nWhat you do need to do is consume around 1200 mg of calcium a day. Spread it out as the body only absorbs 500-600 mg at a time. Try to get as much as you can in your diet. Read your food labels carefully. If it says 25% calcium, that's 250 mg. 30% calcium would be 300. Just replace the % with a 0.\n\nIf you haven't had your Vit D levels checked, ask your GP about doing it. We're finding most people are low.\n\nI'd look for a calcium supplement with Vit D added. There are lots on the market. With calcium, cost doesn't indicate effectiveness. Be sure to read the dosage label as some calciums require 2-4 pills to = a dose. You probably don't want that. Calcium citrate is easier on the digestion and is more readily absorbed than calcium carbonate. A dose of calcium citrate is 2 pills; therefore to get 1200 mg you'd take two at lunch and two at supper. Citracal is an example of calcium citrate. Tums, Oscal, Viactive are all calcium carbonate.\n\nWe recommend that our patients have at least 4 hours a day on their feet. Walking is a good exercise for you. Aim for 1/2 hour three times a week for a minimum.\n\nYou can go to the National Osteoporosis Foundation website (www.nof.org) for a lot more reliable information.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/1582/32-yr-old-bariatric-surgery-patient-with-osteoporosis"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"11 Things to Avoid for Bone Health","post_content":"From too much salt to overdoing it on some drinks, see which lifestyle choices could be bad for your bones: http://wb.md/2fmIx1s\n\nWhat lifestyle changes have you made to better your bone health?\n\nSign in or sign up to join the conversation.","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/1368/11-things-to-avoid-for-bone-health"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Scared to start exercising again...","post_content":"I've recently been diagnosed with osteoporosis after a break in my lower leg during a workout bootcamp class. I'm all healed up now but I'm hesitant to get back to working out. I'm afraid to do anything too strenuous because I don't want to go through that ordeal again. Before the break I was a very active person. I did bootcamp twice a week, was in a tennis league and went on long walks almost daily. A friend suggested I try yoga, and I've been doing that without problem. I want to add in more exercises but I'm scared. Any suggestions of what's safe to do?","like_count":"0","tags":["Exercise"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Scared to start exercising again...","resp_content":"I hope that someone is able to chime in soon with some tips from personal experience and words of encouragement.\n\nIn the meantime, here is a slideshow that outlines some exercises that can help to boost bone health: http://wb.md/2e4GXBY It may be a good idea to speak with your doctor before you begin a new exercise routine to make sure that it is right for you.\n\nHope you'll check back in and let us know what's working!\n"},{"author":"madmanacrossthewater","resp_time":"over 3 years ago","resp_title":"RE: Scared to start exercising again...","resp_content":"You need to exercise, if you do not you will lose bone mass and the chances of even worse fractures increases. Mild strength training will increase your muscle and bone strength. Best bet is to speak with PCP about this issue.\n1\n"},{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Scared to start exercising again...","resp_content":"You need to exercise, but modify your routine to eliminate any moves that twist the spine or that require bending forward from the waist. For example, no toe touches, abs or side to side twisting. Yoga is good, but again, modify your moves. Did your doctor recommend that you go on a medication? If so, take it as prescribed and be sure to get 1200 mg of calcium a day - taken 600 mg with a meal. The body won't absorb more than that at one time. Any excess will be eliminated in your urine. The National Osteoporosis Foundation website has good illustrations of what exercises/move to do and to avoid. Check it out www.nof.org.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/932/scared-to-start-exercising-again"},{"post":{"author":"toisraelwithlove","post_time":"over 3 years ago","post_title":"Osteo blues","post_content":"I've had 4 fractures in this past year and I'm really down over it. What are some ways I can improve my mineral bone density? This can't keep happening or else I'll be permanently disabled and I'll lose any and all independence I have.","like_count":"0","tags":["Exercise","Bone Density","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Osteo blues","resp_content":"Hi toisraelwithlove I'm sorry to hear that you have had to heal from 4 fractures this year. Have you had a discussion with your doctor to determine what kinds of treatments may be available to help you boost bone density? This overview of osteoporosis has some information on different treatment options that you may find helpful to discuss with your doctor: http://wb.md/2cPbjM6\n\nI think that this slideshow about how to prevent fractures if you have osteoporosis may be particularly interesting for you: http://wb.md/2cKx0K1 It has a lot of great tips you may wish to consider.\n\nYou may also be interested in this slideshow of exercises that can help boost your bone health: http://wb.md/2cGCx1Q (You should check with your doctor to make sure that these exercises are ok for you to do before beginning).\n\nAs well as these 11 foods that are good for your bones: http://wb.md/2crGlYK\n\nI hope you find these helpful and that you'll check back in and let us know how you're doing!\n"},{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Osteo blues","resp_content":"If you've had 4 fractures, you probably need to talk to your doctor about an osteoporosis medication. Were the fractures nontraumatic ones? That is, any fracture from a standing position? These are red flags for osteoporosis.\n\nThe medications are tested and proven to reduce your risk for fracturing. Forteo is the only medication that will actually build new bone. Go to the National Osteoporosis Foundation website (www.nof.org) for side by side comparison of the medications currently available.\n\nFYI - a lot of people want to do thinks \"naturally.\" Just so you know, there is NOTHING natural that will increase your bone density once you've passed menopause. Only an approved medication will help you at this point. For sure you don't want any more fractures.\n\nAlso keep in mind that along with the medication, you'll need to consume 1200 mg of calcium and 1000 IU of Vit D each day or the medication won't work effectively. It's be a shame to be taking medicine and not have it working correctly.\n\nYou should also avoid any forward bending of the spine or side to side twisting of the spine. The repetitive movements can cause the tiny honeycomb bone within your spine to fracture, leading to a non-reversible compression fracture. Also no jogging. Walking is very helpful, but no jogging (it pounds the vertebrae)\n\nFractures are painful and scary. I hope you get on a medication and don't experience more breaking.\n1\n"},{"author":"klmwi","resp_time":"over 3 years ago","resp_title":"RE: Osteo blues","resp_content":"That is scary. Ive had a few bone density tests and a specialist wanted me to take bisphosphonates. It was his only solution. He expressed amazement that I thought there should be a dietary solution. I read about the drugs and was afraid to do it. They kill off some of your cells, the ones that break down bone. But when I was menopausal, I followed doctors advice, and took hormones. A few years later, it was in the news that this hadnt been too good for women after all. It increased their risk of some things, like stroke, I believe. Doctors always used to encourage use of calcium supplements. Recently that was in the news, that it wasnt a good idea. We should get calcium from food, or else it causes calcium deposits in our arteries. So, Im untreated for osteoporosis. I just walk briskly every day 20 minutes. I go by the new motto: sitting is the new smoking. I tend toward a sedentary lifestyle, but Im antsy, up and down. I wonder what the future holds for me.\n"},{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"","resp_content":"That's an easy question to answer: your future holds more fractures, pain and decreased independence.\n\nI understand your questioning meds and calcium because the news only gives you partial information. They want more viewers to tune in so they do the scary one minute scoop. The fact is the hormone study done in 2002 was on only one hormone - estrogen/progestin. It was not studying estrogen alone. The reason women's bones lose density after menopause is the loss of estrogen.\n\nAs for calcium - of course you should get as much from foods as possible and then supplement for the remainder of your daily need of 1200 mg. The problem with the arteries comes when you consume too much calcium and your blood serum calcium level increases by 1%. In order to consume too much calcium, you would have to knowingly do this and schedule your calcium consumption. The reason is because your body will not absorb more than 600 mg at a time. You pee out any excess. It's very difficult to get more than 2000 mg a day into your body.\n\nYour risks for future fracturing and a compromised lifestyle greatly outweigh any medication possible side effect.\n\nEverything we put into our body has the potential for side effects. Delicious foods like strawberries and shrimp can be deadly to some people. Prednisone has horrible side effects, yet it saves lives. Even the sun can have worrisome consequences to those who have allergies or develop skin cancer.\n\nThe longer you wait to start a medication, the greater your chances of fracturing again and the more bone you lose that can't be recovered.\n\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/492/osteo-blues"},{"post":{"author":"xprincessdoomx","post_time":"over 3 years ago","post_title":"Ankle injury","post_content":"So a few weeks ago I took a pretty bad, hard fall. Twisted my ankle and ended up with a nice scrape on my knee. I thought I had a normal sprained ankle but I didn't. I had a slight limp but could still walk. Unlike normal ones you can't walk on it at all.\n\nWell, I looked it up and from what I could find its a high ankle sprain but its still hurts. I can put weight on it but I can't stand on tippy toes without pain or just coming back down quickly. If I put pressure/weight on the inside of my ankle, like if I'm trying to move around in bed, it hurts like a *** on the outside of my ankle and somewhat in the back.\n\nI know this may be a waste of time to post but I don't know what exactly is wrong. Is it a muscle, a tendon, I don't know. When I was in high school I had a similar thing happen but it was in the middle of my leg but I was on crutches cause I could not walk on it at all. Even then, I don't know what it actually was. My guess is that my muscle tore or something. That healed within a week or 2. Still had a tiny bit of pain depending but nothing like what I'm having now.\n\nI don't know how to keep from making it worse and wrenching it. I know xrays will be a waste of time cause I if anything was broken I'd know, I've been there with my hand, so I guess I don't know what the hell to do.","like_count":"0","tags":["Living & Managing","Symptoms","Treatment"]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Ankle injury","resp_content":"You need to see a doctor and possibly have an x-ray. You could have a stress fracture or a torn tendon.\n"},{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Ankle injury","resp_content":"Hi xprincessdoomx , bonebabe is right. The best thing that you can do is to see your doctor for an exam of your ankle. As this article says ( http://wb.md/2dqj4UG ) the symptoms of a sprain and of a fracture are very similar, and sometimes fractures can be mistaken for sprains. The sooner you have your ankle evaluated by your doctor, the sooner you can get the appropriate treatment.\n\nThe above article explains some first aid measures you can take (rest, ice, compression, elevate) that you might take as you wait to see your doctor, as well as treatment options for different ankle injuries that your doctor may discuss with you at your appointment.\n\nI hope you will check back in soon and let us know how you are doing!\n"},{"author":"xprincessdoomx","resp_time":"over 3 years ago","resp_title":"I was trying not to do that just because I just had a *** ton of medical issues on my hand, xrays, MRI and they couldn't find ANYTHING on any tests of whats wrong with it and told me to \"Deal with it.\" I go in soon for something else and plan on mentioning it. Its just sucky timing cause I go to LA in 2 weeks! ARG. Thanks for your comment, I'll talk to her and see what she suggests.","resp_content":"Reply\nAnonymous\nover 3 years ago\nsee a doctor now\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/673/ankle-injury"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"11 Unexpected Foods That Are Good for Your Bones","post_content":"Find out which foods can keep your bones healthy by helping to prevent bone loss, ward off bone disease, and improve bone density: http://wb.md/2dQ2xKy\n\nHow many of these foods are a part of your regular diet?\n\nSign in (or sign up to become a WebMD member -- see link in the upper right corner of this page) and share your thoughts.","like_count":"0","tags":["Diet"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/872/11-unexpected-foods-that-are-good-for-your-bones"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"Other ways to strengthen bones?","post_content":"I take calcium/D supplements and exercise, but are there other things I should be doing to increase and maintain bone mass? Does anyone have luck with natural treatments or other supplements?","like_count":"0","tags":["Treatment"]},"responses":[{"author":"bonebabe","resp_time":"over 3 years ago","resp_title":"RE: Other ways to strengthen bones?","resp_content":"Calcium, Vit D and exercise are essential to everyone in building and maintaining bone health. However, if your bone density is already low, or you have an additional risk factor for fractures, you need more than this. Calcium and Vit D will not restore lost bone, only a medication can do that.\n\nThere are no effective natural treatments to counteract bone loss. Save your money.\n\nYou need 1200 mg of calcium a day, taken several hours apart as the body can only absorb 500-600 mg at a time. If your Vit D levels haven't been checked, ask your doctor to do that and then dose accordingly.\n"},{"author":"WebMD Addie","resp_time":"over 3 years ago","resp_title":"RE: Other ways to strengthen bones?","resp_content":"bonebabe has already given some great tips. Just to add to what she has said, here is an overview of osteoporosis that you may find interesting to look through ( http://wb.md/2cHREbT) . It has information on medications that can help reduce bone loss and fracture risk and may actually help build some bone density, as well as some natural things you can do to promote your bone health.\n\nAs bonebabe said, exercise is important if you have osteoporosis. This slideshow is filled with exercises to boost your bone health and explains that exercise can help reduce bone loss (not bring back what you have already lost) and can build stronger muscles to support you: http://wb.md/2cm0hcR\n\nFood is also something that you can focus on to help you build stronger bones. This slideshow has some unexpected foods that are good for your bones that you may want to check out (things like calcium-containing dark greens, figs, and more: http://wb.md/2cRRkHS)\n\nAlso, here is a list of foods that aren't so good for your bone health ( http://wb.md/2cqVhoN) -- things that could actually be sapping your calcium supply.\n\nHave you been working with your doctor to develop a plan to combat any future bone loss? This article has some information about calcium, vitamin D, and more, that you may find helpful to discuss with your doctor: http://wb.md/2cE8dXl\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/325/other-ways-to-strengthen-bones"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Where do I start?","post_content":"Whether you’ve just been diagnosed, or you’re an osteoporosis veteran, this message board has articles, videos, tips, and best of all support to share with you. The Osteoporosis Health Center is a great place to start your hunt for information ( http://wb.md/29r1or6) .\n\n- Looking for foods that can help strengthen your bones? This slideshow has some contenders: http://www.webmd.com/osteoporosis/ss/slideshow-superfoods-for-your-bones\n\n- More interested in exercises to boost bone health? We have you covered there too: http://www.webmd.com/osteoporosis/ss/slideshow-exercise-to-boost-bone-health\n\n- Or are you just looking for some general information on osteoporosis and what a diagnosis means? If so, this slideshow can hopefully answer some of your questions: http://www.webmd.com/osteoporosis/ss/slideshow-osteoporosis-overview\n\nWe hope you’ll find the information, support, and sense of community that you are looking for here, and can’t wait to hear from you all.","like_count":"0","tags":["Exercise","Bone Density","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/123/where-do-i-start"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Welcome to the Osteoporosis Message Board","post_content":"We are so excited to finally be able to share our new boards with you!\n\nJust a few housekeeping things to go over before you get started:\n\n- Bookmark this page so you can easily find us any time\n\n- Make sure you check back frequently as conversations are always being added and expanded\n\n- Head on over to your Message Board profile (just click on your account avatar in the top right corner of the page) to update your personal story and add a photo\n\n- Don’t see what you’re looking for? Look through the tags at the top of the page to customize your view to only see posts that interest you\n\n- When creating a post, choose a tag to add that most clicks with you. (Using tags is encouraged but not required.)\n\n- Like what you see? Or need help? Send us an email at CommunityManagement@webmd.net","like_count":"0","tags":["Exercise","Bone Density","Diet","Living & Managing","Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/osteoporosis/102/welcome-to-the-osteoporosis-message-board"}]