[{"post":{"author":"sharilynne56","post_time":"1 month ago","post_title":"hemorrhagic stroke","post_content":"can hallucinations be a symptom from a hemorrhagic stroke?\nMy father in law is seeing things that aren't there","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/110504/hemorrhagic-stroke"},{"post":{"author":"soulcage2","post_time":"3 months ago","post_title":"What Is Going On","post_content":"Here is my story I went to the ER my bp was 222/129 I was feeling very very dizzy they got my bloodpressure down to 127/84 did a cat scan which showed no sign of stroke. I was relieved until I found out Catscans don't always pick up strokes. Four days into this they diagnose me with vertigo and send me home with meds for dizziness I've had no other symptoms but severe dizziness and unbalance. I have a growth in my ear and diabetes/hypertension any advice or comfort will be nice am I eventually gonna have a stroke","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/106168/what-is-going-on"},{"post":{"author":"alexpdx","post_time":"5 months ago","post_title":"My mom recently suffered a intercranial stroke","post_content":"Happened last week while she was working out at the gym, her left side went limp. Apparantly she had been suffering from a brain bleed.\n\nSo I need some answers. For a few days after the stroke she could barely open her eyes because of swellness of the brain, but could talk although we could barely hear her.\n\nTowards the end of the week she was complaining about how often the nurses were coming at night to do assessments (every 15 minutes) and she was barely getting any sleep.\n\nFinally the neurologist started allowing more time between assessments (2-3 hours). For the last few days all she has been doing is sleeping and when she wakes up, it's for a short period of time. The last two days she's barely said a word. She said yesterday she had a sore throat and didn't feel like talking (and her nose has been stuffy). However, it's difficult for the nurses to do any assessments because she isn't talking.\n\nAlso, she has been on Manitol to reduce the swelling in her brain. When she's on it, her afib and blood pressure go crazy, especially at nice. She already has a history of afib so I'm curious to know why they would give her something like this?\n\nToday some positive news. There's a good chance she will be getting moved to the neurology floor. My sister is still concerned that she has barely spoken since yesterday. My main concern is the sleeping. I know it's important for her to sleep cause it helps the body heel, but it seems she's sleeping a bit to much, is this normal?\n\nSorry for the long post but I am a little concered/confused/scared and annoyed over the whole situation.","like_count":"1","tags":[]},"responses":[{"author":"sabrina198","resp_time":"4 months ago","resp_title":"RE: My mom recently suffered a intercranial stroke","resp_content":"Sorry to hear about your mom. I hope she will get well soon. Talk with her doctor.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/102200/my-mom-recently-suffered-a-intercranial-stroke"},{"post":{"author":"38yostroke","post_time":"7 months ago","post_title":"Cerebellar Stroke","post_content":"I was 38. Typical Friday night. Teenage son has best friend overnight and teenage daughter at her friends house. headed to bed with slight headache. (2 teen boys + soda, candy, and ps4) then 1st the vertigo, 2nd, worse headaches, 3rd vomiting, then the dizziness so bad I could barely stand. Entire weekend. Better by monday. Except vision and balance. = cerebellar stroke. Getting better with balance but not vision. Neuro doc says just get used to it. Is there any treatment?","like_count":"0","tags":[]},"responses":[{"author":"rosiecont","resp_time":"6 months ago","resp_title":"RE: Cerebellar Stroke","resp_content":"In general, if the condition is not very serious, the cerebellar stroke can recover naturally, but it may take 3 to 6 months.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/97892/cerebellar-stroke"},{"post":{"author":"taz2728","post_time":"7 months ago","post_title":"Tattoo after stroke","post_content":"My suffered a stroke a year ago, is it ok for her to get a tattoo? Will there be compliations?","like_count":"0","tags":["Living & Managing"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/96863/tattoo-after-stroke"},{"post":{"author":"leighhunt56","post_time":"11 months ago","post_title":"Was it tia","post_content":"On April 10th I had an episode...diuble vision..slurring..dizzy..but I waited 4 days til I saw my heart Dr. Who said I had tia and sent me to a neurologist. My symptoms lasted for a good week and I still have some of the exact symptoms. I'm. confused because I thought 24 hours was the limit with a tia to have the symptoms. It's been 6 weeks for me and I still can't see right half The time.. Is there something other than a tia that may have been overlooked that mimics the tia?","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/90207/was-it-tia"},{"post":{"author":"kiplund","post_time":"11 months ago","post_title":"Seizure medications","post_content":"I have a friend who had a stroke years ago. Her long-time doctor has her on a regimen of pills that has me concerned. In the morning, she takes Aspirin EC 81 mg; Levothyroxine 50 mcg; Memantine Hydrochloride 14 mg; phenytoin sod ext 100 mg and Levetiracetam (Keppra) 1,000 mg.\n\nIn the late afternoon, she takes Valsartan 160 mg; Memantine Hydro\nchloride 14 mg; Losartan Potassium 100 mg and Donepezil HCL 10 mg.\n\nSome of these are for high blood pressure and signs of dementia. I think that all of pills are having a detrimental effect on her ever lessening condition. Could I please get some opinions on this?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/89376/seizure-medications"},{"post":{"author":"mn310","post_time":"11 months ago","post_title":"Need advice asap","post_content":"This afternoon my stepdad had a massive stroke and is currently in the ICU. He is going to need long term care if he survives. They are states away from home visiting my family. The hospital said he will not be able to leave the area for quite some time, if at all. The hospital is 3 hours from where I live and my mom has nowhere but the hospital to stay. Does anyone have ANY advice on what my mom can do for living arrangements? She cannot afford a hotel and apartments are expensive where the hotel is located. What resources are out there for her while he recovers in a long term care facilty","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/89037/need-advice-asap"},{"post":{"author":"WebMD Morgan","post_time":"over 1 year ago","post_title":"How a Massive Stroke Changed My Life for the Better","post_content":"Before his stroke, Ted Baxter was a globetrotting businessman who was at the top of his game. Then one day in April, at the age of 41, with no warning signs, he suffered a massive stroke. For a while, his family and doctors didn’t think he would survive. He did. But his life would never be the same.\n\nLearn more about Ted W. Baxter's journey and why he says that his life is better than it ever was before his stroke: https://bit.ly/2xQUBSU","like_count":"0","tags":["Silent Stroke","Prevention","Caregiving","Symptoms","Diagnosis","Blood Clot"]},"responses":[{"author":"navya4","resp_time":"over 1 year ago","resp_title":"RE: How a Massive Stroke Changed My Life for the Better","resp_content":"Super! I had one 3 years ago ( and a heart attack ). I just can't seem to get any energy and the slightest exertion makes me short of breath! Any suggestions?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/67466/how-a-massive-stroke-changed-my-life-for-the-better"},{"post":{"author":"luciusbalsley","post_time":"over 1 year ago","post_title":"Multiple strokes and massive tooth loss","post_content":"Its 2018, i have endured multiple strokes , im in generally good health at 57 yrs old. No family history of strokes.the va doctors cant determine why im having these strokes. Stroke doctors from penn medicine cant figure out why im having strokes. They put me on blood thinners to help prevent a clot. Is it possible the poisen i drank for a year in lejune has something to do with this.","like_count":"0","tags":[]},"responses":[{"author":"1antoinette1patt","resp_time":"over 1 year ago","resp_title":"RE: Multiple strokes and massive tooth loss","resp_content":"I just had TIA Stroke.I don’t know what to do. I am just scare. Just a little numbness and weak on the right side.\n1\n"},{"author":"1antoinette1patt","resp_time":"over 1 year ago","resp_title":"Pray","resp_content":"Reply\nmarcy62\nover 1 year ago\n1antoinette1patt: be brave!\nReply\nnavya4\nover 1 year ago\n1antoinette1patt: see a doctor post haste !!!\n"},{"author":"navya4","resp_time":"over 1 year ago","resp_title":"RE: Multiple strokes and massive tooth loss","resp_content":"What poison?\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/59526/multiple-strokes-and-massive-tooth-loss"},{"post":{"author":"shawna_c2009","post_time":"over 1 year ago","post_title":"TIA?","post_content":"On Sunday 9/30/2018, sitting down with a cold drink in a coffee place, I experienced something I have never felt before. My head started to feel weird and my vision was completely or at least it felt as if I was crossed eyed. I didn't know what was happening but I turned to my 11 year old daughter and asked if my eyes were crossed. She told me they were not. I was tempted to call 911 but I didn't because I was in a crowded place and figured this would pass. It did pass I'd say after about a minute or so. It was frightening and I saw an NP today and they took blood but didn't assign any other testing. I'm concerned this was a warning for a stroke.","like_count":"0","tags":["Silent Stroke","Symptoms"]},"responses":[{"author":"puggielover","resp_time":"over 1 year ago","resp_title":"RE: TIA?","resp_content":"Hi read your post sounds like what happened to me a couple of times feeling weird in head vision messing with me second time I went to ER and they admitted me and after a dozen tests they found out through an MRI that I had had a mini stroke a TIA so just beware if it happens again get to the emergency room or a doctor quick\n"},{"author":"navya4","resp_time":"over 1 year ago","resp_title":"RE: TIA?","resp_content":"Yes, it very well may be!!! Find another doctor! I had a stroke 3 years ago and then I \"thought\" it passed. I went home and then in the middle of the night i had a full blown stroke! Now I'm paralyzed on my whole left side. When I had the first warning, the hospital emergency room doctor wanted me to stay over night for observation. I foolhardily rejected that idea. Boy, do I ever regret that decision!!! Because if they catch it within the FIRST THREE HOURS there is a protocol that they can use to stop the stroke and restore you to normalcy! Don't make my mistake and\nRuin your life!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/67910/tia"},{"post":{"author":"aj8888","post_time":"over 1 year ago","post_title":"Hemorrhagic Stroke/","post_content":"I had a massive hemorrhagic stroke 9/27/17, Had no memory of treatment until I had a ventriculoperitoneal shunt surgery on May 20 2018, I'm having extreme light headiness when getting up, and any time I'm moving around. Is this normal ?","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/67727/hemorrhagic-stroke"},{"post":{"author":"marcy62","post_time":"over 1 year ago","post_title":"2005 March two stroke ( 2 days apart)","post_content":"10 years neuropathic pain\n2018 I have a DBS","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/65729/2005-march-two-stroke-2-days-apart"},{"post":{"author":"lwill89","post_time":"over 1 year ago","post_title":"What's next","post_content":"Hi I'm a 29 yr old female . 3 yrs ago on April 20, 2015 age 25 I had a massive stroke completely paralyzed on my left side I went from a healthy active wife and mom of 3 to someone changing my diaper feeding me and completely dependent on someone else I went thru extensive therapy and pushed myself bck on my own feet for the most part but my health has spiraled down so much I can't get one problem taken care of before another one shows up my memory is for the birds and now I'm currently being poked and prodded on bc my platelets r not workin at all and i gave almost bled to death 2 times this year the 2nd time I had to b given 4 units of blood in 12 hours and almost didn't come back !! What can I do to get ahead of this or will I live out my days like this ??? For got to add the fact I have suffered from seizures since May 8th after my stroke also","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/64542/what-s-next"},{"post":{"author":"pcmiller29","post_time":"over 1 year ago","post_title":"2nd stroke affecting both sides of brain","post_content":"Hello,\nAbout 1 - 2 months ago my 75 yr old mother had her first massive stroke on the right side of brain. She had gotten weaned off the vent and was paralyzed on left side. She had trouble finding the right word to use when speaking. For instance, if she wanted to say \"911\" shed say \" fire station\" or \" doctor\". She has now had another massive stroke this time affecting the left side of the brain. She is unresponsive and constantly sticks out her lips and tongue. She doesn't seem to react to pain or fright, doesn't follow commands but can move both eyes. She stares at the ceiling lights or EKG machine. Echo cardio came back good and only went into afib once since stay. There's a small bleed so they stopped blood thinners. Eeg showed decreased brain waves. Neuro says 1/3 damage to each side of brain although right side was previously told 1/4.She does move her left arm and very small movement in right arm.when run pen under right food she moves it. She's had pneumonia which they say has went away but one of the blood samples they took showed infection so waiting on updated blood test result. She's had light blood in urine and stool. Neuro says she'll be vegetable and most doctors tell me just to make her comfortable. Is it wrong to give her some time, like we did we did with first stroke to see if she improves? Any and all advice appreciated.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/57428/2nd-stroke-affecting-both-sides-of-brain"},{"post":{"author":"muma56_57","post_time":"over 1 year ago","post_title":"Hi, I'm Elizabeth from Puerto Rico,five years back I woked up feeling rare,and my left side of the face(head included) and left arm complety was numb or at sleep. I went to the hospital,they did a CT scan but they said nothing was wrong the symptoms to","post_content":"Was it a TIA or what","like_count":"0","tags":["Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/57261/hi-i-m-elizabeth-from-puerto-rico-five-years-back-i-woked-up-feeling-rare-and-my-left-side-of-the-face-head-included-and-left-arm-complety-was-numb-or-at-sleep-i-went-to-the-hospital-they-did-a-ct-scan-but-they-said-nothing-w"},{"post":{"author":"nar1977","post_time":"over 1 year ago","post_title":"Encephalomalacia After Stroke","post_content":"My brother had a stroke 4 years ago with right side paralysis and now he has recovered but still his speech is not clear and cannot pronounce words. Also he has difficulty understanding and has memory loss. Also he has pain in his right hands and legs. He also says that he feels his whole of right side has become heavier and feels swollen though I can't see any swelling. So he sleeps on his left side most of the time as he feels like he's falling from a high mountain if he lays down on his right side.\n\nHis recent CT scan of the brain shows this \"Old ischemic changes in left temporo parieto-occipital lobe with changes of encephalomalacia and surrounding gliosis, Sequal of old ischemic insult\"\n\nI want to know how serious is this and if left untreated will this progress as he gets older and is this life threatening. What all damage to his body this can cause as I have read online that Encephalomalacia cannot be cured and has dangerous consequences. So I am very worried. Any clear explanation is highly appreciated.","like_count":"0","tags":["Silent Stroke","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/56852/encephalomalacia-after-stroke"},{"post":{"author":"eypreal","post_time":"over 1 year ago","post_title":"CBD for stroke is real..","post_content":"I am about to give up on my life when this tragic happen to me. One day, while I was driving i, felt a sudden numbness or weakness in my face, arms, and legs, especially on one side of my body. I stop by the nearest store that i saw and call my mom about it. We don't know what to do about what happened to me. But my mom's friend told us to try the CBD treatment at first i don't like because i know its marijuana and maybe i will just get high but he explained to me the benefits of it then i try it and as of now im ok but I'm still taking that as a medicine for maintenance. Just look for this site and learn more https://www.worldwide-marijuana-seeds.com/","like_count":"0","tags":["Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/56769/cbd-for-stroke-is-real"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"I had a stroke in April 2018. Where is the excess fluid coming from when I take Furosemide? I also been diagnosed with CHF","post_content":"My legs, ankles and feet are very swollen. Plus I noticed that I can only walk a little bit before o get shortness of breath.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/56652/i-had-a-stroke-in-april-2018-where-is-the-excess-fluid-coming-from-when-i-take-furosemide-i-also-been-diagnosed-with-chf"},{"post":{"author":"royparker2020","post_time":"over 1 year ago","post_title":"Is it true that risk of stroke can reduce by 60% with regular sauna baths?","post_content":"So far i have heard that eating green vegetables, having adequate sleep and exercising enough are those factors that can lower chances of stroke. But, I came across a write up that says study has found an unanticipated way to boost health – going to sauna. Is it possible?","like_count":"0","tags":["Silent Stroke","Prevention","Symptoms","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/55013/is-it-true-that-risk-of-stroke-can-reduce-by-60-with-regular-sauna-baths"},{"post":{"author":"williestewart","post_time":"over 1 year ago","post_title":"Stroke","post_content":"Stroke!!!!!!!!!!!!!!!!!!!","like_count":"0","tags":["Silent Stroke","Prevention","Caregiving","Symptoms","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/54611/stroke"},{"post":{"author":"jeffjak","post_time":"over 1 year ago","post_title":"Questiob about whit matter disease -> RPLS","post_content":"I had a stroke in Dec. 2012 that was complicated by white matter disease,specifically RPLS. The hospital report I have stated that part of the MRI procedure, \"extensive confluent white matter changes\", were found. I was wondering if these changes ever go away or if my brain is forever altered.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/54528/questiob-about-whit-matter-disease---rpls"},{"post":{"author":"psicare","post_time":"over 1 year ago","post_title":"Stroke","post_content":"I'm 71 and I've had two strokes. The second stroke my family was\ntold that I was going to die. However, I fooled the doctors. My\nconcern is I had exrays taken of my brain. I often was asked if\nI had been shot in the head. I told them no, but thought they\nwere teasing. When I had my last stroke, the doctor was talking\nto my husband. My husband told me that I had a metal plate\non the left side of my brain. I didn't know that, but after talking\nto the doctor discovered that when I was 12 my mother had my\nears put back because they stuck out. I had big ears and she\nuse to laugh at me. My left ear didn't go all the way back and\nto get that ear to go back due to not having enough cartilage.\nHe put it back with a metal plate, but it still sticks out a bit. My question is, if I have a stroke under this metal plate, can I survive?\nForgot to mention, before having the strokes I would get a very\nbad headache and then go into a coma, then have a stroke.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/54032/stroke"},{"post":{"author":"32847paraguay","post_time":"over 1 year ago","post_title":"Allergy related TIA","post_content":"add.\nI am 73 years old. no diabetes, no hypertension, vegetarian,\n5'10\" 158 lbs. exercise daily.\nThat TIA last only 10 minutes. after 4 days later, I had another allergic reaction same as before. then, next day I had experience a small dizziness 10 seconds.\nSo this is not co-incident I think.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/53940/allergy-related-tia"},{"post":{"author":"32847paraguay","post_time":"over 1 year ago","post_title":"Allergy related TIA","post_content":"I had acupressure treatment with face-down posture.\nsuddenly I had a little nausea experience.\nthen, I had urticaria on my left arm and groins with severe itching.\n\nafter 1 or 2 hours later I lost power on my left arm and fingers.\nI called 911 and went hospital ER, checked head CT-scan and MRI.\n\nUltrasound carotid. everything was normal.\ndoctor said allergy and TIA are not related each other.\nbut doctor said this is co-incident.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/53935/allergy-related-tia"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"What happened to my grandpa?","post_content":"My grandfather is 67 years old, and this morning, as he was searching for a park space at the store, he began to feel a pain in his side. Within minutes he suddenly became confused. For example, he thought a tree was a parking spot.\n\nIn the midst of his confusion he rams into a parked car. He had no idea what he had just done. He didn't even know who I was or where we were anymore and he was yawning like crazy, barely able to speak.\n\nI called 9-1-1, and when they arrived, they said his vitals were completely normal. And within 10 minutes he went back to his normal self, able to walk and talk as if nothing had happened. Yet, he didn't remember hitting the car. When we went to the hospital, I originally thought he had a heart attack, but a few tests showed that his heart was perfectly healthy.\n\nThey're going to run more tests, because his blood pressure spiked right before they were about to release him. But as of now, there is no explanation. Could this have just been a stroke? What are the chances of it happening again?","like_count":"1","tags":["Silent Stroke","Symptoms","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 1 year ago","resp_title":"RE: What happened to my grandpa?","resp_content":"Also, he has had no prior health problems and is on no medications.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/52334/what-happened-to-my-grandpa"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"What could I possibly be experiencing?","post_content":"Hello,\nFour days ago I had a microwave fall onto my head. It hurt a lot and I had a ringing in my head after that incident. I was alright nonetheless, just a little hurt from the microwave.\nIn under 28 hours, I had a long day and then I was going to bed (I have been crying the whole day so my heart was hurting). As I was laying down I weirdly had a huge pop in my left ear, extremely sharp pains on the back of my head, my left shoulder and left foot couldn’t move. I was then able to lay on my bed unstuck 30 seconds after. Nonetheless i had a very hard time rolling over it changing positions. The next morning, I felt like I was out of breathe, uncoordinated, and had extreme headaches to the point where I felt dizzy. I also felt as if I couldn’t really hear out of my left ear well enough. Right now I still feel tired. I still feel depressed so my heart is still hurting. I can move my body normally but I just feel the need to stay in bed because I am tired and depressed. I have a buzzing in my ear again, but my head is feeling okay pain wise. I don’t know what’s going on with me, is it something as severe as a stroke or am I going through extreme depression?\nI was at the doctor for something like a stroke incident, but it was more of an intense headache about 2 months ago\nMy father recently had a stroke.\nAlso I have been having anxiety attacks the past few months.","like_count":"0","tags":["Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/52284/what-could-i-possibly-be-experiencing"},{"post":{"author":"Anonymous","post_time":"over 1 year ago","post_title":"mild stroke after using sidenafil","post_content":"I developed mild expressive aphasia 2 hours after using 40 mg sildenafil & intercourse. I have hypertension &type 2 diabetes. Have used sildenafil for 10 years without problem. stroke was confirmed by ct scan. Now concerned about using the drug again.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/50922/mild-stroke-after-using-sidenafil"},{"post":{"author":"saltyspur","post_time":"over 1 year ago","post_title":"Help!","post_content":"20 yo female, previous history of kidney disease and hypertension, both well controlled via surgery and Lisenopril prescription (BP usually 110/65). Currently on Lutera-28 birth control as approved by my doctor (0.02mcg estrogen). So I'm pretty sure I'm totally being a hypochondriac here (pre-med), but about a hour ago I got a pain in my left chest area when breathing in. It isn't that bad anymore but is still there a little bit. I've had 2 microbiology exams today and have an organic chemistry one in an hour, so very very stressed today. But chest pain and anxiety are symptoms of pulmonary embolism which are sometimes caused from BC..... help!","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/49767/help"},{"post":{"author":"sholleri","post_time":"over 1 year ago","post_title":"Summary at top 54 y/o Mom PLZ HELP dangerous symptoms no dx (blood test result incl)","post_content":"Summary of symptoms for anyone who cannot or does not want to read the detailed symptoms:\n*I have taken her to ER twice the first time they checked her heart and said nothing came up. The 2nd time 2 days ago they did a d-dimer, contrast CT and sent her home!! I asked them to scan her brain they didn’t and they only put Diagnosis of coughing up blood - she complained of right leg Charlie horses and they did not even check for a blood clot!\n\nSymptoms List Summarized:\n-chest pain over a year now\n-at ER 2 nights ago she described it as a constant pain in her left upper side of her chest\nCoughed up blood clot 2 weeks ago\n-Fatigue\n-nose bleeds\n-Anxiety and Stress (she attributes to being from her job and some of it probably is)\n-Feels like it’s hard to swallow\n-she is always clearing her throat\n-recently I see her grabbing her neck more and more (universal sign for choking)\n-lack of balance\n-dry cough\n-feels like she is congested\n-coughed up almost a 1 inch blood clot less than 2 weeks ago\n-Charlie horse pains often in her right foot and lower leg (sign of DVT)\n-she described to me she “felt like there was a blood clot in her neck”\n-she physically looks drained\n-she seems to know something is wrong\n-she is forgetting things she never should forget (she bought my baby an elephant and it’s head and ears flap - she was SO happy to show my baby this toy and less than ONE or TWO months later, she asked me who got it for my daughter!! I almost cried because I know something is wrong.)\n-today she was holding my daughter standing still and lost her balance and said “woah” this has happened more and more frequently!\n-severe constipation (thinks her bowels were impacted and couldn’t be go to bathroom for a week!)\n-dehydration\n-extremely thirsty\n\n*My Dad thinks her tripping is normal and I think he is blinding himself to it because he doesn’t pay enough attn or he thinks it’s normal and he said he forgets stuff sometime and loses balance but I can tell you for a fact he doesn’t and if he does it’s nothing like my Mom has been!\n\n\nDetailed explanation and symptoms:\nI need help getting my Mom diagnosed and admitted to a hospital until they are 100% positive about her diagnosis.\n\nMy Mom has had chest pain for over 6 months, probably a year. She coughed up Blood 2 weeks ago and is not a smoker. In November, when I knew something was wrong; I told her to go the ER - I made her go quite honestly. They did an EKG, and said everything was fine and her heart looked good. I know she has a lung problem, thyroid problem and possibly a brain problem. I am positive because of handwriting analysis. I backed off for a while after her EKG was good because I was worrying her and my parents were both getting upset. She had mild and completely random - maybe once a week or once every two weeks - problems with her memory. She had random leg pain only in one leg and she didn’t know how to describe it. She had a minor and very little cough I think she has been hiding from me.\n\nIn December, around Christmas, she was watching my baby and she said she reached for something behind the radio and pulled a muscle. I kept telling her to go make sure that was all it was and she just kept ignoring it. She had the pain to where at times I could tell it was bothering her and at times it hurt her to sit and feed my baby when she visited which really bugged me. This pain she had was in her upper left quadrant (near her ribs and she described it as basically from the front of the lower rib area to the back of the lower rib area). She never had it looked at! It hurt her for ATLEAST a month probably more like 2 months.\n\nI have noticed her “tripping” or losing balance for the past 3-6 months but it is becoming more and more often. I said something to her almost every time I seen it happen and she brushes it off as if nothing happened. Well, it has got more and more frequent to the point I’m worried she will fall and really hurt herself or while holding my baby, fall and hurt my baby along with herself!! :(\n\nAlso, she told me just recently she has been having a lot more symptoms than I realized.\n\nI made her go to the ER last night with the following symptoms:\n-Coughed up blood clot 2 weeks ago\n-Fatigue\n-Anxiety and Stress (she attributes to being from her job and some of it probably is)\n-Feels like it’s hard to swallow\n-she is always clearing her throat\n-recently I see her grabbing her neck more and more (universal sign for choking)\n-lack of balance\n-dry cough\n-feels like she is congested\n-coughed up almost a 1 inch blood clot less than 2 weeks ago\n-Charlie horse pains often in her right foot and lower leg (sign of DVT)\n-she described to me she “felt like there was a blood clot in her neck”\n-she physically looks drained\n-she seems to know something is wrong\n-she is forgetting things she never should forget (she bought my baby an elephant and it’s head and ears flap - she was SO happy to show my baby this toy and less than ONE or TWO months later, she asked me who got it for my daughter!! I almost cried because I know something is wrong.\n\nHer grandma had mini strokes often and her grandma and grandpa were both on blood thinners.\n\nLast night they gave her a contrast ct of her chest, blood work and d-dimer and told her she did not have a PE or lun cancer. They didn’t even check her right leg for a DVT!\n\nShe is also lightheaded and said she gets dizzy when she goes to lay straight back or when she touches or lays on a specific area on the back top of her head.\n\nThey didn’t even do an MRI!!!!\n\nThey released her with a diagnosis of coughing up blood - they didn’t even do enough testing to find out wtf is going on!!!!!\n\nPlease help. Before her contrast ct last night they gave her Ativan via her IV... she went to work after the hospital without sleeping even though she assured me she would sleep.\n\nToday, on the way home from work, she actually went off the road and could have Really got hurt. That was almost a full 10-12 HOURS after the Ativan. I realize lack of sleep could cause it but I know something is SERIOUSLY wrong.\n\nShe has an apt. Monday at 8am. I am going to type a letter with all of her symptoms and demand they admit me her and find out what is causing all of these symptoms. I’m frustrated and disgusted with the care she is receiving. I also took her to the PCP on Monday last week who listened and said that it couldn’t be a PE because coughing blood isn’t a sign of a PE (MORON) and he ordered a CBC diff and lipid panel or whatever and a CT without contrast which he said needed a pre with from insurance.","like_count":"0","tags":["Silent Stroke","Prevention","Caregiving","Symptoms","Treatment","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/49468/summary-at-top-54-y-o-mom-plz-help-dangerous-symptoms-no-dx-blood-test-result-incl"},{"post":{"author":"hazelhenry","post_time":"over 1 year ago","post_title":"How effective is a stroke physiotherapy?","post_content":"Hi! I am Hazel and I have joined this forum to seek advice for stroke physiotherapy. My uncle had a stroke a year back and he is paralyzed on his left side since then. He was in the ICU for almost 6 months. The doctors started physiotherapy but there was no change in his condition. At last, we heard the words that no one wants to hear. The doctors said, there is nothing more they can do. And he was discharged from the hospital. We are really disappointed about his condition. When I discussed this with my friend, he suggested seeking help from a clinic in Toronto for stroke physiotherapy( http://www.optimalrehab.org/physiotherapy/stroke-physiotherapy/ ). I am planning to take him there. How effective is a stroke physiotherapy? Any success stories to share? Is physiotherapy appropriate for his condition? Please help me with some valuable suggestions!","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/49318/how-effective-is-a-stroke-physiotherapy"},{"post":{"author":"jeeze23","post_time":"over 2 years ago","post_title":"Carotid Plaque showing up on X-Ray mostly falsified by Utrasound? How?","post_content":"I went to a chiropractor last week who took a look of an X-Ray of my neck which took place by the end of last year. What seemed to be the carotid arteries were very bright (grey/white). Made me go see a doctor. Doctor lost his ***, made ultrasound, said \"yeah there is something going on there, probably have to get medications\" (talks to me nervously for 1,5 hours). Sends me to a cardiologist.\n\nCardiologist does ultrasound too, also on the heart (+ stress ECG, looked good). He shows me 2 minimal spots where there was minimal buildup of what could be plaque in one of the carotid arteries. Says he neither understands the reaction by first doctor, nor sees any correlation between what he saw in ultrasound and that x-ray. Is genuinely baffled. Says I should exercise and quit smoking, but there is no \"stenosis\" or need for medication. Blood levels still pending.\n\nCan anybody help me? I really need to know wtf happened. Apart from the shock, I don't seem to have any symptoms. Im a 29yo, non-obese male who has lived unhealthily most of my adult-life (smoking, drinking, but exercised to some degree and not eaten much junk).","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/47494/carotid-plaque-showing-up-on-x-ray-mostly-falsified-by-utrasound-how"},{"post":{"author":"timt1969","post_time":"over 2 years ago","post_title":"Why do some doctor's order d-dimer tests \"stat\"","post_content":"I work for a large medical group with multiple locations in several different counties, which also includes several Urgent Care/Walk-In facilities. I have noticed that the physicians at the Urgent Care locations in one particular county frequently (almost daily) call for \"stat\" D-dimer tests, whereas the physicians in the other counties do not call at all. I realize that they are using the test to help rule out thrombosis, but I question why some physicians are able to do so without ordering this test on a stat basis. From my previous experience in the commercial lab business, this is not a test included on their stat test menus because it is considered to be a test that should be ordered at a hospital. I am not \"clinical\" so it would not be considered appropriate for me to question a physician's practices. Does anyone have any insight on the different ordering patterns?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/44185/why-do-some-doctor-s-order-d-dimer-tests-stat"},{"post":{"author":"abicl","post_time":"over 2 years ago","post_title":"Extreme Nausea after stroke","post_content":"Hi. My mom is 61. She had a hemorrhagic stroke in her basal ganglia on Dec 5, 2017. She is experiencing SEVERE debilitating nausea. She also gets a terrible taste in her mouth anytime she eats. Can anyone offer any solutions?","like_count":"0","tags":["Living & Managing","Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/43235/extreme-nausea-after-stroke"},{"post":{"author":"lydiamayx","post_time":"over 2 years ago","post_title":"Worried I may of done something to cause a stroke , please help :(","post_content":"So about an hour ago I was blowing my nose and I suppose I blew a bit hard and then after I felt all this pressure in my head and my head hurt a bit, I searched it up to just see and it said you can tear blood vessels in your head and it will then cause a stroke, I'm freaking out, I'm going on holiday in a few days and I don't want to worry about it, if I am going to have a stroke when will I have it ? When will the symptoms show? I don't have a cold so it can't be anything to do with a cold, thanks , Lydia :(","like_count":"0","tags":[]},"responses":[{"author":"chatcat76","resp_time":"over 2 years ago","resp_title":"RE: Worried I may of done something to cause a stroke , please help :(","resp_content":"You might have popped something in your ear, but stop by your family doctor and make sure. I doubt it's a stroke, as that isn't the symptoms. I'd say enjoy your holiday, and don't blow so hard! :) I'm not down playing your issue at all.... maybe an a allergist might be seen. My dad blew his nose so hard it would bleed. He had no reason that he could give us. No stokes for him. If you are over all healthy, and have no brain injury, or heart problems, then I wouldn't worry about having a stroke. But, let's make you feel better... so if you think you or someone is having a stoke, ask them to smile. Ask them to hold up both arms and both should stay up for a bit - depending on age and strength. If one falls quickly, then that can be a sign. Ask them to close one eye and touch YOUR nose. (that is my personal one). Have them (with their eyes only) look up, look down, look left and right. If they can, it is fine. So if you get scared, these are some simple things you can check. Strokes feel like something is going on in your head. It is definitely a different feeling and will make you stop and consider. Don't let your brain talk you into bad health... yes, our brains have that ability. But, it's good to be safe and ask, instead of worrying. Best wishes.\n"},{"author":"lydiamayx","resp_time":"over 2 years ago","resp_title":"Thank you very much for responding, i think I just blew my nose way too hard and then I panicked , I suffer from major health anxiety so I worry about everything, thanks again :)","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/39836/worried-i-may-of-done-something-to-cause-a-stroke-please-help"},{"post":{"author":"jennjohnston","post_time":"over 2 years ago","post_title":"DVT & Xarelto","post_content":"I have been on Xarelto for several years. Before that, I was on Warfarin and my Dr couldn't keep my levels good. I was having to change my dose every week or 2. I haven't had any problems since I've been on Xarelto, but my foot up to my knee, have been bothering me for almost 2 weeks. It's the same pain I felt when I had a DVT in 2012. I went to the ER and the Dr didn't even look at my foot or leg. He said that my bloodwork showed no indicators of a blood clot. So with the pain in my leg and my BP running too low (last time it was checked, it was 75/57), he sent me home. I have a follow-up appt with my Dr tomorrow. Does anyone know if you are on Xarelto, and the bloodwork come back with no indicators, could there still be a DVT? I almost died from PE in 1999, so I am worrying myself afraid I may have a blood clot and I don't want it to move to my lungs or anywhere else. Hope someone can answer my question. Thanks.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/39739/dvt-xarelto"},{"post":{"author":"lydiamayx","post_time":"over 2 years ago","post_title":"Very worried about stroke/symptoms, please help :(","post_content":"So I had a short nap about an hour ago and then I was awake in bed for about 10 minutes and I was on my side and my cat was sleeping next to me so I had to lie in a funny position and I was kind of hunched up and my chin was near my chest so my neck was in a bit of a funny position, then when I got out of bed my neck hurt and I've started really worrying that I'm going to have a stroke and I don't know what to do, I felt a bit weird when I got out of bed but to be honest I always feel weird after a short nap, I'm having a few pains in my head as well but that's not unusual for me, please someone help :( thanks , Lydia","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/39034/very-worried-about-stroke-symptoms-please-help"},{"post":{"author":"mason1343","post_time":"over 2 years ago","post_title":"My grandfather stopped responding a few days after his stroke","post_content":"So I’m thirteen, my whole family came from around the country to see my grandfather who just had a stroke. He is 74 and has a pacemaker, was a heavy smoker until about thirty years ago, that is why he had a heart attack from the smoking. He also has had bone marrow cancer for six years and we just figured out nothing was working to stop the cancer. He had a terrible pain in his foot before the stroke and has little movement on his left side. He responded to me up to three days after the stroke, waited a day and he hasn’t responded at all, for the thirteen years I have known him we were best friends, as a kid he would give me rides in his tractor and would always watch tv with me, it is hard to see him in this state and I know he doesn’t have much time left... the doctors six years ago said he had four years of life left in him after the cancer, in the end I wonder why he is not responding now, he twitches and grunts when I talk to him but does not open his eyes to see me like he did, any help and info even if It means something bad please help me I would like to know if he still understands me so I can still tell him I love him.","like_count":"0","tags":[]},"responses":[{"author":"mason1343","resp_time":"over 2 years ago","resp_title":"RE: My grandfather stopped responding a few days after his stroke","resp_content":"He has passed\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/38680/my-grandfather-stopped-responding-a-few-days-after-his-stroke"},{"post":{"author":"pittapit","post_time":"over 2 years ago","post_title":"Stroke, motor, brain-related question","post_content":"Hi MD’s,\n\nI have wanted to ask this question for a long time. About 3 years ago, I snorted a small bump of cocaine. Around 20 seconds later, I became very dizzy, and nearly lost motor and bowel control for a duration of around 10 seconds. I have a history of generalized anxiety/OCD disorder and I assumed it was an anxiety attack (about taking the drug) that combined with the drug to give me that reaction, however I would like to hear a professional opinion on the symptoms.\n\nFast forward to the present. One thing I have noticed within this past year is that I have slightly less feeling on the left side of my body. I have had a CAT scan that has shown nothing. The only thing I could attribute this imbalance to was that one incident a long time ago. I have had no other issues other than a bout of vertigo last year, which was cured by an Ear, Nose, and Throat doctor and has not recurred. I would like some professional insight on all of this, what are your thoughts? Can a small dose of cocaine produce catastrophic long-term effects?","like_count":"0","tags":["Living & Managing","Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/38619/stroke-motor-brain-related-question"},{"post":{"author":"pupadorn","post_time":"over 2 years ago","post_title":"Plavix plus aspirin","post_content":"Had minor stroke ( PCP says it was actually TIA ) 6 months ago. No residual effects. Have been taking Plavix with no issues, cardiologist has now prescribed 81mg aspirin. Will this provide additional protection from a second stroke or TIA?","like_count":"0","tags":["Treatment"]},"responses":[{"author":"tomndenver","resp_time":"over 2 years ago","resp_title":"RE: Plavix plus aspirin","resp_content":"I had 2 TIA's then a stroke I take 325 aspirin and yes it will. Keep takin the aspirin.\n"},{"author":"pupadorn","resp_time":"over 2 years ago","resp_title":"Thanks for the reply. Hope you continue to do well","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/30874/plavix-plus-aspirin"},{"post":{"author":"backwerd","post_time":"over 2 years ago","post_title":"has anyone else experienced just theese symptoms before?","post_content":"yesterday when i was driving suddenly without warning\n\ni had strong tingling sensation all over my upper body and at the same time felt like i was going to faint i imeadiatly stopped my vehicle in the middle of the road and my arm movements became over exagerated when i tried to call 911 i grabbed my cell phone to call and my arms and hands kept moving farther than i would move them and really jerky by the time i finnally got my phone unlocked and starting to dial the symptoms went away i would say about one to two minutes had passed so instead I continue on my way home and felt like maybe i just dodged a bullet\nthe only other symptom was a faint ring of flashiness in my peripheral vision in both eyes but that symptom diminished got less and less and completly went away in about a half hour\n\nwhat do you think happened to me to cause this and could this have been a TIA or Seziure of some kind?\n\nive looked online and have not heard of anyone having just theese three symptoms suddenly all at the same time and then they are gone all the sudden","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"tomndenver","resp_time":"over 2 years ago","resp_title":"RE: has anyone else experienced just theese symptoms before?","resp_content":"Plz go to your doctor tomorrow you had a TIA. Take a 325 Aspirin now don't drive.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/34935/has-anyone-else-experienced-just-theese-symptoms-before"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Worried about another stroke 22 year old female","post_content":"Hello,\n\nI am a 22 year old female and I had a stroke on May 23 last year 2016. I do not have any visible signs of the stroke although my right side is a bit weaker than my left. I am healthy and the doctors do not know what caused the stroke. They said it was a blood clot in my leg and I also have a PFO (hole in my heart which many people have as well). Anyways my concern is this. It was my senior year of college after I had the stroke and I continued doing most of my unhealthy habits a few months following the stroke such as binge drinking on the weekends and smoking cigarettes socially when drunk ( probably around 1 cigarette per week or every 2 weeks) as well as smoking pot occasionally maybe once or twice a month. Now that I am graduated I have just quit smoking and drinking. I am 3 weeks free of drinking and smoking everything. I am so nervous though because I have read a lot online concerning cigarettes. I understand that smoking is bad but I cannot go back in time and unsmoke the cigarettes I have already. I understand I put myself at risk by smoking but does smoking the amount I did (significantly less than a pack a week) put me at a decreased risk of future stroke than those who smoke a lot more. I ask this question because I am so deathly horrified of having another stroke and am losing sleep over this anxiety and simply because I feel as though I have done some damage and was wondering if it is too late. Thanks.","like_count":"0","tags":["Prevention"]},"responses":[{"author":"laura3341","resp_time":"over 2 years ago","resp_title":"RE: Worried about another stroke 22 year old female","resp_content":"Maybe you did,maybe not. You really need to see your doctor and tell him/her exactly what you said here. We aren't qualified to answer those types of questions but i would imagine that if you did indeed stop binge drinking and smoking your on the right path. I know that once you stop smoking you start reversing the effects of smoking ( I smoked for 25 yrs so i'm not coming down on you), but your rationale of smoking only a pack a week is better than those who smoke more is,well, face it your just trying to justify it to make yourself feel better. But you and i both know smoking,no matter if its one or two its still smoking. I honestly don't blame you for being scared about having another stroke. I had a heart attack and needed triple bypass surgery but i still have heart disease and i know i could very well have another. If your losing sleep over this and making yourself sick then your putting yourself more at risk so please,do yourself a favor and go to your doctor. He/she knows you a lot better than any of us that can help you. Let your doctor give you the help you need. Good luck.\n"},{"author":"ashleys2011","resp_time":"over 2 years ago","resp_title":"RE: Worried about another stroke 22 year old female","resp_content":"I am a 26 year old female. I had a stroke at the age of 23. I also smoked/drank before I had my stroke. I still drink but not to the extend I used to.. I also smoke a cigarette once in a while while drinking, which I know I shouldnt do. I wouldnt worry about a few cigarettes.. I doubt they would cause any issues. I also am afraid of having another stroke, but as time goes on I seem to worry less and less. My stroke caused me to live a much healthier life style and that helps me feel better about the possibility of another stroke. I had a PFO that I had closed a few months after my stroke. There are not many people in their 20's that have strokes, so I know how scary it is. If you need advice, feel free to reach out. :)\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/11058/worried-about-another-stroke-22-year-old-female"},{"post":{"author":"bradsgur1","post_time":"over 2 years ago","post_title":"Pain after stroke","post_content":"I am 32 years old and had a stroke last week. Wednesday to be exact. Today makes almost a week and the pain has become unbearable from my ribs to my hip on the left side I still have no feeling in the arm or the leg on that side and I have started to notice memory trouble is this normal a week after the stroke because I wasn't having much trouble with the memory until now the only part I couldn't remember was the time I was unconscious.","like_count":"0","tags":["Symptoms"]},"responses":[{"author":"75in2018","resp_time":"over 2 years ago","resp_title":"RE: Pain after stroke","resp_content":"I'm sorry just seeing this. I had 3 back to back strokes 2 1/2 yrs ago.\nHopefully PT has helped to get you functioning pain free again by now. The best thing you can do for memory is go to a speech therapist. I found that out by accident because I scheduled for speech problems which cleared quickly but memory was more of an issue. Went to several doctors during the recovery process and found I was my best health advocate. I also researched about aspirin and found 2 baby aspirin had the best outcomes. So far no additional issues so I realize how lucky I am. Best of Luck to you.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/28803/pain-after-stroke"},{"post":{"author":"frikness","post_time":"over 2 years ago","post_title":"panic,confusion & unconsciousness","post_content":"The other day I was in a very busy store and was feeling uncomfortable (which I thought was the cause, too many people) so I left and went to my car and sat for a few minutes. I could't remember if I had eaten so I went to the gas station and bought a snickers and something to drink. I got really panicked and disoriented in the gas station and had trouble finding my way out. This is the last thing I remember before crashing my car. Apparently I drove about half a mile then off the road and into a parking garage and another vehicle. Even once the police were able to wake me or when I remember them I still wasn't sure what was going on and wasn't really sure where I was. My memories are spotty for I'm assuming what was the next hour. I only have a clear memory from the point of being downtown handcuffed in the back of a Police SUV. So with all of this I would really like to know what happened????????????? I'm facing DUI charges among things but really want to know what is wrong with my body. Thank you in advance for your help","like_count":"0","tags":["Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: panic,confusion & unconsciousness","resp_content":"I would visit a doctor, tell them what happened, and get an MRI or CT Scan. The scans should show if you had a stroke or not.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/28411/panic-confusion-unconsciousness"},{"post":{"author":"mimsnana","post_time":"over 2 years ago","post_title":"question on vision","post_content":"I had a brain stroke 9 years ago, I lost both peripheral vision sides, later the left side came back, however things are always moving, either slowly, or very fast, when things look like they are moving fast I don't see on the left side for hours to days,, then things will stop appearing like they move fast and I can see again, very blurry though. and sometimes things just disappear on that side all together, there one day and gone the next. is this normal and does it ever go away or clear up more? the right side is still gone. one eye doc said this can happen as its a trick your brain plays on you and another said this is not possible and looked at me like I was nuts.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: question on vision","resp_content":"I am so sorry, that would be so hard to deal with on a daily basis. I would find an occupational therapist that specializes in vision. I am currently seeing one through my opthamologist and it has helped so much. It is hard for me to remember that it isn't my eyes that are the problem, it is my brain. Vision type therapy has helped train my brain on making the eyes work together. I had lost the left side vision but luckily got most of it back. So now we are focusing more on Convergence and Divergence. I don't think I would be as far as I am in my recovery if I didn't have this therapy. Good luck and I hope things work out.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/30282/question-on-vision"},{"post":{"author":"katymike","post_time":"over 2 years ago","post_title":"Dehydrated/stroke","post_content":"Can being dehydrated lead to stroke have very bad speech and loss eye sight weaking muscle strength very bad balance","like_count":"1","tags":["Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/31212/dehydrated-stroke"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"DVT-Factor V Leiden","post_content":"A few years ago, I was diagnosed with Factor V Leiden after having my second DVT in 6 years. I was prescribed Lovenox injections while in the hospital. Afterwards I was prescribed Warfarin first, then Jantoven; neither worked for me because I could never get my PT levels within range. I'm currently taking Xarelto & it seems to be working. However, I've recently started having severe headaches accompanied by nosebleeds & I'm just wondering if it could be caused by the Xarelto. I'd appreciate any & all feedback. Thanks.","like_count":"0","tags":["Living & Managing","Symptoms","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/29533/dvt-factor-v-leiden"},{"post":{"author":"pennyll1560","post_time":"over 2 years ago","post_title":"What the heck is going on?","post_content":"I am 57, had a pretty significant stroke in 4/6/16. After 3 weeks in the hospital I went home to in home therapy, then outpatient. I had significant issues with my right arm, vertigo, balance, speech, memory, word finding, comprehension, retention and walking. I had another stroke 3/5/17 that wasn't as severe the effected my left side. My balance, walking, balance other \"brain\" funtions were effected too.\n\nI am now starting to experience some new things and I don't know if they are related to the prior strokes or if this is something new that I should by worried about.\n\nMy legs seem to be a lot \"weaker\" they don't feel like they will support me when I walk, In the house t I don't use a walking aide. When walking a short distance I use a can. For further distances I have a 4 wheeled walker and if it is really hot outside and a long way from home I have a wheelchair.\n\nMy speech is off even more than normal and now my hearing is off too. The other day the new said \"Golan Heights\" but I heard \"Golden Eggplant\" and this happens quiet often. My sight is much blurrier, vertigo is back big time, especially when I close my eyes. Today I went to take a pill and had a bottle of water in my right hand and a pill to get rid of my Migraine in the other and sat down and my left hand would not open and move to my move to take the pill. I sat there for over 5 minutes staring at my hands, lost.\n\nI am at a loss with all this added stuff, has anyone else run into this kind of thing happen? Is this a sign of a new stroke? Should I be scared or is this \"normal\"?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/28402/what-the-heck-is-going-on"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Can a Concussion be a Catalyst to a Stroke","post_content":"Late last December I was stopped for a light and rear ended by a car when the driver was pre-occupied on their cell phone. I only felt a grogginess after my head snapped forward but thought I would be OK. The grogginess soon became a mix of dizziness, periodic headaches, sudden, short term memory loss and a noticeable loss of balance when I hike or play basketball. I saw my doctor about week or so later for a yearly physical and mentioned my symptoms. Blood tests revealed my cholesterol was higher, now on the high side of normal. She ignored my other symptoms.\n\nAbout a month or so later I went back to see her as the symptoms persisted. She had a trauma specialist examine me and both concluded I must have a concussion. I should also not that the drivers insurance company did not honor their stated policy to give victims a replacement vehicle. So I went 44 days without a car or the ability to drive to my gym to exercise. Then when I finally bought a different car my first time playing, I got Plantar's Fasciitis so missed another 38 days of exercise. So my weight jumped up 10-15 pounds in this timeframe.\nExactly three months after the car accident, I had a stroke. The concussion symptoms remained a daily event with the addition of slurred words and a sagging left face.\n\nThey kept me in the ER for 3 days doing a CAT Scan, MRI, Echo and I think one called a Bell test where I saw live heart imagery. I appreciated the care and occasional ER Docs visits to me. They said I had a full Ischemic stroke but it seemed I had been having lesser \"shower effect\" strokes for a while longer.\n\nWhen I suggested and asked my GP Doctor if there was any correlation between a concussion and a stroke after sharing my logic, she only said \"I disagree\". She was visibly uncomfortable with me even asking, though the practice says it encourages patients to ask where confused. She dropped me without any word to me. I have always been a good patient and highly ethical, but was concerned she stopped my now life vital Warfarin prescription renewal three times.\n\nLast week I saw an article on Web MD and one by the Journal of Science and Medicine stating \"A strong correlation between a concussion and a stroke. They even go on to say there was a tenfold chance that a concussion victim would have a stroke 3 months later, exactly when I had mine.\n\nI will speak again with my Neurologist but I sense a gap between these new reports and doctors formed opinions. I also want to properly close out my insurance claim so Medicare can be reimbursed for where it covered concussion-related treatments. I realize there is less certainty with concussions and strokes and also that much of medicine is probability based. But without a medical opinion on the subject with regard to my circumstances given I still have some of the same concussion and stroke symptoms, I just feel like the system is working around me.\n\nI appreciate my doctors and yet am not sure this matter has ever gotten the proper attention. If you know of any other research or second opinion sources, I appreciate it.","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/26532/can-a-concussion-be-a-catalyst-to-a-stroke"},{"post":{"author":"troyk88","post_time":"over 2 years ago","post_title":"What now","post_content":"I have a constant crushing feeling inside my head, vision gets foggy, pain in back of head, neck shoulders, left arm, confusion, memory problems, constant headaches. Had a ct scan and my doctor sent me the results indicating Right Caudate Lacunae Infract, also says its concerning and said I will get an referral to a neurologist in about a week. What does this mean for me. I looked up online and it said its a deep brain stroke. What is happening ?","like_count":"0","tags":["Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/24799/what-now"},{"post":{"author":"johnmychaluk","post_time":"over 2 years ago","post_title":"My story. What happened to me? What more can I do to get better?","post_content":"This journey of mine started with an incident that happened to me when I was in my apartment last October. Nobody knows exactly what happened. One work day I did not show up at work and I did not call in, and that’s not the way I normally operate. One of my co-workers got very worried and vocal about me missing, to the point my boss drove to my apartment and banged on the door. Someone eventually opened that door, and they found me passed out in my bed, bleeding on the right-hand side of my head.\n\nThey took me to ST. Luke’s hospital and performed a craniotomy, to stop the bleeding. Someone called my younger brother in New Jersey to tell him where I was, and that they did not think I would survive. He flew out here immediately in shock. Three weeks later, I was transferred to a rehabilitation clinic in Overland Park, Kansas, where I was still in a wheelchair. It was there I began to regain my memory, because I do not remember the hospital at all.\n\nThey had put in a feeding tube in my stomach because they were afraid I would choke to death because I did not swallow correctly. This takes all the joy out of your life by not being able to eat and taste food.\n\nI remember when a therapy girl helped me by removing all the staples they had used to close my head back up. 45 staples. The person stapling my head must have had a grand old time banging away.\n\nSo here at this rehab place they would feed me by pouring glop into a tube connected to my stomach. In the afternoons, they would take me to a GYM to do some exercises. I spent most of the time sleeping and watching TV.\n\nSeveral weeks later a new person stood in my room and drove me to Omaha Nebraska to a rehabilitation place named QLI. I was there for 4 months. If anyone had previously told me about this place, I would not have believed them. It’s something you must experience.\n\nQLI is on a large piece of land with many buildings. They have 10 houses for residents to live in, each house has 8 to 10 bedrooms. I was in house 2. It sure was different for me to be among so many people. I am single and live alone, so this was defiantly different.\n\nOne other building has a big room where they zap you while you pedal a stationary bike. They also have a big thing they call “ZERO G”. Zero g is a very long I-Beam that they put you into a harness, connect you to a trolley, can raise and support some of your body weight, allowing you to walk under the I-Beam somewhat like a normal person.\n\nThere is another room that has a submersible treadmill. There you change into a swimsuit, walk out onto a platform that has the treadmill on it, hold onto the handrails, get lowered into about 4 feet of heated water, and begin walking on the treadmill.\n\nAnother building is filled with offices, meeting rooms, and a big gym. Part of what I did for a living was Corporate Instructor, where I teach up to 10 guys from our service shops around the USA all about a product they will be installing, servicing, and repairing. Part of my job is preparing, creating, and presenting power point presentations. QLI obtained a couple of these from my boss, and I presented them to a meeting room full of people at QLI as if I was instructing a class. One of the girls, named Alex, filmed my presentation on her phone without my knowing. When I found out about it later, I remember I got very mad at her, calling her a “sneaky redhead” She laughed and laughed!\n\nHouse 2 has a large room filled with many tables to eat at, as well as a couch and comfy chairs to sit in, with a TV. They had a large kitchen, stove, microwave, and three refrigerators. They would take me to a local food store to buy frozen dinners, so If I did not like what they were serving, I could have something else.\n\nYes, I could eat again. It happened after they took me to a hospital for yet another swallow test. This is where you eat and drink foods while they take X-Rays of you swallowing. And this time, I passed the swallow test. Shortly after I did, one night, at about 8:30, a new lady appeared in my room, said she was a nurse, and was here to remove my feeding tube. I asked her if it was going to hurt, and she said “YUP!”.\n\nShe grabbed the tube, told me to take a deep breath, and pulled it like she was trying to start a lawn mower. It popped out of me causing deep pain. She wiped up the mess and taped a big gauze pad over my stomach. I moaned for a half hour before ringing for aspirin. Then I could fall asleep. It just kept getting better after that. Because NOW I could eat real food!\n\nAt QLI they did lots of exercise both in the mornings and in the afternoons. They taped pads to my leg and shocked me while I pedaled a stationary bike. They took me for walks with a walker, and had me climb stairs. One day, they took away my wheelchair and gave me a cane and a leg brace. I missed that chair for 2 weeks!\n\nI had to have an escort walking with me when I had to go to exercise sessions. The walk was about a city block. They would put a gait belt on me and sometimes hold onto it. So, I used to sneak out by myself and walk, and sometimes I would get halfway there when I heard running feet behind me, and a loud voice saying “WHAT THE HELL ARE YOU DOING OUT HERE ALL BY YOURSELF?” I really miss those times!\n\nOne day, I was walking back to house 2 and decided to take a short cut across the grass. I miss stepped, lost my balance, and fell. I was not hurt; it was soft grass. But there was nothing to grab onto to get back up, so after trying to get up and failing at it, I gave up and waited for someone to come out and help. They all came out one at a time and stood near me, laughing, asking me how the air was down there, and generally having fun with me. I was sure to avoid taking any short cuts from then on.\n\nThey found out I like to cook food, and am good at it. I started planning a weekend meal for the people in the house. I would go with an escort to the food store, buy the food, and usually on Saturday prepare and serve dinner for anyone who wanted to have it. I made stuffed peppers one time, stuffed cabbage another time, lemon whole chicken, and lots of other things. All my cooking was greedily consumed down to the last bite with lots of compliments!\n\nQLI has a room where they kept special bicycles that were low to the ground. Some of these were 2 people bikes. One day we loaded 6 bikes into pickup trucks and drove to a riding trail that was supposed to be 40 miles long. It ran in the middle of some blocks between the houses and back yards, behind businesses of all kinds, and along a chuckling creek. We peddled 3 miles out and 3 miles back. It was a LOT of fun! We would go riding on the QLI campus as well. And if it was raining, they had a stationary one set up in front of a computer. It was almost like riding one outside for real.\n\nMy insurance was due to stop paying QLI, and I found out that during one of their appraisal meetings one of the therapists was very vocal about me, and said if I were to stay another month I would be very much better. So, QLI gave me a free month at their own expense for me to succeed. I can almost cry when I remember this. I told their CEO “thank you” in person, god bless you and QLI! She just smiled, and said her job was easy, all she had to do was say “YES”.\n\nMy Therapists once drove me home for a day trip. Alex and Megan and I. Megan saw where I lived and recommended some things; like handrails in my bathroom, which I did have installed. She scrubbed my refrigerator sparkling clean! It was empty and turned off. Alex was visiting where I worked and seeing my desk and other things. It was just for the day, so we drove back. It’s a three hour drive each way.\n\nThe next trip I took home was with Roni. She drove us, and I stayed home and slept in my bed for three days. I went to work as well, and while I was at my desk answering phone calls, Kim from Human Resources, and my boss, were both sitting nearby listening to me talk of the phone as they were also busy on their laptops. After three days, I guess they were satisfied that I was doing OK. I must say I am a lucky man to have such a job. I have been treated very well. But I have also worked for them since 1979!\n\nThe day came that I was discharged from QLI, and they drove me home for the last time. I was there for about 4 months. I miss the place and all the wonderful people there. But I do keep in touch with many of them via email. They are wonderful people who did so much for me.\n\nBefore I was discharged, Roni and Vanessa and others asked me about continuing therapy on an outpatient basis in Kansas City, and we found Ability KC. I chose this place because they are local, AND they have a driving program as well. I have a nice Crown Victoria that is waiting for me, but I want to do it right.\n\nAt this point I have completed a physical therapy course and also an occupational therapy course. I continued to go twice a week there for electrical stimulation on my right leg while peddling a stationary bike. But now I am taking a break from therapy and thinking of what to do next.\n\nSo, I am still walking with a cane and am still weak on my right leg, ankle, and right hand. What puzzles me is what happened? My understanding about a stroke and bleeding on the right hand side of the brain would affect the left side of the body. But I am affected on the RIGHT hand side. I am seeking suggestions as to what might have happened to me, and what I can do to improve to the point of not needing a leg brace or a cane to walk around. Thank you, and god bless you.\n\nJohn M","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/24220/my-story-what-happened-to-me-what-more-can-i-do-to-get-better"},{"post":{"author":"sams234","post_time":"over 2 years ago","post_title":"Help and advice - looking for breakthrough treatment","post_content":"My Mother, 86-years old, was first diagnosed with Parkinson's in 2011. She has also experienced multiple mini-strokes over these years, and seizures since 2014. On appropriate medication all along, and doing ok. Then in Aug-2016, experienced several episodes of seizure followed by sharp cognitive decline. In Oct-2016, was admitted to the hospital with high BP and a low level of consciousness. Since then, she has hardly been able to speak or interact, always on feeding tube (8 months on nasal then 2 months on PEG), and her weight has steadily declined along with the ability to sit or stand on her own. Vitals generally under control.\n\nWhat options may be available to help improve her cognition, gain weight and strength? Would also would like to know what medicines might be helpful at this stage? Also any doctor suggestions in Mumbai, India?","like_count":"0","tags":["Living & Managing","Silent Stroke","Prevention","Caregiving","Symptoms","Treatment","Diagnosis","Blood Clot"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Help and advice - looking for breakthrough treatment","resp_content":"Hello, I'm sorry about your mom. I do wish her quick recovery. Have you tried out herbal medications? Well, I can recommend you to someone who's famous for using herbs to cure so many ailments even partial stroke.\nThis is his contact, Dr. Ola: whatsapp number +2348124021295 and email olawaleherbalcentre@gmail.com.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/21851/help-and-advice---looking-for-breakthrough-treatment"},{"post":{"author":"yesnoyesno1","post_time":"over 2 years ago","post_title":"Would sulfuric acid poisoning show up on a toxicology report?","post_content":"Hi. My grandfather passed away last year after suffering a stroke. The doctor said he showed signs of poisoning. I'very read up a little on sulfuric acid poisoning from bad car batteries. I'm just wondering if that would show up on a toxicology report.","like_count":"0","tags":["Silent Stroke","Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/22771/would-sulfuric-acid-poisoning-show-up-on-a-toxicology-report"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Is it a TIA or a possible nerve inflammation","post_content":"I went to ER after I felt tingling/ numbness on the entire left half of my face. I was discharged later that night with having a \"Transient ischemic attack\". A CT scan and MRI were taken and reports according to the doctors were normal. They have now started me on daily aspirin. I have had 4 episodes of transient pain with tingling and numbness within the last 3-4 days.\n\nMy questions are that: 1. If it is a mini stroke, why are my CT scan and MRI normal, shouldn't they have found something on the scans? Also I am getting recurrent episodes everyday. If the problem was this severe, shouldn't they have caught something on the scans?\n\nThis is why I am thinking it may be a nerve inflammation. The nerves that supply the face.\n\nAny thoughts or ideas of what I should do next? Should I consult a neurologist?","like_count":"0","tags":["Symptoms","Diagnosis"]},"responses":[{"author":"Anonymous","resp_time":"over 2 years ago","resp_title":"RE: Is it a TIA or a possible nerve inflammation","resp_content":"I too have suffered from several episodes like you have described, and they still don't know what seems to be causing them. They did find damage of my first stroke back in 2012, but since then all scans have been normal. I would consult a neurologist, that is what I did and he found neuropathy on my left side due to my diabetes.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/20091/is-it-a-tia-or-a-possible-nerve-inflammation"},{"post":{"author":"fleong","post_time":"over 2 years ago","post_title":"Healing can been be at any time at any stage","post_content":"It have been 6 years since my 1st stroke incident,I'm getting stronger everyday and much healthier everyday.I'm practising natural healing approaches: acupuncture + physiotherapist + organic diet","like_count":"0","tags":["Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/21935/healing-can-been-be-at-any-time-at-any-stage"},{"post":{"author":"apeedbird","post_time":"over 2 years ago","post_title":"Loss of balance, tingling on left side.","post_content":"18 months ago, I had a stroke. Since then, I have constant tingling on my left side, from head down to toes. It is not painful but very annoying. Worse yet, fingers are numb and I lose balance when standing; so walking is impossible. Months of intensive physical therapy, acupuncture, electro-stimulation did nothing, Any suggestions?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/19379/loss-of-balance-tingling-on-left-side"},{"post":{"author":"mommymac72","post_time":"over 2 years ago","post_title":"Spironalactone Side Effects","post_content":"My Dr. put me on spironalactone for my hirstuism. First it was 50mg daily and I had no problem and no change. Now he put me on 100mg daily. For the past few days I have had a headache and numbness under my tongue. It's very strange and I'm not sue if it's from the meds or something else. Im not sure if I should continue these pills or if this is completely unrelated and need to see a Dr.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/19324/spironalactone-side-effects"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"How can you tell if a person is having a mini-stroke?","post_content":"My mother-in-law occasionally sounds like she's been drinking. Slurred speech, totally forgets what happened for a part of that day. She gets upset if I mention that she is not \"acting like her usual self\", that something seems wrong and I asked her once if she had been drinking which she swore she had not been, and then she was very upset with me for asking her that. I believe she has had a minor stroke in the past. Could this be happening again when she is like this? I am worried about her but she refuses to see a doctor.","like_count":"0","tags":[]},"responses":[{"author":"WebMD Lead Medical Director - Brunilda Nazario, MD","resp_time":"over 2 years ago","resp_title":"RE: How can you tell if a person is having a mini-stroke?","resp_content":"Somethings not right and she should be seen promptly. Call 911 when this happens since there’s no way to tell if these symptoms are from a mini-stroke or a more serious or debilitating stroke. And you would remove yourself from advising her to see a doctor…\n\nA mini-stroke, happens for the same reason as a stroke…blood supply to a part of the brain is interrupted. Symptoms such as numbness or weakness one side of the body, confusion or difficulty in talking or understanding speech, slurred speech, difficulty walking, dizziness, or loss of balance and coordination are signs of an emergency.\n\nIn both, the symptoms start suddenly but usually disappear within an hour with a mini-stroke, yet they can last up to 24 hours.\n\n****Even if the symptoms go away, they shouldn’t be ignored since mini-strokes are a warning sign that she's at risk for having a future stroke.\n\nStrokes can cause disabilities yet they can be prevented. By treating and controlling risk factors like high blood pressure, cigarette smoking, heart disease, and diabetes and making a few lifestyle changes like eating right, maintaining healthy weight, exercising, she can reduce these risks .\n2\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/13557/how-can-you-tell-if-a-person-is-having-a-mini-stroke"},{"post":{"author":"gamzy","post_time":"over 2 years ago","post_title":"Muscle or nerve problem?","post_content":"There was one time, at school, where my hands are gripping on its own that even my classmates can't open it and I have no controll over it. Also I can hardly open my mouth to speak.","like_count":"0","tags":["Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/18870/muscle-or-nerve-problem"},{"post":{"author":"ross111","post_time":"over 2 years ago","post_title":"Help","post_content":"Hi my name is Ross my brother had a stroke when he was 7 years old. He is now 29 and in massive pain on a daily basis his right hand and foot are constantly cramping and locking up his shoulder dislocates every 15 minutes and his toes are all curled up in a cramping motion like his hand in severe discomfort any help he has had numerous splints for his hand but they break within a week because the power of the hand closing on it . I would like to know wat we should do next for my brother who just wants a Normal pain free life","like_count":"0","tags":["Living & Managing","Symptoms","Treatment"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/14099/help"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Chronically elevated homocystine","post_content":"I am 26 year old male, sport active no chronically diseases. No family history of heart disease or stroke\n\nI discovered I have elevated homocystine 23,44 I used b vitamins for 2 months each day and it decreased to 15,22. Then I used it every 2 or 3 days and after 1,5 month it dropped to 14,7.\n\nDo I need to supplement further, the studies have not shown it reduces the chance of stroke, so what should I do from here?","like_count":"0","tags":["Prevention"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/11970/chronically-elevated-homocystine"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"News Flash: Is Shingles Tied to Heart and Stroke Risk?","post_content":"More research is needed, but doctors should warn patients, researchers say. What you need to know: http://wb.md/2uaLPj3","like_count":"0","tags":["Living & Managing","Silent Stroke","Prevention","Symptoms","Treatment","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/11303/news-flash-is-shingles-tied-to-heart-and-stroke-risk"},{"post":{"author":"usmckp8411","post_time":"over 2 years ago","post_title":"Contaiminated Water Camp Lejeune","post_content":"I have sleep apnea and 2 Strokes, what do I need from my doctor to tie to service and Contaiminated Water Camp Lejeune 1984-87 camp L?","like_count":"0","tags":["Silent Stroke"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/10961/contaiminated-water-camp-lejeune"},{"post":{"author":"lewis1952","post_time":"over 2 years ago","post_title":"multiple strokes","post_content":"Can a person have multiple full blown strokes and the strokes have no effect on the body? Doctors have concluded that my silent strokes have become full blown strokes but are baffled because medical science says I should experience paralysis or death yet I am not","like_count":"0","tags":[]},"responses":[{"author":"WebMD Medical Editor - Neha Pathak, MD","resp_time":"over 2 years ago","resp_title":"RE: multiple strokes","resp_content":"Wow! Your experience shows exactly how the human brain is both a very delicate organ, but also amazingly resilient. You are not alone, because experts estimate that 8-11 million Americans experience silent strokes every year. Silent strokes may not cause any obvious symptoms, but they can be seen as abnormal, “scarred” areas in the brain when you have a brain scan for other reasons.\n\nA stroke happens when there is a lack of blood flow to parts of the brain, either because of a blockage or bleeding vessels. When someone has symptoms like drooping face, weakness in the arms and/or legs, speech problems, this is a medical emergency and you should call 911 right away.\n\nIn a silent stroke, parts of the brain are damaged, but you may not know it at the time. Once they are discovered, however, it is really important to diagnose and manage other conditions like high blood pressure, diabetes, high cholesterol, smoking, and atrial fibrillation. Your doctor will probably recommend dietary changes, low salt diet and quitting smoking, to aggressively prevent any more strokes.\n\nWe do know that when you have many silent strokes, over time it can affect your memory and your mood so it is crucial to keep yourself as healthy as possible by eating right, exercising, managing stress, and taking your medications as prescribed. Try to pass these healthy habits on to the people that you love as well, so they can also reduce their risk of stroke (both silent or full-blown)!\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/8763/multiple-strokes"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Migraine Birth Control","post_content":"Hi, I started Birth Control a week ago, it is a two hormone, 21 day cycle with a week of sugar pills. They said it was a generic BC called try-estyrella. Yesterday I finished a week and tonight I should start the second week, but today I got a migraine with aura, which I have never gotten before. Naturally, I blame it on the BC because that is the only thing that has changed in my life recently, and after doing research I found that BC and aura migraines, increase chance for stroke. Should I keep taking the BC? Was the migraine probably just because of a change in hormones?","like_count":"0","tags":["Prevention","Treatment","Diagnosis"]},"responses":[{"author":"WebMD Lead Medical Director - Brunilda Nazario, MD","resp_time":"over 2 years ago","resp_title":"RE: Migraine Birth Control","resp_content":"Migraines can get worse with BCP’s. But what you describe is unusual since migraine headaches most often occur on days that you take sugar pills.\n\nYes, there is an association between a migraine with aura and having a higher risk of a stroke.\n\nThe risk is small and other stroke risk factors are involved. Smoking, estrogen-progestin contraceptive use, and age <45 years are involved in stroke risk. Your birth control pill is a combination pill that contains this estrogen and progestin.\n\nThe bottom line: many women’s health experts say that for women with migraines and aura, the risk of BCP and stroke is unacceptably high, and BCP should not be taken.\n\nCall your health care provider right away, there are safer forms of contraception available to you.\n\nDr Bruni\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/9168/migraine-birth-control"},{"post":{"author":"Anonymous","post_time":"over 2 years ago","post_title":"Blacked out for 3 minutes ?","post_content":"Today I was working out with my fitness trainer who's a good friend. At some point suddenly it seemed like he blacked out and was looking at me and smiling, but was not reactive. This went on for 2-3 minutes and after he seemed to be slower than usual. When I mentioned to him later he did not remember it and didn't want to admit the issue. For the next half hour before I left his consciousness and awareness seemed to be lower than usual. He's 61 and I think is healthy. Could this be serious ?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/9552/blacked-out-for-3-minutes"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"Silent Stroke: What You Need to Know","post_content":"If you've had a silent stroke, how would you know? We explain some of the signs, along with causes and risk factors: http://wb.md/2qdWXH2\n\nHave you had a stroke? When did you start noticing signs? We’d love to hear from you.","like_count":"0","tags":[]},"responses":[{"author":"gingertea3","resp_time":"over 2 years ago","resp_title":"RE: Silent Stroke: What You Need to Know","resp_content":"I don't know for sure whether I've had a silent stroke but a few odd things suggest I may have. I have frequent migraines, so sudden severe headache is nothing unusual. After a migraine most things return to normal. But I notice my math skills disappeared virtually overnight. I can do basic arithmetic only by counting fingers, like I did in the first grade. My left hand was my strong hand and when I first took piano lessons I could memorize the left hand's part more easily than the right hand part. Now though I simply cannot memorize the left hand part and this part does not improve with practice.\nOne neurologist ordered an MRI after hearing about these odd things. He said it showed one or two small white,or,dead spots. He then had me start taking baby aspirin to help prevent strokes. However the neurologist I now have says there is no such evidence of dead spots.\n1\n"},{"author":"carina4346","resp_time":"over 2 years ago","resp_title":"RE: Silent Stroke: What You Need to Know","resp_content":"I started having episodes where my eyes would involuntarily cross. It would only last for 15-30 seconds. Then I started getting dizzy when my eyes crossed, and finally the right side of my tongue would go numb. This happened every two to three months for about a year and a half. My eye doctor and regular doctor didn't know what would cause this, but he had me take my blood pressure after one of the episodes. It was normal. I had a hysterectomy and the next morning I remember sitting down on the bed, then I felt like I was falling, but could not grab the railing, or call to the nurses who were standing a few feet away. They turned around, saw me flailing, and just put me back to bed, where I slept for the next 10-15 hours (after a full nights sleep) I found out a few days later that I had a stroke, and the weird episodes I had gone through were apparently TIAs (mini strokes) The hospital did not diagnose my symptoms as a stroke. I had numbness in my left thigh, two fingers on my left hand were ice cold, I was slurring my speech, my face was a little droopy, and I could not control my hands enough to key in the password on my phone, or write my name. I was not diagnosed with a stroke until 3 days later when I called my local physician. Do not rely on others to see to your health, keep asking questions.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/8057/silent-stroke-what-you-need-to-know"},{"post":{"author":"cintheia","post_time":"over 3 years ago","post_title":"post stroke","post_content":"my brother, who is 52 yrs old, has had several strokes, and now his whole demeanor is changed. he doesn't seem to have whatever it is that triggers you to take care of your personal hygiene or cleanliness at all, is this something that can be fixed? my family is at their wits end trying to understand what is happening with my brother and now he is answering his room door in the nude and seems to be going further away from normal. any help or advice would be appreciated.","like_count":"0","tags":[]},"responses":[{"author":"WebMD Chief Medical Director - Michael W. Smith, MD, MBA, CPT","resp_time":"over 2 years ago","resp_title":"RE: post stroke","resp_content":"Hi Cintheia,\n\nI know that must be so difficult for you and your family. Personality changes after a stroke are fairly common. The symptoms you describe, including the inappropriate behavior of appearing at the door nude, are sometimes seen, depending on the area of the brain affected by the stroke. Behavioral interventions may help, such as consistently reminding him to put on a clothes, wash etc. You do want to be careful of how you approach him so he doesn't feel like the family is coming down on him. Remember to him, he doesn't realize it's inappropriate or unusual behavior. I would highly recommend talking to his doctor to determine what assistance there is to helping with these behaviors. How permanent this is will be tough to tell but the longer it goes on with no change, the more chance that they won't improve. Hang in there. I know this is quite tough to see in a family member. Caregiving is such a very hard job.\n"},{"author":"cintheia","resp_time":"over 2 years ago","resp_title":"Dr. Smith,","resp_content":"I thank you for taking the time to respond. We are trying to locate a better living situation for him, at the moment he lives in an assisted living place that is mostly elderly people and he is the youngest one there and he constantly says he is bored to death. I intend to move closer to be able to spend more time with him, sometimes I feel like I am the only one who understands he will not ever be the same man he once was. I am hoping with a new living situation that offers more stimulation for him on a daily basis. When I am able I will get my parents together and see if they can have a talk with the doctor about his behaviors. Again, Thank you!\n"},{"author":"WebMD Chief Medical Director - Michael W. Smith, MD, MBA, CPT","resp_time":"over 2 years ago","resp_title":"RE: post stroke","resp_content":"That sounds like a great plan. Caregiving is a very tough role, so don't forget to take care of yourself through the process. Stress can really get to you and affect your health, which I know is the last thing you need when trying to help your brother. Hang in there, try some deep breathing exercises daily to help manage the stress, and take time for yourself.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/5844/post-stroke"},{"post":{"author":"jenna314","post_time":"over 2 years ago","post_title":"Stopping statins and risk of stroke","post_content":"My aunt suffered from type 2 diabetes, hypertension and elevated cholesterol. She had a stroke 8 years ago but recovered quite well. She was taking about 6 different medications including statins, diuretics and metformin. She had been taking these medications for 8 years. On the advice of a friend she stopped taking her statins cold turkey. She died of a stroke 5 days later. Could her passing have been caused by not taking statins for only 5 days?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/9085/stopping-statins-and-risk-of-stroke"},{"post":{"author":"concernedman","post_time":"over 2 years ago","post_title":"29 and suspect mini strokes","post_content":"Hi,\n\nI'm a concerned man about possible mini strokes. Why am I concerned?\n\n1. In the last 5 years, I've had 2 relatives drop dead from Strokes(albiet both were 50+).\n\n2. I'm black. Yes being black gives you a higher risk.\n\n3. I have the sickle cell trait(not the disease).\n\n4. I have a BMI of 40\n\n5. I have high blood pressure\n\n6. In recent days I've experienced an odd inability to swallow my saliva naturally. I have to make an effort somewhat to swallow my spit. But swallowing food and water is fine.\n\n7. Sudden onset of headaches. They're not the worse headaches ever, but they can be somewhat intense...like a 4 or sometimes a 5 out of 10.\n\n8. On and off, occasionally, the right side of my neck experiences some numness.\n\n9. I don't know if I've experience any dizziness or disorientation(never had it before), but while walking at work, the floor looks wobbly.\n\n10. Lately, I can notice the forgetfulness more than usual.\n\nI have not experienced blurred vision, face droop, slurred speech, or any of the classic signs of an immediate stroke. But I do suspect that I showing signs of mini strokes. I've been to the ER 2 times in the last 2 months and the problem is, unless you show the most IMMEDIATE, DROP TO THE FLO, signs of a stroke, they(ER MD's) will say \"Oh you're young, it's very unlikely, such and such.\" One of the two relatives was my dad, and perhaps his death is what puts the concern to the forefront of my mind.Originally he had his stroke while teaching a classroom. After the stroke, he successfully stood up and tried to teach the class(lol), thats until he tried to talk and thats when his students knew there was a problem. They rushed him to the hospital and he tragically passed(from a subsequent stroke 3 weeks later). Even before he passed, he went from not remembering who I was, to gaining 70% of his memory back(I get my number from our conversations).\n\nI bring up my father as an example to say this, I suspect that I'm having ministrokes. But because I'm so big and physically strong(mentally strong too), I'm not keeling over like the average person would do so. Hence, when I test strongly in front of MD's, automatically dismiss the notion that a mini stroke is happening. Now, I may be a hypo, but I don't want to die to find out I'm right.\n\n1. If a doctor does not believe, what diagnostic tests should I demand?\n\n2. What medications should I demand? My dad was on blood pressure and thinner meds, is it the same for anyone?\n\n3. Should I shoot straight to a neuro doctor?\n\nThanks for the response to my likely hypochondriac post.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/9054/29-and-suspect-mini-strokes"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"Daily Tips to Help Care for a Loved One Who Had a Stroke","post_content":"Here's a list of things you can do to help your loved one recover from a stroke, including making everyday routines like bathing and eating easier: http://wb.md/2rBy0Jh\n\nShare your tips below!","like_count":"0","tags":["Living & Managing","Silent Stroke","Prevention","Caregiving","Symptoms","Treatment","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/8861/daily-tips-to-help-care-for-a-loved-one-who-had-a-stroke"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"Types of Stroke: Ischemic, Hemorrhagic, and TIA","post_content":"Not all strokes are created equal. There are three main types of strokes, with different warning signs and symptoms. Learn more here: http://wb.md/2p7Drxb","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/8438/types-of-stroke-ischemic-hemorrhagic-and-tia"},{"post":{"author":"sdoukbun","post_time":"over 2 years ago","post_title":"Stroke (Myocardial Infarction) Preventions and Treatments","post_content":"One of the many ways besides taking medications (Aspirin 81mg and Omeprazole) for Heat Strokes is to drink enough water. The secrets is to stay hydrated. Just by how much? Drinks by the many hours you are going to be awake. Drink 8 oz of 8 servings if you are going to be awake in 24 hours. If you are awake for the next 12 hours then drink 8 oz of 4 servings. In 6 hours then it is 8 oz of 2 servings. It is ideal to drink 8 oz of 8 servings as a maximum if you do not know how to calculate the average amount to drink or if you wants to be on the safe side. For a regular stroke, the same theory is applied, but use water therapy. If it is hot, take cold showers or use ice. If it is cold, warm or hot water will do the trick. If all else fail, go to your primary care physician and or the local emergency room at the nearest hospital for further treatment.","like_count":"0","tags":["Silent Stroke","Prevention","Caregiving","Symptoms","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/8365/stroke-myocardial-infarction-preventions-and-treatments"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"Cut Your Odds of a Stroke","post_content":"You may not be able to change your genes, but there are some things you can do to lower your risk of a stroke: http://wb.md/2pD5rue\n\nCall 911 or other emergency services now if you have signs of a stroke. Learn more about the warning signs of a stroke and when to call your doctor here: http://wb.md/2qmp2eb","like_count":"0","tags":["Silent Stroke","Prevention","Caregiving","Symptoms","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/7772/cut-your-odds-of-a-stroke"},{"post":{"author":"kat120213","post_time":"over 2 years ago","post_title":"Symptoms a year before stroke","post_content":"My first symptoms were eye\nProblems, dizzy spells,\nThey would come and go.\nWhen I saw an eye dr, she said to see my dr immediately, I did and dr ordered a ct scan, my dr said I had a massive infection in\nMy head, I took antibiotics\nFor months.. It wasn't an infection, had dr ordered ct WITH CONTRAST (dye) the huge aneurism would have shown up... Luckily I had a stroke first which alerted the er dr and anurism was found\nAnd great job from my husband who knew the signs of stroke and called 911 immediately","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/7543/symptoms-a-year-before-stroke"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"May is Stroke Awareness Month","post_content":"Strokes kill more than 133,000 Americans annually, and are the leading cause of serious, long-term disability.\n\nIt isn't always easy for people to recognize symptoms of a small stroke. They may mistakenly think the symptoms are a part of aging, or the symptoms may be confused with those of other conditions that cause similar symptoms.\n\nEvery second counts when a stroke occurs. Know the symptoms and how to use the F.A.S.T. test -- plus what you can do to lower your odds of having one: http://wb.md/2oJprq9","like_count":"1","tags":["Living & Managing","Silent Stroke","Prevention","Caregiving","Symptoms","Treatment","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/7198/may-is-stroke-awareness-month"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"News Flash: More Younger Americans Are Suffering Strokes","post_content":"Strokes are typically associated with the elderly, but new research suggests that strokes are increasingly happening to Americans under 65.\n\nClick here to read more: http://wb.md/2oXBTa9\n\nTell us your thoughts!","like_count":"0","tags":["Living & Managing","Silent Stroke","Prevention","Caregiving","Symptoms","Treatment","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/6487/news-flash-more-younger-americans-are-suffering-strokes"},{"post":{"author":"fotobirajesh","post_time":"over 2 years ago","post_title":"Stroke followed by bleeding","post_content":"Sir,\n\nMy mother, 70 years, had a stroke while at sleep and by the time we took her to hospital it was more than 5 hours. She had some weakness with her right leg and hand and the speech was not clear and the mouth was turning to a side a bit.\nHowever, she was in the ICU and after 4 days she was out into a room and her mobility got better each day.\nUnfortunately, she was coughing hard and on the day she was to be discharged from hospital we noticed that her stomache was growing and after a CT scan found out that there was blood and clot accumulated in the wall of stomache, right side. An I&D was done by the General surgeon and nearly 1 and half litres of blood and clot was removed. She was back in ICU.\nThey had to stop all blood thinning medicines hence.\nSlowly her right side is weak again and after more than one week of I &D, they have restarted just 75mg of Aspirin but nothing else.\nThe sad part is now after about 19 days of the first stroke, her right side is completely paralyzed, it seems.\nAm wondering, when can the neuro surgeon decide to give her blood thinners now. The general surgeon who did the I&D says her wound on the stomache is getting better with every day and there is no more bleeding or infection there.\nIn between, the Pulmonologist suspected a lung infection and started some heavy dose anti biotics and he thinks she has reacted to it well, which means hopefully there is no issue with lungs.\nshe is out of ICU, but absolutely weak in right side.\nPlease tell me, what would be the ideal process of recovery for her. Will she be able to walk again (they did many CT scans after but says there were no extra strokes!)\nWill giving more blood thinners, once the hospital feels it ok to give her, help her retrieve, please.\n\nForgive me for any lack of clarity in this message as am in deep pain and all.\nThanking you so much.","like_count":"0","tags":["Treatment","Blood Clot"]},"responses":[{"author":"fotobirajesh","resp_time":"over 2 years ago","resp_title":"RE: Stroke followed by bleeding","resp_content":"Am sorry, I forgot to mention that her blood pressure is varying, a bit high one day and a bit low the next, has Cholestrol too.\nFollowing i &d, she showed high blood sugar, but its back to ok now.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/6427/stroke-followed-by-bleeding"},{"post":{"author":"WebMD Morgan","post_time":"over 2 years ago","post_title":"News Flash: Fitness Is Key to Post-Stroke Recovery","post_content":"People who were active and exercised regularly before their stroke were less likely to face disability after the attack, researchers say.\n\nClick here to read more: http://wb.md/2oif8vW\n\nWe want to hear from you: Were you active before your stroke? Did this improve your post-stroke recovery?","like_count":"0","tags":["Silent Stroke","Prevention","Caregiving","Symptoms","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/6376/news-flash-fitness-is-key-to-post-stroke-recovery"},{"post":{"author":"shireen12","post_time":"over 2 years ago","post_title":"Strokes","post_content":"My medication I am using is Clopidogrel. Can I use asprin instead? Clopidogrel as to many side effect. Makes me dizzy, fatigue. Can you please help me.\nThank you\nRegards\nShireen","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/6374/strokes"},{"post":{"author":"jrecufan","post_time":"over 3 years ago","post_title":"Can a really hard hit to the chest create a blood clot?","post_content":"My brother plays softball and last year, he took a direct hit to the chest from a softball hit to him (he was pitching). It was traveling about 100mph. Three weeks later he had a stroke that the doctors have never been able to determine a source of.\n\nIs it possible this could have created a blood clot? He has been tested and has no blockages or anything anywhere else.\n\nThoughts are appreciated!\nJohn","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/5970/can-a-really-hard-hit-to-the-chest-create-a-blood-clot"},{"post":{"author":"kmccaff","post_time":"over 3 years ago","post_title":"Anxiety of the unknown","post_content":"I had an ischemic stroke right posterior parietal last week. I regained full neurological function within hours of the event. I had many risk factors, migraines with aura, birth control pills, high cholesterol, and fibroelastoma on my aortic valve that could have led to the stroke but the exact cause is still unknown. I'm only 43. I have many follow up appointments with multiple different doctors: cardiologist, endocrinologist, neurologist, hematologist, and stroke specialist. These appointments are weeks away. With that being said, I'm suffering anxiety over every little pain, twinge, headache, aura, visual disturbance, feeling cold, feeling tired all the time. I don't know if these are normal day to day things, side effects from the stroke, or precursors to another stroke. Of course, my mind immediately thinks another stroke and I start to panic. Once I get the opportunity to speak with my team of doctors I, hopefully, will get some answers. But in the meantime, does anyone else have these type of symptoms that can ease my mind a little?","like_count":"0","tags":["Symptoms","Blood Clot"]},"responses":[{"author":"WebMD Chief Medical Director - Michael W. Smith, MD, MBA, CPT","resp_time":"over 3 years ago","resp_title":"RE: Anxiety of the unknown","resp_content":"Hi kmccaff,\n\nI know that had to be a very stressful event to go through. As you're doing, you definitely want to follow up with your doctors as they need to try to get to the bottom of why you had a stroke (it sounds like you may have had what we call a TIA (transient ischemic attack), which some people call a mini-stroke. With a TIA, the symptoms go away typically in a few hours like yours did. Strokes and TIAs generally do not have any symptoms prior to the event. So the symptoms you're experiencing are very unlikely related to anything to do with a stroke. You definitely want to talk to your doctors about this but one thing to consider is the stress you're under. Stress can not only make us feel random symptoms but it can make us worry excessively about what those symptoms mean. I would recommend practicing some relaxation techniques like deep breathing. You will feel the chemical changes happening in your body when you focus on your breathing. It's a magical stress reliever -- a sort of mini meditation. Give that a shot and let us know how you're feeling. And keep us posted on what you learn from your doctors. Check out this video on Meditation 101 http://www.webmd.com/balance/video/meditation-101-video\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/5094/anxiety-of-the-unknown"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"News Flash: Nerve 'Zap' Treatment May Speed Stroke Recovery","post_content":"An implanted device that provides electrical stimulation of the vagus nerve leading to the brain enhanced arm movement in a small group of stroke patients, researchers report.\n\nClick here to read more: http://wb.md/2m0uItu\n\nWe want to hear from you: Did you experience arm weakness after a stroke?","like_count":"0","tags":["Living & Managing","Silent Stroke","Prevention","Caregiving","Symptoms","Treatment","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/4726/news-flash-nerve-zap-treatment-may-speed-stroke-recovery"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"TIA/mini-stroke or stroke???","post_content":"I am in USA, while my Dad and family reside overseas. Dad is 91, with considerably good health for his age. He became very isolated, inactive, anti-social, and depressed, when started losing his hearing. He refused to wear hearing-aids.\n\nWe did not know what exactly happened, when he fell in the neighborhood. The back of his head bled; he got 3 stitches. As my family described it, he could raise both his arms, but with weak legs. He couldn't raise his left leg but could with the right slightly.\n\nThe doctor said that he had a \"mild stroke\" (directly and literally translated into English; it might make a difference in translation in actual meaning). Isn't a stroke a stroke, be it ischemic or hemorrhagic; can it be milder or at different degrees? From what I understood, if one has a stroke, wouldn't he be able to raise both arm and leg from the same side?\n\nI thought my Dad could just have a TIA, because his face did not change and could raise his arms. However, he has been in the hospital for 5 days; his legs are still as weak as the incident just happened. My family does not seem to get all the info from the doctor, so I am just wondering what happened and has happened to my Dad? Can anybody shed some light with me? Thanks","like_count":"1","tags":["Silent Stroke","Caregiving","Symptoms","Diagnosis","Blood Clot"]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: TIA/mini-stroke or stroke???","resp_content":"Hi there. Thanks for posting.\n\nI'm so sorry to hear about your father's stroke. It must have been very hard for him to experience, and for you as well.\n\nTo address what you said in your post, \"Isn't a stroke, a stroke, be it ischemic or hemorrhagic, can it milder or at different degrees?\" It says here ( http://wb.md/2dVL8QT ) to not jump to conclusions about how a stroke will affect someone because \"not all strokes are created equal.\" There are three major kinds, with different warning signs and symptoms. The severity of the stroke and how quickly your father received treatment will determine the severity of his symptoms. You can read more about the different types of strokes at the link above.\n\nIt says here ( http://wb.md/2dVNT4R ) that a transient ischemic attack (TIA) is when blood flow is block or reduced to a certain part of the brain, but after a short time, blood flow resumes and symptoms go away. With a stroke, the blood flow stays blocked and the brain has permanent damage. The article also says that it is sometimes called a \"mini-stroke\" because the symptoms are similar to those of a stroke but don't last long. Symptoms of a TIA commonly go away in 10 to 20 minutes. To read more information on transient ischemic attacks, then click on the link above.\n\nHave you considered requesting to speak with his doctors at the hospital? They would be the best people to answer all of your questions and concerns. It's clear how much you care about your father so I think you owe it to yourself to get some definitive answers about how he's doing.\n\nPlease be sure to come back and update us on how you and your father are doing. We're here for you.\n"},{"author":"WebMD Lead Medical Director - Brunilda Nazario, MD","resp_time":"over 3 years ago","resp_title":"RE: TIA/mini-stroke or stroke???","resp_content":"It sounds distressful & not being near him during this time must be difficult for you. Regardless of age, navigating healthcare system is a nightmare. I'm a doctor and its even hard for me to figure out a lot of the complexities of the healthcare system.\n\nHowever, the social isolation, inactivity, and depression may be at the root of some of the issues he is facing. A hearing aids will help him, yet they can be costly. Its key to address these tangible areas to help him recover and for the future; find a neighbor, home health aid, or others that can assist in these. Social services can help you navigate this.\n\nIts not known what caused his fall to begin with, but functional deterioration from his isolation and inactivity could also be at the root . Many elderly that live alone also have nutritional deficiencies, which contribute to some of the difficulties he faces.\nNone-the-less he had a fall and received an injury/contusion to his head and furthermore he has had a change potentially due to a stroke.\n\nFirst let’s start with some clarity and definitions of these terms. A stroke is a stroke is a stroke. Whether it’s a TIA [brief interruption of blood flow], or a completely block artery, or hemorrhagic ‘stroke’ it will cause similar deficits of mobility, or speech etc.\n\nA TIA is also a stroke- some call it a mini stroke- but it occurs when blood to the brain is only briefly interrupted. The symptom are similar to a stroke but don’t last as long as in a stroke and they disappear within hours.\n\nRegardless of the cause of the weakness, the symptoms signal a medical emergency and timing is critical because they are a warning sign; many people that have TIA’s go on to have a stroke and getting immediate medical care helps reduce the changes seen after a stroke. Reducing his risks is also key: reduce his social isolation, increase his level of physical activity and see if he can get physical rehabilitation, ensure a balance nutritious eating plan and avoiding alcohol and tobacco.\n\nbest of luck and prayers to you and your family,\nDr Bruni\n2\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/805/tia-mini-stroke-or-stroke"},{"post":{"author":"lltrotter","post_time":"over 3 years ago","post_title":"Stroke?","post_content":"My mother fell off a ladder and broke her hip, fractured her knee and elbow. She had hip replacement surgery. After surgery she had nausea. They gave her different nausea medication. She is better but not good. Now she is slurry her words and talking about things that never took place. Could she have had a stroke during surgery or shortly thereafter?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/4154/stroke"},{"post":{"author":"wjar1966","post_time":"over 3 years ago","post_title":"Is Eye Pain Normal After A Brain Bleed?","post_content":"Hello, my husband had a brain bleed on Oct 9th, 2016. It was not a stroke or anuerism. He was in ICU for 10 days and the top notch Boston doctors were unable to locate the reason or source of the bleed.\n\nHe finally has an appointment this coming Wednesday with a vascular headache specialist and hoping to find some relief with the every day pain.\n\nHis left eye hurts really bad and seems to be getting worse. The nuerologist said that the eye pain wouldn't have anything to do with the bleed. What is your opinion?","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/3777/is-eye-pain-normal-after-a-brain-bleed"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"How often does stroke go unnoticed?","post_content":"I'm a 22 year old male who has struggled with anxiety and depression in recent years, since I've been out of highschool I've floated between several jobs only working a couple of months per job, taking long periods in between with excessive drinking, smoking and eating, almost two years ago my parents were extremely worried with the way I was living my life and my somber attitude so we both decided I needed professional help, I visited both a Psychiatrist and a physician, both were vague in their diagnosis the Psychiatrist diagnosed me with basic depression and prescribed me with lexipro, and the physician said while I had high blood pressure and heart rate for someone my age it was probably just due to smoking and lack of diet and exercise, things were going alright for while, I was taking my depression meds and holding down a job for 4-5 months, but then I stopped taking it to go out drinking more frequently and soon after pointed out for missed days, I've had a few jobs since then but my physical and mental health have gotten worse since then, I've always been social and kept friends but now I don't like hang around anyone, I'm 6'1 and I've never been overweight but over the last year I've went from 165 to 215, I always figured that my lack of motivation and energy was a mental thing due to depression and poor coping mechanisms, but for some reason it doesn't seem that simply, since I was in middle school I've had these spells where my heart would sink into my chest and beat rapidly and if someone tried to talk to me I could barely make out what they were saying and they could tell something was wrong with me but through being adolescent at the time they first occurred I never really told anyone about it and would just tell people I didn't feel well when a spell occurred, later on in life I just assumed it was some form of panic attack, I've probably had close to 50 of these type of spells happen since 7th grade on a pretty inconsistent basis, but feeling physically drained on a consistent basis, some of the symptoms being dizziness, confusion, nausea, aches in my back and left arm, and twitching in my left eye, I've read up on strokes the symptoms seem the same but from what I know they usually occur at an older age and have more damaging affects to your neurological system than I'd say I'm going through, I don't go to the doctor regularly and I know most people if they even thought they were having stroke like symptoms would go immediately, but I figured I'd ask someone on here what they think cause it might just be something mild like a panic attack, but any help would be appreciated thanks.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: How often does stroke go unnoticed?","resp_content":"And sorry about the rambling, I should add loss of sleep and racing thoughts as well\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"Hi. I'm so sorry to hear you are struggling with all of this. It must be scary and overwhelming. I am not a medical professional, but I have worked in mental health. I think you made a very good choice seeing both a psychiatrist and medical doctor. I hope you consider returning to both. I don't want to guess at a diagnosis, but I will suggest that regardless of whether or not medical issues are causing your mental health struggles, you are nonetheless feeling bad/sad/anxious/etc and you don't have to. Unfortunately medications for mental health concerns work differently for people and sometimes take a few tries to get it right. I'm glad you reached out though, and I hope you start feeling better soon.","resp_content":"1\n"},{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: How often does stroke go unnoticed?","resp_content":"It doesn't matter what age & they go undiagnosed & misdiagnosed frequently, especially if you don't fit the pre-conceived mould!\nStroke or heart attacks can happen at any age, you could even be pre-dIsposed due to genetics, an un-diagnosed underlying health problem or it could be your lifestyle has had adverse effects.\nMy brother in law died at 37 of a myocardial infarction ( heart exploded) my husband was 37 when he suffered 3 heart attacks & my son 37 suffered 2 massive strokes.\nThe medical community at large we're too quick to say these are not related, not genetic!\nI beg to differ & I worry constantly that if my family are pre-disposed then my husband & my son remain at risk for future illness and also my other children could be walking timebombs.\nI don't believe anyone should rely on information about what a Heart Attack or a Stroke or any other illness should show. My husband was 5'11\" weighed 168 lbs, was not a drinker, did not do drugs, the tests performed at the hospital were all inconclusive but a very smart surgeon decided angioplasty should be done anyway as the pain would not stop. Massive surprise, 5 blockages, the widow maker was 97% blocked, 2 others 67 & 72% & 2 to lesser degrees.\nMy brother in law was about 20 lbs over weight but ate really healthy & exercised, he & his wife were expecting their first child when he passed away, he died within 15 minutes of his symptoms occurring.\nMy son weighed in at 165lbs, 5' 10\"; he did karate & regular exercise, he never smoked or did any type of drugs, did not abuse alcohol and had no health issues what so ever.\nMy husbands symptoms were extremely high BP; Profuse sweating; feeling nauseous & feeling pain in his arms.\nMy brother in law only complained about nausea suddenly & said he was short of breath & had a sharp pain in his chest.\nMy son showed all classic stroke symptoms, one side was very weak, arm & leg were limp, his face was drooping on one side, his speech was slurred & he was vomitting & extremely dizzy.\nThey almost sent my husband home because his blood work & scan showed nothing.\nMy brother in law had been to the Dr twice complaining of these symptoms but was dismissed, as for my son, the paramedics said 37 year olds don't take strokes, they even tried to suggest he had taken an overdose. They refused to take him to a stroke facility & even checked him in as stablized from possible overdose.\nLISTEN to your own body, if it feels different, like something is wrong, it probably is!\nIf Doctors, paramedics or whomever you see tries to fluff you off but you know it is NOT NORMAL; refuse to leave, demand a second opinion & most importantly ADVOCATE for yourself or those you love, do not be bullied or left to feel you are being a nuisance, if you feel ill or a loved one feels ill you have the right to be treated fairly & should NOT be sent home unless with 100% certainty you feel better and the medical professionals can guarantee you are out of any danger!\nEach person is different, although similarities can occur, don't wait for that to happen. Your situation could be totally unique just as you are, so demand that all tests be ran & reran if necessary before you walk out the door. This could be the difference between life & death!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/3224/how-often-does-stroke-go-unnoticed"},{"post":{"author":"savannahsofl","post_time":"over 3 years ago","post_title":"Stroke & Psoriasis","post_content":"My husband suffered a stroke a little over a year ago and has since developed severe psoriasis on his scalp and now on one of his legs, has anyone else ever heard of psoriasis being caused by stroke ? Im wondering if it is stress related. He had a right side stroke that affected his left side. He is left handed ,so he has had to learn to use his right hand and relearn everyday living, it has been pure hell for both of us as I am his only caregiver after all other resources have gone away. I would sincerely appreciate any help or advice I can get, just need to hear from others trying to stay sane after a stroke.","like_count":"0","tags":[]},"responses":[{"author":"Anonymous","resp_time":"over 3 years ago","resp_title":"RE: Stroke & Psoriasis","resp_content":"Have heard of the opposite. Look here: http://www.livescience.com/15632-psoriasis-stroke-atrial-fibrillation-risk.html\n\nPatients w/ psoriasis at higher risk of stroke. It would stand to reason that the reverse could be true as well. Best wishes to you and your husband.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/3465/stroke-psoriasis"},{"post":{"author":"lawrie7","post_time":"over 3 years ago","post_title":"Stroke in Young Person after Drug Overdose","post_content":"Hello: My son's dear friend, age 19, suffered a stroke on both sides of the brain after using morphine mixed with zanax. He is now in a medically induced coma, on a ventilator. Realistically, what kind of recovery can we expect?\n\nThanks for any responses.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/3463/stroke-in-young-person-after-drug-overdose"},{"post":{"author":"corgilegs82","post_time":"over 3 years ago","post_title":"Occipital Stroke Head Recovery","post_content":"Admitted Monday, released Wednesday with an occipital stroke. All labs, scans and testsrun very good numbers. I am experiencing a pressure or void feeling in the left side of me head, no pain at this point. This is the side I experienced the stroke on, and wondered if this is common? It is hard to find a lot of dialogue for this type of stroke. I also feel afraid to crack my jaw or jerk my head. No bleeding was seen in my scans.","like_count":"0","tags":["Living & Managing","Symptoms"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/2529/occipital-stroke-head-recovery"},{"post":{"author":"talleybat","post_time":"over 3 years ago","post_title":"partner has post stroke nausea/vomiting and thus inability to gain weight. Had 3 strokes within 4 weeks. Dec. '16. Also has type 2 diab. and high bp, needless to say. I am asking about anti nausea meds. Also want to start him on a very low carb diet.","post_content":"As all websites say, family is shocked at weight and muscle mass loss. He vomits and suffers from inability to keep food down\nHaving had chemo and radiation for breast cancer, I know there are anti nausea meds out there.\nHis caregivers are struggling with diabetic diet, which I have always found unnecessarily complicated. Why not just stay on as low a carb diet as one can?\nI have celiac disease, auto-immune disease triggered by gluten intake, so I know one can live without all the carbs in the American diet.\nPlease, your opinions are welcome. I am watching him literally starve.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/2240/partner-has-post-stroke-nausea-vomiting-and-thus-inability-to-gain-weight-had-3-strokes-within-4-weeks-dec-16-also-has-type-2-diab-and-high-bp-needless-to-say-i-am-asking-about-anti-nausea-meds-also-want-to-start-him-on-a-ver"},{"post":{"author":"samhot","post_time":"over 3 years ago","post_title":"Diagnosed with a TIA","post_content":"3 years ago, I suffered temporary loss of vision, in the right side/half of my right eye. I was found to have Giant Cell Arteritis and given Prednisolone. My eyesight returned to normal. Was down to 3mg this month and still progressing downwards. (Had a relapse along the way, maybe PMR ?)\n\n1st November 2016 I \"T\" boned a car on my scooter @ about 30-35mph. No serous damage.\n\nSunday 20th November 2016, suffered temporary sight loss as described above but no other symptoms associated with GCA. No warning at all no other symptoms.\nAttended Southampton Hospital walk in eye clinic. Prescribed 300mg Aspirin and increased Prednisolone up to 10mg, appointment made at the TIA centre in Lymington, Hampshire.\n\nAttended the Transient Ischemic Attack Centre, had an MRI scan of the head and an Ultra sound of the Carotid artery.\nScan was clear except for something lurking in the left side of the brain. Supposedly, not in an area connected with my symptoms.\nWant to do a different scan to be sure later. (3 different opinions on the scan apparently.)\nCarotid ultra sound, normal.\nGave up smoking and drinking a long time ago. Take regular quite testing exercise, gym and cross country running, slim build.\n\nPrescribed Clopidogrel 75mg.\nI had no other symptoms during physical examination and audio/oral/balance tests blood pressure and blood test.\nThe doctor wanted me to take Statins as well as Clopidogrel, which\nI declined as I did not have high blood pressure or high cholesterol.\nReading up on Statins, it would appear to be good for high cholesterol but not much else?\nI also read how Statins knock out coenzymeQ10 and other essentials, which would partially explain the muscular problems described elsewhere. The heart itself needs CoQ10?\nThe list of things such as, increased cases of non-malignant skin cancer (I've had both and remain well thank you!) and a more aggressive type prostate cancer in about 25% of cases where found. (I have low risk BPH.)\nWas it reasonable to decline the muscle wasting (gym and running ??) problematic Statins?\nWas that scooter crash significant?\nThank you for taking the time to read and consider this rambling story.\nsamhot (Thomas.)","like_count":"0","tags":["Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/1788/diagnosed-with-a-tia"},{"post":{"author":"vicisue","post_time":"over 3 years ago","post_title":"Should I still go to the Hospital","post_content":"I was at breakfast yesterday with friends and I know we were getting ready to leave, but I don't remember anything until we got home and in the house. They said I wasn't making any sense and what I was saying didn't fit in with the conversation and then I couldn't get my legs under me. They brought me home and I seemed to come out of it, still a little tired and not quite right, but no numbness or facial problems, just wondering should I still go to the hospital?","like_count":"1","tags":[]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Should I still go to the Hospital","resp_content":"Hi vicisue. Thanks for writing in.\n\nIt says here ( http://wb.md/2enIjY7) to call 911 or other emergency services if you experience any of these symptoms:\n\n1) Sudden numbness, tingling, weakness, or loss of movement in your face, arm, or leg, especially on only one side of your body.\n2) Sudden vision changes.\n3) Sudden trouble speaking.\n4) Sudden confusion or trouble understanding simple statements.\n5) Sudden problems with walking or balance.\n6) A sudden, severe headache that is different from past headaches.\n\nPlease seek medical attention immediately.\n\nI hope that you'll come back and let us know how you're doing.\n\nMy thoughts are with you.\n"},{"author":"mosaicarol","resp_time":"over 3 years ago","resp_title":"RE: Should I still go to the Hospital","resp_content":"You absolutely should be seen by a doctor right away. It might have been a TIA (warning stroke) or a drop in blood pressure following a large meal or something else. It's certainly not normal and should be looked into without delay.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/903/should-i-still-go-to-the-hospital"},{"post":{"author":"amyannt","post_time":"over 3 years ago","post_title":"Emotional 180","post_content":"My boyfriend had a stroke on Saturday. It was mild. He lost some motor skills on his right side. Up until last night, he was appreciative of my help, said he loved me, and was a little emotional at times. Last night, he said he hates me, doesn't want me there, thinks I want to be with another. I'm crushed.","like_count":"1","tags":["Caregiving"]},"responses":[{"author":"WebMD Chris","resp_time":"over 3 years ago","resp_title":"RE: Emotional 180","resp_content":"Hang in there.\n\nThink of a stroke as a traumatic brain event -- one that takes time to heal. The healing process is different for everyone. Your support is important and appreciated.\n\nCheck back and tell us how things are going.\n1\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/1649/emotional-180"},{"post":{"author":"cindy0816","post_time":"over 3 years ago","post_title":"swelling in hand 2 years after stroke","post_content":"My husband had a stroke over 2 years ago. He is perhaps 85% of who he was. Tires easily, poor balance, angers easily, can't stay awake. That being said, his stroke hand has swollen and stayed puffy for the last 2 months. He scraped it August 12th and it took it a long time to heal, but the swelling has not gone away. Anybodyelse experienced this?","like_count":"0","tags":[]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: swelling in hand 2 years after stroke","resp_content":"Hi there cindy0816. Thanks for posting.\n\nI'm sorry to hear of your husband's stroke. I highly suggest making an appointment with your husband's doctor to address the swelling of his hand.\n\nIt says here ( http://wb.md/2eFOfxd) that swelling also occurs when the affected arm or leg cannot move for a long period of time. Some tips to prevent swelling in your affected arm or leg include the following:\n\n1) Elevate the affected arm or leg. If your arm hangs down at your side for long periods of time, you will have more swelling in the arm.\n\n2) Follow your doctor's advice about what daily exercises to do. There are exercises you can do to help drain fluid from the affected arm or leg.\n\n3) See a physical therapist. He or she can teach you how to do special massages that can help move fluid out of your arm or leg. You also can learn what activities would be best for you.\n\n4) Try compression stockings to keep fluid from building up in your arm or leg. Your doctor or therapist can help you know what size to buy.\n\nPlease come back and update us after you've spoken to your husband's doctor.\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/1258/swelling-in-hand-2-years-after-stroke"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"stroke and ms","post_content":"Is there any correlation between stroke survivors and some getting ms?I am a stroke survivor going on 5 years now and I still have some neurological deficits,I am working,driving and self sufficient but my biggest fear is being at a high risk for ms.Does anyone know ?","like_count":"0","tags":["Living & Managing"]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: stroke and ms","resp_content":"Hi there, and welcome. I hope you get some good advice and support here. I also wanted to let you know about the Multiple Sclerosis message board, which can be found here: http://wb.md/2fd6Cbn . I think posting there could be quite helpful for this kind of question especially because there is an active expert who seems to get to everything when she looks in.\n\nI hope this helps!\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/1000/stroke-and-ms"},{"post":{"author":"Anonymous","post_time":"over 3 years ago","post_title":"It's a long story but I had a stoke recently","post_content":"Let me start at the beginning. Back in March I started noticing I was having a little trouble talking at work. I was in sales and had a sales pitch that I would say over and over again with no problems. I noticed that I was stumbling over words, stuttering and losing track of where I was. I wasn't extremely bad so I assumed it was stress because things were bad at work and I was looking for a new job. This continued for the next few months. At the end of May I was offered a new job that was exicted about. I quit the job I hated on May 26th since I was given a start date of June 13th. I decided to spend some summer time with my daughter. That job then was postponed a week or two. I tried calling the company several times and eventually was told it was postponed til August. June 25th I was sitting at home with my family when I got a metallic taste in the left side of my mouth. It also felt like something moved in my left ear canal. I assumed it was sinus issues so I took meds and both issues eventually went away. July 2nd we were at my in-laws and I walked out into their garage when suddenly my left cheek went numb. No other symptoms just numb. My husband checked me for obvious signs of stroke. There wasn't any so I went and sat down for awhile. The numbness eventually went away but still felt weird. I went to my Primary doctor July 5th, she saw no signs of stroke either. She gave me antibiotics and said if symptoms persisted that we would do an mri. July 9th I had trouble getting my eyes to focus then starting my left jaw bone started burning/tingling, it worked it's way up to my cheek bone and my left upper lip. I then noticed swelling and felt pressure around my left eye. Called my doc and scheduled the mri. When I got mri results I was told I had a brain tumor and was referred to brain surgeon. I of course freaked out. Surgery was schedueled. My pre op blood work came back showing my clotting function too high, retested, still high. Then I was sent to Hematologist to figure out what was going on. Turns out Several of my clotting functions were high. Because of that They determined I didn't have a tumor but a stroke. Surgery cancelled of course. I'm now on blood thinners to reduce the risk of another stroke.\nMy problem now is I'm scared all the time. What if it happens again? Worse this time? I cringe everytime I hear stroke mentioned. I'm on blood thinners what happens if I get cut? What if I'm one of the few that get internal bleeding and have no idea?\nI'm in training at a new job, not the one I was orginally offered because I can't get ahold of any one there, What if I can't handle this job? What if it's too soon? My family needs the money since our savings is depleted now. I just don't know what to do.","like_count":"0","tags":[]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/1034/it-s-a-long-story-but-i-had-a-stoke-recently"},{"post":{"author":"nuttywarhawk","post_time":"over 3 years ago","post_title":"loss of vision","post_content":"I've recently suffered a stroke and now I've had significant loss of vision in my left eye in speicifc. is this becauae of my stroke or another condition?","like_count":"0","tags":["Living & Managing","Silent Stroke","Symptoms","Treatment","Diagnosis"]},"responses":[{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: loss of vision","resp_content":"Hi there nuttywarhawk. Thanks for posting.\n\nI'm sorry to hear about your recent stroke. It says here ( http://wb.md/2dx8U52) that abrupt loss of vision and sudden dimness of vision, especially in one eye, are symptoms of a stroke. However, I suggest talking with your doctor about your symptoms and to possibly rule out any other conditions that might be affecting your vision.\n\nI hope you'll come back and let us know how you're doing :)\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/721/loss-of-vision"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"Are all strokes preventable?","post_content":"Well, maybe not all, but 9 out of 10 of them are.\n\nEven though strokes are one of the main causes for death and disability, a new study says that most of them are preventable.\n\nClick here to read more: http://wb.md/2cU6mz3 .\n\nRemember, the best way to treat a stroke is to prevent one from happening!\n\nNote to Readers: If you want to join this conversation, sign in (or sign up to be a WebMD member). See the link in the upper right corner of this page. Thanks!","like_count":"0","tags":["Silent Stroke","Prevention","Symptoms","Diagnosis"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/531/are-all-strokes-preventable"},{"post":{"author":"mimidoris1563","post_time":"over 3 years ago","post_title":"Question about home recovery","post_content":"My husband is 68 and recently suffered a mild stroke. He has paralysis in the left side of his body but is slowly gaining feeling and movement. Is there anything that we can do at home to help strengthen his muscles and move recovery along? He has a PT come to the house twice a week but I don't think that's enough. The more time goes by, the less dedicated he is to his recovery. I'm worried that he's giving up and saying this is as good as it's going to get when I think that he can push and do better. Anyone ever been through something like this?","like_count":"2","tags":["Living & Managing","Caregiving"]},"responses":[{"author":"swimfan01","resp_time":"over 3 years ago","resp_title":"RE: Question about home recovery","resp_content":"Mimi, your pre-stroke husband is somewhere in there! I have faith that he will put of this funk soon!\n1\n"},{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"RE: Question about home recovery","resp_content":"Hi there and thanks for posting. Being the caretaker of someone who is recovering from a stroke can take an immense emotional toll. When a loved one is faced with possibly having permanent disabilities as a result of a stroke, feelings of a depression, fear and anxiety may ensue.\n\nI suggest reading up on information about home recovery for not only the person who is recovering from a stroke, but for you, the caregiver:\n\n1) Stroke Rehabilitation - Concerns of the Caregiver: http://wb.md/2cFjRzl\n\n2) A Caregiver's Checklist for Daily Care: http://wb.md/2cfjeAC\n\n3) Tips for a Caregiver of Someone Who's Had a Stroke: http://wb.md/2d0PSHp\n\nHere ( http://wb.md/2cLYgcg ) is information on what to expect after a stroke. It says here that impairments from a stroke not only affect a person's muscles and movement, but there are also emotional impairments. Those recovering from a stroke might fall into a depression, which could responsible for them becoming stagnant with their progress.\n\nYou can read more about dealing with depression after a stroke here: http://wb.md/2cfjSON .\n\nPT is incredibly important but your husband might need a stroke rehab team, which is a team of health professionals who will work together to optimize your husband's recovery. You can read more about that here: http://wb.md/2cflJD5 .\n\nMy thoughts are with you during this time. Please keep us updated.\n"},{"author":"mimidoris1563","resp_time":"over 3 years ago","resp_title":"Thank you so much Morgan! I will be sure to look through these articles and let you know how he's doing. Right now we just taking it one day at a time.","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/384/question-about-home-recovery"},{"post":{"author":"WebMD Jamie","post_time":"over 3 years ago","post_title":"Where Salt Is Hiding (and Why You Need to Find It)","post_content":"Salt is sneaky – it hides in lots of foods that don’t even taste salty. Too much salt can lead to trouble for your heart, so it’s important to keep your sodium intake in check. WebMD blogger Dr. Elizabeth Klodas helps uncover some sources of \"sneaky sodium\" in her latest post: http://wb.md/2cd3AB8\n\nAre you cutting back on salt? What low-sodium eating strategies are working well for you?","like_count":"1","tags":["Prevention"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/445/where-salt-is-hiding-and-why-you-need-to-find-it"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"Does Alcohol Consumption Up Stroke Risk?","post_content":"Excessive alcohol consumption when paired with atrial fibrillation can increase your chance of stroke.\n\nClick here ( http://wb.md/2c5dDce) to read more.","like_count":"0","tags":["Living & Managing","Silent Stroke","Prevention","Caregiving","Symptoms","Treatment","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/264/does-alcohol-consumption-up-stroke-risk"},{"post":{"author":"WebMD Morgan","post_time":"over 3 years ago","post_title":"What happens after a stroke?","post_content":"Having a stroke can irrevocably change a person's life. The impairments of a stroke can depend on various things such as which side of the brain was affected, which part of the brain was damaged, the severity of the damage done to the brain, and your general health. Regardless, the impairments after a stroke can affect a person not only physically, but also emotionally, and a lot of people aren't prepared for these changes. The feeling that you aren't able to do all of the things you used to do can be frustrating, but you're not alone.\n\nDid you suffer any impairments after your stroke? How did it make you feel? I think that if people share their stories about their post-stroke experience then others won't feel so alone after they've experienced a stroke.\n\nClick here ( http://wb.md/2bmbFsB ) to read more about what to expect after a stroke.","like_count":"1","tags":["Silent Stroke","Prevention","Caregiving","Symptoms","Diagnosis","Blood Clot"]},"responses":[{"author":"cardiostarusa1","resp_time":"over 3 years ago","resp_title":"RE: What happens after a stroke?","resp_content":"About brain stroke (brain attack)\n\nRight hemisphere\n\nA stroke that involves the right hemisphere (side) of the brain can cause difficulties on the left side of the body including weakness (hemiparesis), paralysis (hemiplegia), lack of coordination of the arm, leg, and face, lack of sensation in the left side of the body, an overall lack of peripheral vision, problems judging distances, and an inability to think straight (clearly).\n\nLeft hemisphere\n\nA stroke that involves the left hemisphere of the brain can cause difficulties on the right side of the body including weakness, paralysis, lack of coordination of the arm, leg, and face, lack of sensation in the right side of the body, aphasia (e.g., slurred/distorted speech, difficulty listening, writing, reading, difficulty understanding numbers and an individual's speech), and slow, cautious, or disorganized behavior.\n"},{"author":"WebMD Morgan","resp_time":"over 3 years ago","resp_title":"Thanks for the info, cardiostarusa1","resp_content":""}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/138/what-happens-after-a-stroke"},{"post":{"author":"vakellas","post_time":"over 3 years ago","post_title":"Tips for Stroke attacks","post_content":"The basic tip is:\n\n1) Cough a lot - it will clear all the clogs.","like_count":"0","tags":[]},"responses":[{"author":"jponugotifeb2","resp_time":"over 3 years ago","resp_title":"RE: Tips for Stroke attacks","resp_content":"\nBut it will be so painful to cough too much\n\n"}],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/77/tips-for-stroke-attacks"},{"post":{"author":"WebMD Addie","post_time":"over 3 years ago","post_title":"Welcome to the Stroke Message Board.","post_content":"We are so excited to finally be able to share our new boards with you! Just a few housekeeping things to go over before you get started:\n\n- Bookmark this page so you can easily find us any time.\n\n- Make sure you check back frequently as conversations are always being added and expanded.\n\n- Head on over to your Message Board profile (just click on your account avatar in the top right corner of the page) to update your personal story and add a photo.\n\nDon’t see what you’re looking for?\n\n- Look through the tags at the top of the page to customize your view to only see posts that interest you.\n\n- When creating a post, choose a tag to add that most clicks with you. Using tags is encouraged but not required.\n\nLike what you see? Or need help? Send us an email at CommunityManagement@webmd.net","like_count":"0","tags":["Silent Stroke","Prevention","Caregiving","Symptoms","Treatment","Diagnosis","Blood Clot"]},"responses":[],"post_url":"https://messageboards.webmd.com/health-conditions/f/stroke/34/welcome-to-the-stroke-message-board"}]